{
  "Meta": {
    "Project": "Plan-Trek",
    "DataSet": "TravelGuidePlanets",
    "Build": 10,
    "Version": 1,
    "LastUpdated": "2025-12-15"
  },
  "Planets": [
    {
      "PlanetID": "planet-earth",
      "Name": "Earth",
      "AlternateNames": [
        "Sol III",
        "Terra"
      ],
      "TypeTags": [
        "Homeworld",
        "FederationCapital",
        "StarfleetHQ"
      ],
      "Location": {
        "Quadrant": "Alpha Quadrant",
        "QuadrantNotes": "Earth is the human homeworld and the seat of major Federation institutions.",
        "StarSystem": "Sol",
        "Sector": "Sector 001",
        "Region": "United Federation of Planets"
      },
      "QuickFacts": {
        "Class": "Class M",
        "PrimaryInhabitants": [
          "Humans"
        ],
        "PrimaryLanguageNotes": [
          "Federation Standard is widely used; most visitors will not have communication issues."
        ],
        "LocalTimekeeping": {
          "DayLengthHours": 24,
          "TimeFormat": "24-hour commonly used in Starfleet contexts"
        }
      },
      "TravelSummary": "Earth is the homeworld of humanity and the political heart of the United Federation of Planets. It is home to Starfleet Headquarters in San Francisco and remains a major diplomatic, cultural, and historical center.",
      "Appearance": {
        "GeneralLook": "A blue-white world dominated by oceans, varied continents, and dynamic cloud systems, with major metropolitan regions alongside protected natural reserves.",
        "FromOrbit": [
          "High-density orbital traffic and infrastructure during major Starfleet periods",
          "Major approach lanes into the Sol system and Earth orbit are tightly controlled during alerts"
        ],
        "NotableLandscapes": [
          "San Francisco Bay area and coastline",
          "European river valleys and historic urban cores",
          "Rural preserves and heritage sites tied to First Contact history"
        ],
        "SurfaceNotes": [
          "Civic architecture ranges from preserved pre-warp landmarks to sleek Federation-era public buildings.",
          "Many locations prominently integrate water features, parks, and pedestrian spaces."
        ]
      },
      "Geography": {
        "Biomes": [
          {
            "Name": "Oceans and coastlines",
            "Notes": ""
          },
          {
            "Name": "Temperate regions",
            "Notes": ""
          },
          {
            "Name": "Arid regions",
            "Notes": ""
          },
          {
            "Name": "Polar regions",
            "Notes": ""
          }
        ],
        "Landmarks": [
          {
            "Name": "San Francisco (Starfleet Headquarters area)",
            "Category": "City / Government",
            "CityOrRegion": "North America",
            "VisitorNotes": []
          }
        ],
        "Cities": [
          {
            "Name": "San Francisco",
            "Role": "Starfleet/Federation administrative hub (frequently )",
            "Highlights": [],
            "LocalVibe": ""
          }
        ]
      },
      "Inhabitants": {
        "Primary": [
          {
            "Species": "Human",
            "Notes": ""
          }
        ],
        "NotableCultures": [
          {
            "Name": "United Earth civic culture",
            "Notes": "Visitors will find strong norms around pluralism, diplomacy, and public education."
          },
          {
            "Name": "Starfleet community presence",
            "Notes": "Academy cadets, officers, and visiting crews shape local rhythms near major facilities."
          }
        ],
        "VisitorEtiquette": [
          "Expect security screening and identity checks near Starfleet and Federation facilities.",
          "Avoid restricted shoreline and airspace zones around major orbital-interface sites during alerts.",
          "Respect memorials and historic sites—many are treated as solemn civic spaces.",
          "Food culture is wide-ranging; reservations are common for renowned family restaurants."
        ]
      },
      "Weather": {
        "ClimateType": "Wide-ranging climates and seasons across continents, from polar to tropical.",
        "Seasonality": "Seasonal variation depends on region; many areas experience distinct seasonal cycles.",
        "TypicalConditions": [
          {
            "Region": "San Francisco Bay",
            "Conditions": [
              "Cool mornings/evenings",
              "Frequent coastal fog",
              "Mild wet season patterns"
            ]
          },
          {
            "Region": "Paris basin",
            "Conditions": [
              "Temperate seasons",
              "Cool winters",
              "Warm summers with occasional rain"
            ]
          },
          {
            "Region": "Gulf lowlands (e.g., New Orleans)",
            "Conditions": [
              "Hot humid summers",
              "Heavy rain periods",
              "Storm season precautions"
            ]
          }
        ],
        "Hazards": [
          {
            "Type": "Storm disruptions",
            "Notes": "Local storms can delay shuttle schedules and outdoor events; buffer time is recommended."
          },
          {
            "Type": "Security posture shifts",
            "Notes": "During major political or military events, travel corridors may change rapidly."
          }
        ]
      },
      "Tourism": {
        "TopAttractions": [
          {
            "Name": "Starfleet/Federation civic district (San Francisco)",
            "WhyGo": "Frequently Federation/Starfleet hub with recognizable waterfront setting."
          }
        ],
        "Activities": [
          "Museum and archive days (Federation history, warp-era exhibits)",
          "Bayfront walks and scenic transit loops",
          "Cuisine trips spanning regional Earth traditions",
          "Seasonal festivals and cultural performances"
        ],
        "Restrictions": [
          "No-fly / no-drone zones near Starfleet and Federation executive areas during high security.",
          "Certain Academy areas are cadet-only and may be closed during training and examinations."
        ],
        "SafetyNotes": [
          "Check current advisories for Sol system traffic controls before arrival.",
          "Carry ID and travel authorization if planning visits near major government campuses.",
          "During major anniversaries and ceremonies, crowds can be dense—plan transit accordingly."
        ]
      },
      "Logistics": {
        "Entry": [
          "Federation standard customs procedures (varies by era and political context).",
          "Visitors approaching through Earth orbit may be routed via controlled corridors, especially during alerts."
        ],
        "LocalTransport": [
          "High-capacity urban transit networks in major cities",
          "Shuttles and licensed air/space traffic near orbital-interface zones",
          "Transporter use depends on local infrastructure and security rules"
        ],
        "CurrencyNotes": [
          "Visitors should expect largely cashless exchange; carry travel credentials compatible with local services."
        ],
        "Lodging": [
          "City-center hotels and guest facilities near major cultural districts",
          "Outlying eco-lodges and heritage inns near historic sites"
        ],
        "Communications": [
          "Dense communications infrastructure; universal translator support is generally unnecessary for Standard speech, but available for visitors."
        ]
      },
      "CanonAppearances": {
        "FirstSeen": {
          "Series": "TOS",
          "EpisodeOrFilm": "The Cage (as referenced) / later visits",
          "YearInUniverse": null
        },
        "Key": []
      },
      "Tags": [
        "CoreWorld",
        "HighInfrastructure",
        "HighSecurityPotential"
      ],
      "Media": {
        "HeroImageURL": "https://raw.githubusercontent.com/BigBird7827/Pla-Trek/main/Images/Earth.png",
        "Gallery": []
      },
      "CitiesAndSites": {
        "MajorCities": [
          "San Francisco (Starfleet HQ/Academy precinct)",
          "Paris (Federation Presidency)"
        ],
        "PointsOfInterest": [
          "Starfleet Headquarters (near San Francisco Bay)",
          "Starfleet Academy (San Francisco)"
        ]
      }
    },
    {
      "PlanetID": "planet-vulcan",
      "Name": "Vulcan",
      "AlternateNames": [
        "Ni'Var (later era name)",
        "Ni'Var (later era)"
      ],
      "TypeTags": [
        "Homeworld",
        "FederationFoundingWorld"
      ],
      "Location": {
        "Quadrant": "Alpha Quadrant",
        "QuadrantNotes": "Vulcan is a core Federation member world associated with early Federation history.",
        "StarSystem": "Vulcan system (40 Eridani)",
        "Sector": "Vulcan sector",
        "Region": "United Federation of Planets (member world; later Ni'Var)"
      },
      "QuickFacts": {
        "Class": "Class M",
        "PrimaryInhabitants": [
          "Vulcans"
        ],
        "SkyNotes": [
          "Vulcan has no natural moons in canon references; it forms a binary pair with the companion planet T'Khut, which can be prominent in the sky under clear conditions."
        ],
        "LocalTimekeeping": {
          "DayLengthHours": null,
          "TimeFormat": "Local standards; visitors commonly rely on shipboard chronometers and civic time beacons."
        }
      },
      "TravelSummary": "Vulcan is the homeworld of the Vulcan people and an early member of the Federation. It is known for arid landscapes, rigorous cultural traditions, and prominent ceremonial and governmental sites.",
      "Appearance": {
        "GeneralLook": "Predominantly arid terrain with deserts and rocky plains, punctuated by settlements and ceremonial locations.",
        "FromOrbit": [
          "Desert belts and highland contours are visually dominant",
          "The Vulcan system’s companion world relationships are a notable feature of local cartography"
        ],
        "NotableLandscapes": [
          "Vulcan's Forge (desert/volcanic badlands)",
          "Sacred mountain sites (e.g., Mount Seleya)",
          "Desert-edge urban corridors (e.g., ShiKahr region)"
        ],
        "SurfaceNotes": [
          "Visitors commonly report intense light, rapid dehydration risk, and strong day–night comfort swings.",
          "Some wilderness zones can interfere with technology and require analog navigation backups."
        ]
      },
      "Geography": {
        "Biomes": [
          {
            "Name": "Desert and rocky plains",
            "Notes": ""
          }
        ],
        "Landmarks": [
          {
            "Name": "Forge",
            "Category": "Desert region",
            "CityOrRegion": "Vulcan",
            "VisitorNotes": []
          },
          {
            "Name": "Vulcan High Command / government district (era-dependent)",
            "Category": "Government",
            "CityOrRegion": "Vulcan",
            "VisitorNotes": []
          }
        ],
        "Cities": [
          {
            "Name": "ShiKahr",
            "Role": "Major city near the edge of the Forge",
            "Highlights": [
              "Desert-edge architecture optimized for shade and heat control",
              "Cultural residences associated with prominent Vulcan families in some eras"
            ],
            "LocalVibe": "Orderly, quiet, and tradition-forward; visitors are expected to be self-contained and respectful."
          },
          {
            "Name": "Gol",
            "Role": "Ancient city (historic/cultural reference)",
            "Highlights": [
              "Referenced in Vulcan historical accounts and cautionary tales",
              "Often approached as an educational stop rather than a leisure destination"
            ],
            "LocalVibe": "Austere heritage site—visit via curator-led routes if available."
          }
        ]
      },
      "Inhabitants": {
        "Primary": [
          {
            "Species": "Vulcan",
            "Notes": ""
          }
        ],
        "NotableCultures": [
          {
            "Name": "Surakian tradition",
            "Notes": "Pilgrimage, scholarship, and meditation are central to many visitor experiences."
          },
          {
            "Name": "Scientific institutions",
            "Notes": "Academic culture is prominent; lectures and symposiums can be major tourist draws in some eras."
          }
        ],
        "VisitorEtiquette": [
          "Keep your voice low; emotional displays are often considered disruptive in public spaces.",
          "Avoid unsolicited physical contact; ask permission before assisting someone physically.",
          "Never attempt or request a mind meld casually—consent and cultural context are critical.",
          "Dress for sun and dust: breathable layers, eye protection, and sealed footwear are standard.",
          "Carry water and electrolyte supplementation for outdoor travel; dehydration can escalate quickly.",
          "Follow shrine and sanctuary rules precisely: silence zones, footwear policies, and restricted steps are common.",
          "Do not treat sacred symbols (e.g., IDIC iconography) as casual merchandise in solemn spaces.",
          "When invited into a home, wait for explicit guidance on seating, food, and conversation topics.",
          "Photography/recording may be restricted in religious and academic areas—ask before capturing images.",
          "On guided treks, stay with your group; terrain and stormfronts can shift quickly."
        ]
      },
      "Weather": {
        "ClimateType": "Hot and arid in many regions.",
        "Seasonality": "Seasonal detail varies by region; heat and low humidity are common baseline conditions.",
        "TypicalConditions": [
          {
            "Region": "Desert plains",
            "Conditions": [
              "High daytime heat",
              "Dry air",
              "Dust gusts"
            ]
          },
          {
            "Region": "Forge region",
            "Conditions": [
              "Electrical sandstorms",
              "Geomagnetic instability",
              "Technology interference pockets"
            ]
          },
          {
            "Region": "Mountain routes",
            "Conditions": [
              "Cooler temperatures at elevation",
              "Strong winds",
              "Rapid exposure shifts"
            ]
          }
        ],
        "Hazards": [
          {
            "Type": "Sandfire storms",
            "Notes": "Fast-moving storms with blinding sand and lightning-like electrical discharges; can last hours to days and require sealed shelter."
          },
          {
            "Type": "Electrical sandstorms / geomagnetic interference (Forge)",
            "Notes": "Can interfere with scanners, communicators, and transporters (especially in 22nd-century tech contexts)."
          },
          {
            "Type": "Heat injury and dehydration",
            "Notes": "Primary day-trip risk for offworld visitors; plan shade breaks and carry water beyond Earth-normal expectations."
          }
        ]
      },
      "Tourism": {
        "TopAttractions": [
          {
            "Name": "Cultural and ceremonial sites (visit via approved protocols)",
            "WhyGo": "Vulcan culture and rituals are central to many stories; access is portrayed as formal."
          }
        ],
        "Activities": [
          "Guided desert treks (non-Forge routes recommended for casual visitors)",
          "Museum and archive visits focused on Vulcan history and philosophy",
          "Meditation retreats and cultural workshops (by invitation or registration)",
          "Night-sky viewing when conditions allow (companion planet visibility can be striking)"
        ],
        "Restrictions": [
          "Forge-area travel may require permits, guides, and approved equipment checklists.",
          "Sacred and governmental facilities may restrict offworld visitors during political tension or ceremonial periods.",
          "Some rites and trials are not tourist events; do not attempt participation without formal invitation."
        ],
        "SafetyNotes": [
          "Never enter the Forge without sealed shelter options and a guide familiar with storm behavior.",
          "Carry redundant navigation and communications options; some terrain can disrupt instruments.",
          "Plan arrivals and departures around heat peaks; dawn/dusk itineraries reduce risk.",
          "Respect local authority immediately during advisories—Vulcan enforcement is typically strict and procedural."
        ]
      },
      "Logistics": {
        "Entry": [
          "Expect strict customs and documentation checks; Vulcan authorities prioritize order and clarity.",
          "Visitors may be required to declare scientific equipment, recording devices, and medical supplies."
        ],
        "LocalTransport": [
          "Urban transit and regulated shuttles near major cities",
          "Licensed ground vehicles for desert routes",
          "Guided convoys for wilderness itineraries in higher-risk regions"
        ],
        "CurrencyNotes": [
          "Visitors should plan for credential-based payment systems and pre-authorized travel accounts."
        ],
        "Lodging": [
          "Quiet guest facilities with strong privacy norms near cities",
          "Retreat-style accommodations for meditation and study travelers",
          "Permit-based camps for guided expeditions"
        ],
        "Communications": [
          "Universal translator is useful for cultural nuance, but many Vulcans are fluent in Federation Standard in Federation-era contexts."
        ]
      },
      "CanonAppearances": {
        "FirstSeen": {
          "Series": "TOS",
          "EpisodeOrFilm": "Amok Time",
          "YearInUniverse": null
        },
        "Key": []
      },
      "Tags": [
        "HeatPreparednessRequired",
        "EtiquetteCritical",
        "GuidesRecommendedForWilderness"
      ],
      "Media": {
        "HeroImageURL": "https://raw.githubusercontent.com/BigBird7827/Pla-Trek/main/Images/Vulcan.png",
        "Gallery": []
      },
      "CitiesAndSites": {
        "MajorCities": [
          "ShiKahr (capital city)"
        ],
        "PointsOfInterest": [
          "The Forge (desert region)",
          "T'Karath Sanctuary (within the Forge)"
        ]
      }
    },
    {
      "PlanetID": "planet-ferenginar",
      "Name": "Ferenginar",
      "AlternateNames": [],
      "TypeTags": [
        "Homeworld"
      ],
      "Media": {
        "HeroImageURL": "https://raw.githubusercontent.com/BigBird7827/Pla-Trek/main/Images/Ferenginar.png",
        "Gallery": []
      },
      "Location": {
        "Quadrant": "Alpha Quadrant",
        "QuadrantNotes": "Ferenginar is located in Ferengi space in the Alpha Quadrant; no consistent sector label is established in primary canon.",
        "StarSystem": "Ferenginar system",
        "Sector": "",
        "Region": "Ferengi Alliance (capital world)"
      },
      "QuickFacts": {
        "Class": "Class M",
        "PrimaryInhabitants": [
          "Ferengi"
        ],
        "PrimaryLanguageNotes": [
          "Ferengi language is common in domestic contexts; Federation Standard is widely understood in trade-facing areas."
        ],
        "LocalTimekeeping": {
          "DayLengthHours": null,
          "TimeFormat": "Local standards; visitors typically rely on shipboard chronometers and civic time beacons for appointments."
        }
      },
      "TravelSummary": "Ferenginar is the homeworld of the Ferengi and a major center of Ferengi commerce and government. The planet is known for frequent rainfall and heavy humidity.",
      "Appearance": {
        "GeneralLook": "Overcast skies and persistent rain are common, with wet streets and covered market spaces in urban districts.",
        "FromOrbit": [
          "Persistent cloud cover and broad weather systems are common",
          "Approach traffic concentrates around major commercial hubs and government districts"
        ],
        "NotableLandscapes": [
          "Lowland wetlands and swampy basins",
          "River channels and drainage corridors carrying heavy runoff",
          "Dense urban districts clustered around major marketplaces"
        ],
        "SurfaceNotes": [
          "Expect wet ground conditions almost everywhere—non-slip footwear and sealed bags are standard.",
          "Many high-traffic civic areas are covered or partially enclosed to keep commerce moving during downpours."
        ]
      },
      "Geography": {
        "Biomes": [
          {
            "Name": "Humid lowlands",
            "Notes": ""
          },
          {
            "Name": "Wetlands / muddy basins",
            "Notes": ""
          }
        ],
        "Landmarks": [
          {
            "Name": "Tower of Commerce",
            "Category": "Government / Commerce",
            "CityOrRegion": "Capital district",
            "VisitorNotes": []
          }
        ],
        "Cities": [
          {
            "Name": "Capital market district",
            "Role": "Government and commerce center ()",
            "Highlights": [],
            "LocalVibe": ""
          }
        ]
      },
      "Inhabitants": {
        "Primary": [
          {
            "Species": "Ferengi",
            "Notes": ""
          }
        ],
        "NotableCultures": [
          {
            "Name": "Rules of Acquisition civic culture",
            "Notes": "Business norms and social etiquette are often framed through the Rules of Acquisition and the pursuit of profit."
          },
          {
            "Name": "Ferengi Commerce Authority presence",
            "Notes": "Regulatory enforcement exists alongside widespread graft and aggressive sales tactics; visitors should stick to reputable vendors."
          }
        ],
        "VisitorEtiquette": [
          "Assume every price is negotiable unless explicitly posted as fixed—haggling is expected in many contexts.",
          "Get agreements in writing (or recorded contract form) before exchanging funds or goods—clarify fees, delivery, and refunds.",
          "Avoid insulting someone’s business acumen; negotiations are social contests as much as transactions.",
          "Keep personal financial details private; targeted upselling and ‘exclusive’ offers are common.",
          "Respect local laws and social norms, including gender and dress restrictions in specific venues—do not assume offworld norms apply.",
          "Be cautious with gifts and ‘samples’—confirm whether they’re free before accepting."
        ]
      },
      "Weather": {
        "ClimateType": "Humid climate with frequent, heavy rainfall.",
        "Seasonality": "Rain is described as persistent and pervasive; local weather variation is more about intensity and storm bursts than clear dry seasons.",
        "TypicalConditions": [
          {
            "Region": "Capital districts",
            "Conditions": [
              "Heavy rain",
              "Overcast skies",
              "High humidity"
            ]
          }
        ],
        "Hazards": [
          {
            "Type": "Torrential rain",
            "Notes": "Sudden downpours can flood low streets and disrupt surface travel; plan sheltered routes and flexible timing."
          },
          {
            "Type": "Humidity exposure",
            "Notes": "Electronics, paper goods, and clothing can degrade quickly without sealing and drying routines."
          },
          {
            "Type": "Slippery surfaces",
            "Notes": "Polished stone, metal walkways, and market tiles can be slick; non-slip footwear is strongly recommended."
          }
        ],
        "TravelGear": [
          "Sealed outer layer or poncho; quick-dry clothing",
          "Waterproof bags for comm devices and padds",
          "Non-slip footwear",
          "Anti-fog eye protection in heavy humidity"
        ]
      },
      "Tourism": {
        "TopAttractions": [
          {
            "Name": "Tower of Commerce (exterior / authorized areas)",
            "WhyGo": "Iconic seat of Ferengi leadership and a recognizable skyline feature."
          }
        ],
        "Activities": [
          "Market crawls with a vetted guide (price-checking and safe vendor lists)",
          "Cultural lectures on the Rules of Acquisition and Ferengi economic history",
          "Museum days (trade, gambling, negotiation exhibits)",
          "Food and beverage tastings with humidity-resistant packaging"
        ],
        "Restrictions": [
          "Government and FCA areas in the Tower of Commerce may be closed without notice during investigations or political shifts.",
          "Some venues enforce local social norms strictly; verify dress and conduct rules before arrival."
        ],
        "SafetyNotes": [
          "Avoid ‘too-good-to-be-true’ offers—use licensed vendors and confirm authentication for high-value items.",
          "Do not carry all funds or latinum in one place; use secure accounts and incremental transfers.",
          "If a deal becomes pressured or time-limited, walk away—high-pressure tactics are common in tourist zones."
        ]
      },
      "Logistics": {
        "Entry": [
          "Expect customs declarations focused on trade goods, valuables, and commercial equipment.",
          "Business-visas or transaction permits may be required for high-value buying/selling depending on era and local policy."
        ],
        "LocalTransport": [
          "Covered pedestrian corridors within major market districts",
          "Licensed ground transport and shuttle links between civic zones",
          "Transit routes may reroute around flooded streets during heavy rain bursts"
        ],
        "CurrencyNotes": [
          "Latinums and contract-based credit arrangements are common in Ferengi trade contexts; confirm exchange and fee schedules in writing."
        ],
        "Lodging": [
          "Business hotels and guest houses near major market hubs",
          "Humidity-managed suites (recommended for visitors with sensitive equipment or attire)"
        ],
        "Communications": [
          "Universal translator is helpful for negotiations and contract nuance; consider using verified legal translation services for major purchases."
        ]
      },
      "CanonAppearances": {
        "FirstSeen": {
          "Series": "DS9",
          "EpisodeOrFilm": "Family Business",
          "YearInUniverse": null
        },
        "Key": [
          {
            "SeriesOrFilm": "DS9: Family Business",
            "Notes": ""
          },
          {
            "SeriesOrFilm": "DS9: Prophet Motive",
            "Notes": ""
          },
          {
            "SeriesOrFilm": "DS9: The Magnificent Ferengi",
            "Notes": ""
          }
        ]
      },
      "Tags": [
        "RainWorld",
        "HighHaggleCulture",
        "HumidityPreparednessRequired",
        "TouristScamRisk"
      ],
      "CitiesAndSites": {
        "MajorCities": [
          "(Capital) — commonly treated as the seat of the Grand Nagus’ government"
        ],
        "PointsOfInterest": [
          "Tower of Commerce",
          "Great Marketplace / Sacred Marketplace (public commerce district)"
        ]
      }
    },
    {
      "PlanetID": "planet-risa",
      "Name": "Risa",
      "AlternateNames": [],
      "TypeTags": [
        "ResortWorld"
      ],
      "Media": {
        "HeroImageURL": "https://raw.githubusercontent.com/BigBird7827/Pla-Trek/main/Images/Risa.png",
        "Gallery": []
      },
      "Location": {
        "Quadrant": "Beta Quadrant",
        "QuadrantNotes": "Risa’s quadrant placement varies across cartography and reference works; recent star charts and summaries commonly place it in the Beta Quadrant.",
        "StarSystem": "Epsilon Ceti star system (Epsilon Ceti B)",
        "Sector": "(unspecified sector)",
        "Region": "United Federation of Planets (member world; major tourism destination)"
      },
      "QuickFacts": {
        "Class": "Class M",
        "PrimaryInhabitants": [
          "Risians"
        ],
        "PrimaryLanguageNotes": [
          "Federation Standard is widely used in tourism districts; local language and customs remain prominent in cultural settings."
        ],
        "LocalTimekeeping": {
          "DayLengthHours": null,
          "TimeFormat": "Local standards; resort schedules and Starfleet visitors commonly operate on shipboard chronometers."
        }
      },
      "TravelSummary": "Risa is a Federation resort world renowned for leisure culture and climate control systems designed to maintain comfortable conditions for visitors.",
      "Appearance": {
        "GeneralLook": "Tropical coasts, lagoons, resort architecture, and landscaped gardens are characteristic of the main visitor zones.",
        "FromOrbit": [
          "Bright ocean expanses with frequent cloud bands",
          "Approach routes are dense during peak travel seasons",
          "Tourism hubs produce distinctive night-side illumination clusters around resort belts"
        ],
        "NotableLandscapes": [
          "White-sand beaches and shallow coastal shelves",
          "Warm lagoons and reef-like shallows near resort districts",
          "Garden complexes and landscaped courtyards integrated into hotels and villas"
        ],
        "SurfaceNotes": [
          "Public spaces prioritize walkability: covered paths, misting arches, and shaded plazas.",
          "Dress norms are relaxed in resort zones, but guests should still respect posted rules for sacred/cultural sites."
        ]
      },
      "Geography": {
        "Biomes": [
          {
            "Name": "Tropical coasts and beaches",
            "Notes": ""
          },
          {
            "Name": "Lagoon / resort districts",
            "Notes": ""
          }
        ],
        "Landmarks": [
          {
            "Name": "Resort districts (various)",
            "Category": "Resort",
            "CityOrRegion": "Primary visitor zones",
            "VisitorNotes": []
          }
        ],
        "Cities": [
          {
            "Name": "Resort Belt (capital tourism district)",
            "Role": "Primary visitor zone and hospitality core",
            "Highlights": [
              "Lagoon resorts and villas",
              "Beach clubs and cultural events",
              "High-capacity transit loops and concierge hubs"
            ],
            "LocalVibe": "Festive, relaxed, flirtatious, and service-forward—designed to make visitors forget they’re on a schedule."
          }
        ]
      },
      "Inhabitants": {
        "Primary": [
          {
            "Species": "Risian",
            "Notes": ""
          }
        ],
        "NotableCultures": [
          {
            "Name": "Hospitality guild culture",
            "Notes": "Tourism work is highly respected; many services are ritualized into ‘experiences’ rather than simple transactions."
          },
          {
            "Name": "Jamaharon tradition (symbolic courtship custom)",
            "Notes": "Often referenced through the horga'hn statuette; treated playfully in resort zones but still grounded in local etiquette."
          }
        ],
        "VisitorEtiquette": [
          "Consent-first: flirting is common, but never assume interest; follow clear verbal or behavioral cues.",
          "If you accept an invitation, clarify expectations—Risians often treat communication as part of the experience.",
          "Respect local symbols (including the horga'hn) and avoid using them to embarrass others.",
          "Dress norms are relaxed, but resorts still post rules for dining, ceremonies, and formal events—follow them.",
          "Don’t mock leisure culture; on Risa, relaxation is treated as a serious civic priority."
        ]
      },
      "Weather": {
        "ClimateType": "Warm, stabilized weather maintained by planetary climate systems.",
        "Seasonality": "Conditions are intentionally moderated; seasonal extremes are minimal in resort regions.",
        "TypicalConditions": [
          {
            "Region": "Resort coasts",
            "Conditions": [
              "Warm, comfortable temperatures",
              "Gentle breezes",
              "Clear skies",
              "Short, controlled showers (when scheduled)"
            ]
          },
          {
            "Region": "Interior garden districts",
            "Conditions": [
              "Humid but comfortable air",
              "Filtered sunlight",
              "Evening warmth",
              "Low wind"
            ]
          }
        ],
        "Hazards": [
          {
            "Type": "Weather-control disruption (story-dependent)",
            "Notes": ""
          }
        ],
        "TravelGear": [
          "Light breathable clothing plus one dry layer for sudden storms",
          "Sun protection (hat/visor, sunscreen)",
          "Waterproof pouch for comm devices",
          "Comfort footwear for long promenade walks"
        ],
        "Summary": "Tropical ‘paradise’ conditions are largely engineered: Risa’s weather control system is used to maintain consistently pleasant temperatures, breezes, and skies for visitors."
      },
      "Tourism": {
        "TopAttractions": [
          {
            "Name": "Beach and resort stay",
            "WhyGo": "Core depiction: leisure, warm water, and resort culture."
          },
          {
            "Name": "Horga'hn custom (cultural symbol)",
            "WhyGo": "Recurring element associated with Risian romance culture."
          }
        ],
        "Activities": [
          "Beach and lagoon swimming",
          "Sailing and small-craft excursions (conditions permitting)",
          "Resort spa circuits and wellness programs",
          "Nightlife: clubs, live music, and themed social events",
          "Guided cultural tours focusing on Risian customs and hospitality traditions"
        ],
        "Restrictions": [
          "Weather control and planetary infrastructure sites are restricted.",
          "Some events have explicit participation rules; resorts may enforce conduct standards tightly to protect guests."
        ],
        "SafetyNotes": [
          "Use official booking channels—tourist zones can attract opportunistic scams and counterfeit ‘exclusive’ passes.",
          "If storms hit, leave the water immediately and follow resort shelter instructions.",
          "Set boundaries clearly; if someone ignores them, contact resort security—Risa prioritizes guest safety and consent."
        ]
      },
      "Logistics": {
        "Entry": [
          "Federation-friendly arrival procedures; peak seasons can produce heavy traffic and longer berth allocation times.",
          "Resorts often handle customs/registration through pre-arrival concierge workflows."
        ],
        "LocalTransport": [
          "Resort transit loops (shuttles, trams, and pedestrian corridors)",
          "Licensed watercraft and charter excursions",
          "Transporter use varies by venue and local security posture"
        ],
        "CurrencyNotes": [
          "Resort packages and Federation-standard payments are common; confirm what’s included vs. premium add-ons before arrival."
        ],
        "Lodging": [
          "Lagoon resorts, beach hotels, and private villas",
          "Quiet retreat properties away from main nightlife zones"
        ],
        "Communications": [
          "Excellent tourism communications coverage; most visitors operate comfortably in Federation Standard with translator support for nuance."
        ]
      },
      "CanonAppearances": {
        "FirstSeen": {
          "Series": "TNG",
          "EpisodeOrFilm": "Captain's Holiday",
          "YearInUniverse": null
        },
        "Key": [
          {
            "SeriesOrFilm": "TNG: Captain's Holiday",
            "Notes": ""
          },
          {
            "SeriesOrFilm": "DS9: Let He Who Is Without Sin...",
            "Notes": ""
          },
          {
            "SeriesOrFilm": "ENT: Two Days and Two Nights",
            "Notes": ""
          }
        ]
      },
      "Tags": [
        "ParadiseByDesign",
        "ConsentCulture",
        "HighTourismDensity",
        "InfrastructureDependentWeather"
      ],
      "CitiesAndSites": {
        "PointsOfInterest": [
          "Resort zones and shore-leave districts (weapons prohibited)",
          "Weather control complex (restricted; seen during sabotage events)",
          "Temtibi Lagoon",
          "Suraya Bay",
          "Eluvian Mud Baths"
        ],
        "MajorCities": [
          "Nuvia (capital city; reference works)"
        ]
      }
    },
    {
      "PlanetID": "planet-qonos",
      "Name": "Qo'noS",
      "AlternateNames": [
        "Kronos",
        "The Klingon Homeworld"
      ],
      "TypeTags": [
        "Homeworld",
        "CapitalWorld"
      ],
      "Media": {
        "HeroImageURL": "https://raw.githubusercontent.com/BigBird7827/Pla-Trek/main/Images/Qo'noS.png",
        "Gallery": []
      },
      "Location": {
        "Quadrant": "Beta Quadrant",
        "QuadrantNotes": "Sector label for Qo'noS is given in reference summaries and cartography; Klingon-space borders shift by era.",
        "StarSystem": "Qo'noS system",
        "Sector": "Sector 70 (Qo'noS sector)",
        "Region": "Klingon Empire (capital world)"
      },
      "QuickFacts": {
        "Class": "Class M",
        "PrimaryInhabitants": [
          "Klingons"
        ],
        "PrimaryLanguageNotes": [
          "Klingon (tlhIngan Hol) is dominant; Federation Standard is understood in diplomatic, trade, and offworlder-facing contexts."
        ],
        "LocalTimekeeping": {
          "DayLengthHours": null,
          "TimeFormat": "Local standards; visitors often rely on shipboard chronometers when coordinating with offworld schedules."
        }
      },
      "TravelSummary": "Qo'noS (Kronos) is the Klingon homeworld and the seat of imperial politics. The First City and the Great Hall are central locations for governance and ceremony.",
      "Appearance": {
        "GeneralLook": "Rugged, austere landscapes and monumental civic architecture are central of the capital.",
        "FromOrbit": [
          "Approach corridors are tightly managed, with traffic patterns shaped by Klingon security and military priorities",
          "Major population centers present dense night-side illumination clusters, with heavy emphasis around the capital region"
        ],
        "NotableLandscapes": [
          "Volcanic regions and basaltic terrain",
          "Extensive cave systems and subterranean networks",
          "Rugged highlands and broad plains outside major urban centers"
        ],
        "SurfaceNotes": [
          "Many civic buildings are designed for spectacle: grand entrances, wide courtyards, and intimidating vertical scale.",
          "Expect visible security—uniformed guards, checkpoints, and restricted zones near government sites."
        ]
      },
      "Geography": {
        "Biomes": [
          {
            "Name": "Rugged plains and rocky terrain",
            "Notes": ""
          }
        ],
        "Landmarks": [
          {
            "Name": "First City",
            "Category": "Capital city",
            "CityOrRegion": "Qo'noS",
            "VisitorNotes": []
          },
          {
            "Name": "Great Hall",
            "Category": "Government / Ceremonial",
            "CityOrRegion": "First City",
            "VisitorNotes": []
          }
        ],
        "Cities": [
          {
            "Name": "First City",
            "Role": "Imperial capital ()",
            "Highlights": [],
            "LocalVibe": ""
          }
        ]
      },
      "Inhabitants": {
        "Primary": [
          {
            "Species": "Klingon",
            "Notes": ""
          }
        ],
        "NotableCultures": [
          {
            "Name": "Great House politics",
            "Notes": "Major families (Houses) hold power, influence, and obligation networks; visitors should avoid casually taking sides in disputes."
          },
          {
            "Name": "Ritual honor culture",
            "Notes": "Many interactions are framed through public respect, challenge etiquette, and visible confidence—ambiguity can be read as weakness or deception."
          }
        ],
        "VisitorEtiquette": [
          "Use correct titles and names; show respect for rank and House affiliation when it is declared.",
          "Be direct and keep promises—backing out of agreements can be treated as dishonorable.",
          "Avoid public mockery or sarcasm about Klingon tradition; it can escalate quickly.",
          "Do not touch weapons, ceremonial objects, or House insignia without permission.",
          "Follow checkpoint instructions immediately; arguing with guards is a fast way to end your trip.",
          "If invited to a ritual or ceremony, ask a local liaison about expected conduct beforehand."
        ]
      },
      "Weather": {
        "ClimateType": "Varies by region and season.",
        "Seasonality": "Seasonality depends on region; travel conditions can change quickly with local weather.",
        "TypicalConditions": [
          {
            "Region": "Capital region / First City",
            "Conditions": [
              "Overcast or green-tinged skies in some depictions",
              "Windy periods",
              "Cool evenings",
              "Occasional storms"
            ]
          },
          {
            "Region": "Volcanic and cave-adjacent zones",
            "Conditions": [
              "Dry heat near active features",
              "Rapid temperature shifts",
              "Sulfurous haze in localized pockets",
              "Low visibility around vents"
            ]
          }
        ],
        "Hazards": [
          {
            "Type": "Security closures during unrest",
            "Notes": "Political events can lock down transit corridors and public squares with little notice; keep alternate routes and shelter options."
          },
          {
            "Type": "Volcanic / geothermal activity",
            "Notes": "Avoid unescorted travel near vents, unstable rock, and restricted cavern systems."
          },
          {
            "Type": "Environmental stress (historical)",
            "Notes": "In late-23rd-century contexts, the Praxis disaster created planet-wide environmental strain and heightened controls."
          }
        ],
        "TravelGear": [
          "Layered clothing for variable temperatures",
          "Weather-sealed bag for comm devices",
          "Sturdy boots with good traction",
          "A formal outfit if attending civic events (as advised by your liaison)"
        ]
      },
      "Tourism": {
        "TopAttractions": [
          {
            "Name": "Great Hall (authorized access)",
            "WhyGo": "Central location for Klingon ceremony and High Council politics."
          }
        ],
        "Activities": [
          "Guided city walks in authorized districts",
          "Ceremony observation (when permitted)",
          "Curated cultural briefings with a local liaison",
          "Supervised excursions to geological viewpoints away from restricted zones"
        ],
        "Restrictions": [
          "Government buildings and High Council-adjacent areas are frequently restricted to authorized visitors.",
          "Security conditions can change rapidly based on House politics or imperial events."
        ],
        "SafetyNotes": [
          "Travel with a vetted liaison if you plan to visit civic centers—this is not a casual walk-up destination.",
          "Avoid bartering with unauthorized agents offering 'Council access' or 'House introductions'.",
          "If challenged or provoked, disengage and leave—do not escalate without local guidance."
        ]
      },
      "Logistics": {
        "Entry": [
          "Entry requirements vary with the Klingon Empire’s diplomatic posture; visitors may need sponsorship, permits, or escort arrangements.",
          "Expect strict inspections for weapons, recording equipment, and contraband."
        ],
        "LocalTransport": [
          "Guarded transit corridors and checkpointed routes in capital districts",
          "Ground transport and shuttle links between authorized zones",
          "Access restrictions are common near ceremonial sites and government compounds"
        ],
        "CurrencyNotes": [
          "Trade rules depend on era and local policy; confirm what exchanges are permitted before arrival."
        ],
        "Lodging": [
          "Guest quarters in authorized districts (often arranged through sponsors)",
          "Diplomatic accommodations for official travelers"
        ],
        "Communications": [
          "Translator support is strongly recommended for formal proceedings and legal terms; direct language is culturally preferred."
        ]
      },
      "CanonAppearances": {
        "FirstSeen": {
          "Series": "TNG",
          "EpisodeOrFilm": "Sins of the Father",
          "YearInUniverse": null
        },
        "Key": [
          {
            "SeriesOrFilm": "TNG: Sins of the Father",
            "Notes": ""
          },
          {
            "SeriesOrFilm": "TNG: Redemption / Redemption II",
            "Notes": ""
          },
          {
            "SeriesOrFilm": "Star Trek VI: The Undiscovered Country (Praxis disaster context)",
            "Notes": ""
          }
        ]
      },
      "Tags": [
        "HonorCulture",
        "HighSecurity",
        "CeremonyHeavy",
        "VolcanicGeology",
        "PoliticalFlashpoint"
      ],
      "CitiesAndSites": {
        "MajorCities": [
          "First City (capital city)"
        ],
        "PointsOfInterest": [
          "Great Hall",
          "Klingon High Council chamber (in the Great Hall)"
        ]
      }
    },
    {
      "PlanetID": "planet-andoria",
      "Name": "Andoria",
      "AlternateNames": [
        "Andor"
      ],
      "TypeTags": [
        "Homeworld",
        "IceWorld"
      ],
      "Media": {
        "HeroImageURL": "https://raw.githubusercontent.com/BigBird7827/Pla-Trek/main/Images/Andoria.png",
        "Gallery": []
      },
      "Location": {
        "Quadrant": "Beta Quadrant",
        "QuadrantNotes": "Andoria (also known as Andor) is the Andorian homeworld and a core Federation member world in later eras.",
        "StarSystem": "Procyon system",
        "Sector": "Sector 006",
        "Region": "United Federation of Planets",
        "DistanceFromSol_LY": 11
      },
      "QuickFacts": {
        "Class": "Class M",
        "PrimaryInhabitants": [
          "Andorians",
          "Aenar"
        ],
        "PrimaryLanguageNotes": [
          "Andorian is common in domestic settings; Federation Standard is widely used in government, trade, and offworlder-facing contexts."
        ],
        "LocalTimekeeping": {
          "DayLengthHours": null,
          "TimeFormat": "Local standards; visitors commonly coordinate via shipboard chronometers for tours and transport windows."
        }
      },
      "TravelSummary": "Andoria is the Andorian homeworld, an ice-dominant world of glaciers and severe cold. It is notable for Andorian culture and for its role as a major Federation member world in later eras.",
      "Appearance": {
        "GeneralLook": "Bright ice fields, glaciers, and stormy skies dominate; many facilities and settlements are built for extreme cold.",
        "FromOrbit": [
          "Large reflective ice sheets dominate the surface coloration",
          "Storm bands and polar cloud systems are common",
          "Night-side illumination clusters concentrate around major cities and protected corridors"
        ],
        "NotableLandscapes": [
          "Polar ice caps and continent-scale glaciers",
          "Jagged mountain ridges and frozen highlands",
          "Cracked sea-ice plates and frozen coastal shelves"
        ],
        "SurfaceNotes": [
          "Most public infrastructure assumes freezing temperatures—expect enclosed walkways, sealed transport, and strict safety protocols.",
          "Visibility can shift rapidly with blowing snow and low cloud ceilings."
        ]
      },
      "Geography": {
        "Biomes": [
          {
            "Name": "Glaciers and ice plains",
            "Notes": ""
          },
          {
            "Name": "Polar and highland regions",
            "Notes": ""
          }
        ],
        "Landmarks": [],
        "Cities": [
          {
            "Name": "Capital city (primary civic hub)",
            "Role": "Government, diplomacy, and cultural center",
            "Highlights": [
              "Civic halls and ceremonial plazas",
              "Museums and cultural briefings (where available)",
              "Insulated transit corridors connecting key districts"
            ],
            "LocalVibe": "Orderly and formal, with a strong sense of public duty; visitors are welcomed when respectful but are expected to follow rules precisely."
          }
        ]
      },
      "Inhabitants": {
        "Primary": [
          {
            "Species": "Andorian",
            "Notes": ""
          },
          {
            "Species": "Aenar",
            "Notes": ""
          }
        ],
        "NotableCultures": [
          {
            "Name": "Service-forward civic tradition",
            "Notes": "Government, defense, and public duty are culturally prominent; visitors should expect a more formal tone than on leisure worlds."
          }
        ],
        "VisitorEtiquette": [
          "Dress for the environment and for formality—arriving underprepared is viewed as careless.",
          "Be direct and honest; evasive answers can be interpreted as disrespect or concealment.",
          "Ask before photographing people, ceremonies, or security infrastructure—many locations have strict restrictions.",
          "Respect Aenar privacy rules and any restricted-zone boundaries without debate.",
          "Follow local safety instructions in storms without improvisation."
        ]
      },
      "Weather": {
        "ClimateType": "Severe cold with frequent wind and snow.",
        "Seasonality": "High-latitude seasonality can produce large daylight shifts and extended storm cycles in some regions.",
        "TypicalConditions": [
          {
            "Region": "Urban/capital corridors",
            "Conditions": [
              "Freezing temperatures",
              "Wind chill",
              "Intermittent snowfall",
              "Low cloud ceilings"
            ]
          },
          {
            "Region": "Open glacier plains",
            "Conditions": [
              "Whiteouts",
              "Blowing snow",
              "Rapid visibility loss",
              "Crevasse hazards under fresh snow"
            ]
          },
          {
            "Region": "High ridges and exposed overlooks",
            "Conditions": [
              "Strong winds",
              "Extreme wind chill",
              "Fast-moving squalls",
              "Icy surfaces"
            ]
          }
        ],
        "Hazards": [
          {
            "Type": "Whiteout conditions",
            "Notes": "Visibility can drop to near-zero quickly; guided routes and locator beacons are standard outside city limits."
          },
          {
            "Type": "Wind chill and exposure",
            "Notes": "Frostbite risk rises quickly in exposed zones—use layered thermal protection and adhere to time limits outdoors."
          },
          {
            "Type": "Ice and crevasses",
            "Notes": "Marked corridors exist near tourist viewpoints; do not deviate from approved paths."
          }
        ],
        "TravelGear": [
          "Thermal layers with windproof outer shell",
          "Insulated boots with high-traction soles",
          "Eye protection for blowing snow",
          "Weather-sealed pouch for comm devices",
          "Emergency heat packs for excursions"
        ]
      },
      "Tourism": {
        "TopAttractions": [
          {
            "Name": "Guided icefield vistas (where permitted)",
            "WhyGo": "The ice-world environment is Andoria’s defining feature."
          }
        ],
        "Activities": [
          "Guided icefield excursions with safety beacons",
          "Aurora viewing in clear polar nights (seasonal)",
          "Indoor cultural events and formal receptions (by invitation/permit)",
          "Cuisine tastings suited to cold climates (warm broths, spiced dishes, hot beverages)"
        ],
        "Restrictions": [
          "Many government and security-adjacent areas require permits or sponsorship.",
          "Aenar regions are culturally protected and typically not open to casual tourism.",
          "Storm alerts can close surface travel rapidly."
        ],
        "SafetyNotes": [
          "Do not attempt independent wilderness travel—use licensed guides and keep to marked corridors.",
          "Carry verified shelter locations and transport fallback routes in case of closures.",
          "Respect local security procedures; delays at checkpoints are normal and not negotiable."
        ]
      },
      "Logistics": {
        "Entry": [
          "Federation-friendly for most visitors, but permit requirements can increase during political or security events.",
          "Expect safety briefings for any excursion beyond protected urban districts."
        ],
        "LocalTransport": [
          "Enclosed ground transit, heated corridors, and shuttle links between districts",
          "Weather-related reroutes and temporary closures are common during storms"
        ],
        "CurrencyNotes": [
          "Federation-standard payments are common in visitor districts; confirm excursion and gear rental inclusions in advance."
        ],
        "Lodging": [
          "Insulated hotels and guest quarters within protected districts",
          "Expedition lodging for guided multi-day tours (seasonal and tightly regulated)"
        ],
        "Communications": [
          "Strong urban coverage; out-of-city travel should include locator services and emergency beacons as standard."
        ]
      },
      "CanonAppearances": {
        "FirstSeen": {
          "Series": "ENT",
          "EpisodeOrFilm": "The Andorian Incident",
          "YearInUniverse": null
        },
        "Key": [
          {
            "SeriesOrFilm": "ENT: The Andorian Incident",
            "Notes": ""
          },
          {
            "SeriesOrFilm": "ENT: United",
            "Notes": ""
          }
        ]
      },
      "Tags": [
        "IceWorld",
        "FoundingWorld",
        "SevereWeather",
        "PermitSensitiveAreas",
        "GuidedExcursionsRecommended"
      ]
    },
    {
      "PlanetID": "planet-bajor",
      "Name": "Bajor",
      "AlternateNames": [
        "Bajora"
      ],
      "TypeTags": [
        "Homeworld"
      ],
      "Media": {
        "HeroImageURL": "https://raw.githubusercontent.com/BigBird7827/Pla-Trek/main/Images/Bajor.png",
        "Gallery": []
      },
      "Location": {
        "Quadrant": "Alpha Quadrant",
        "QuadrantNotes": "Bajor is explicitly placed in the Bajor sector of the Alpha Quadrant in reference summaries.",
        "StarSystem": "Bajoran system",
        "Sector": "Bajor sector",
        "Region": "Bajoran space (Federation-aligned in later eras)"
      },
      "QuickFacts": {
        "Class": "Class M",
        "PrimaryInhabitants": [
          "Bajorans"
        ],
        "PrimaryLanguageNotes": [
          "Bajoran is common in domestic settings; Federation Standard is widely used in government, trade, and offworld-facing contexts."
        ],
        "LocalTimekeeping": {
          "DayLengthHours": null,
          "TimeFormat": "Local standards; visitors often coordinate with Deep Space 9 schedules and shipboard chronometers."
        },
        "Moons": [
          "Derna",
          "Jeraddo"
        ]
      },
      "TravelSummary": "Bajor is the Bajoran homeworld, a fertile world of river valleys and mountain provinces. Bajoran society is closely tied to the Prophets-centered faith and the planet’s recovery after the Cardassian Occupation. The Bajoran wormhole lies nearby in the Denorios Belt.",
      "Appearance": {
        "GeneralLook": "Green valleys, terraced hillsides, rivers, and warm-toned stone architecture are common across provinces and cities.",
        "FromOrbit": [
          "Broad green landmasses and deep-blue seas with visible weather systems",
          "Dense illumination clusters around major population centers and reconstruction corridors"
        ],
        "NotableLandscapes": [
          "Mountain valleys and river deltas",
          "Agricultural provinces and terraced farmlands",
          "Coastal belts and inland seas",
          "Cave and canyon systems associated with religious myth and history"
        ],
        "SurfaceNotes": [
          "Rural regions can feel timeless and pastoral, while urban districts show visible modernization after the Occupation.",
          "Travel between provinces is common for pilgrimages and memorial visits; many routes have cultural significance."
        ]
      },
      "Geography": {
        "Biomes": [
          {
            "Name": "Temperate valleys and riverlands",
            "Notes": ""
          },
          {
            "Name": "Mountain regions",
            "Notes": ""
          }
        ],
        "Landmarks": [
          {
            "Name": "Bajor City (capital)",
            "Category": "Capital city",
            "CityOrRegion": "Bajor",
            "VisitorNotes": []
          },
          {
            "Name": "Fire Caves",
            "Category": "Religious site",
            "CityOrRegion": "Bajor",
            "VisitorNotes": []
          }
        ],
        "Cities": [
          {
            "Name": "Bajor City",
            "Role": "Capital (as referenced/)",
            "Highlights": [],
            "LocalVibe": ""
          }
        ]
      },
      "Inhabitants": {
        "Primary": [
          {
            "Species": "Bajoran",
            "Notes": ""
          }
        ],
        "NotableCultures": [
          {
            "Name": "Prophets-centered faith",
            "Notes": "Religion is embedded in public life: shrines, monasteries, and ceremonies are common, and visitors are expected to show respect even when not participating."
          },
          {
            "Name": "Post-Occupation civic identity",
            "Notes": "Memorial culture and political vigilance remain strong; certain topics are sensitive, especially in public or around veterans."
          }
        ],
        "VisitorEtiquette": [
          "Treat shrines, monasteries, and religious symbols with respect—ask before photographing ceremonies or sacred objects.",
          "Avoid casually debating Occupation history with strangers; many families are directly affected.",
          "When invited into a religious space, follow host instructions on dress, voice level, and where to stand.",
          "Use official guides for archaeological sites—Bajor values preservation and controls access to fragile ruins.",
          "Be mindful of local politics: rallies, assemblies, and security shifts can occur around major events."
        ]
      },
      "Weather": {
        "ClimateType": "Regionally variable Class-M climate, ranging from temperate valleys to cooler mountain provinces.",
        "Seasonality": "Seasonal shifts are noticeable by province, with wetter periods in valleys and coastal belts and cooler conditions at altitude.",
        "TypicalConditions": [
          {
            "Region": "River valleys and farmland provinces",
            "Conditions": [
              "Warm days",
              "Mild evenings",
              "Periodic rain",
              "Morning fog in lowlands"
            ]
          },
          {
            "Region": "Mountain passes and monastery ridges",
            "Conditions": [
              "Cooler air",
              "Fast weather changes",
              "Windy overlooks",
              "Cloud ceilings that can drop quickly"
            ]
          },
          {
            "Region": "Coastal belts",
            "Conditions": [
              "Humid air",
              "Sea breezes",
              "Seasonal storms",
              "Clear days alternating with rain bands"
            ]
          }
        ],
        "Hazards": [
          {
            "Type": "Storm bands and flash rains",
            "Notes": "Localized downpours can affect road and shuttle timing, especially in valleys."
          },
          {
            "Type": "Seismic activity (historical episodes)",
            "Notes": "Certain periods saw major quakes tied to wormhole instability; modern advisories may still reference vulnerable zones."
          }
        ],
        "TravelGear": [
          "Light layers for warm valleys and cool ridges",
          "Rain shell or compact poncho during wet seasons",
          "Comfort footwear for pilgrimage routes and stone stairs",
          "A respectful outfit for monastery visits (as advised locally)"
        ]
      },
      "Tourism": {
        "TopAttractions": [
          {
            "Name": "Monasteries and pilgrimage sites (where open)",
            "WhyGo": "Bajoran faith and sacred sites are central ."
          }
        ],
        "Activities": [
          "Temple and monastery visits (guided/approved)",
          "Valley hikes and scenic overlooks (seasonal)",
          "Cultural lectures on Bajoran history and faith (official venues)",
          "Local food tastings (regional breads, stews, and produce-forward dishes)",
          "Museum and memorial tours in urban districts"
        ],
        "Restrictions": [
          "Certain religious sites restrict recording and limit non-participant access during ceremonies.",
          "Some ruins and provinces have permit requirements to protect cultural heritage and sensitive recovery areas.",
          "Fire Caves access is often restricted or culturally discouraged."
        ],
        "SafetyNotes": [
          "Use licensed guides for ruins and remote routes; some areas still contain Occupation-era hazards or unstable structures.",
          "Respect security instructions during political events—crowd control can change quickly.",
          "Avoid buying looted artifacts; Bajor takes cultural theft seriously."
        ]
      },
      "Logistics": {
        "Entry": [
          "Entry requirements vary by era and political climate; visitors may need permits for certain provinces, digs, or religious sites.",
          "If arriving via Deep Space 9, expect coordination between station schedules and planet-side customs."
        ],
        "LocalTransport": [
          "Shuttles and ground vehicles connecting major cities and provinces",
          "Guided transport for archaeology routes and remote monasteries",
          "Weather and event-driven delays are common during storms or assemblies"
        ],
        "CurrencyNotes": [
          "Local commerce is active but culturally regulated around sacred objects and artifacts; confirm what is legal to purchase and export."
        ],
        "Lodging": [
          "Urban hotels and guesthouses in the capital",
          "Rural inns along pilgrimage routes (seasonal availability)",
          "Retreat-style accommodations near approved monasteries"
        ],
        "Communications": [
          "Good coverage in cities; rural valleys may require relay service or tour-provided comm support."
        ]
      },
      "CanonAppearances": {
        "FirstSeen": {
          "Series": "DS9",
          "EpisodeOrFilm": "Emissary",
          "YearInUniverse": null
        },
        "Key": [
          {
            "SeriesOrFilm": "DS9: Emissary",
            "Notes": ""
          },
          {
            "SeriesOrFilm": "DS9: What You Leave Behind (Fire Caves)",
            "Notes": ""
          }
        ]
      },
      "Tags": [
        "PilgrimageFriendly",
        "ArchaeologyHeavy",
        "PermitSensitiveSites",
        "PostOccupationContext",
        "RespectfulTourism"
      ],
      "CitiesAndSites": {
        "MajorCities": [
          "Bajor City (capital)"
        ]
      }
    },
    {
      "PlanetID": "planet-cardassia-prime",
      "Name": "Cardassia Prime",
      "AlternateNames": [
        "Cardassia"
      ],
      "TypeTags": [
        "Homeworld",
        "CapitalWorld"
      ],
      "Media": {
        "HeroImageURL": "https://raw.githubusercontent.com/BigBird7827/Pla-Trek/main/Images/Cardassia%20Prime.jpg",
        "Gallery": []
      },
      "Location": {
        "Quadrant": "Alpha Quadrant",
        "QuadrantNotes": "Cardassia Prime is placed in Cardassian space in the Alpha Quadrant; sector naming is not consistently provided in primary canon.",
        "StarSystem": "Cardassian system",
        "Sector": "",
        "Region": "Cardassian Union (capital world)",
        "Nearby": [
          "~5 light years from Bajor (system distance reference)"
        ]
      },
      "QuickFacts": {
        "Class": "Class M",
        "PrimaryInhabitants": [
          "Cardassians"
        ],
        "PrimaryLanguageNotes": [
          "Cardassian is dominant; Federation Standard is used in diplomatic and offworld-facing contexts."
        ],
        "LocalTimekeeping": {
          "DayLengthHours": null,
          "TimeFormat": "Local standards; visiting schedules are often coordinated through official itineraries and security checkpoints."
        }
      },
      "TravelSummary": "Cardassia Prime is the Cardassian homeworld and the capital of the Cardassian Union. Its political institutions have included Central Command and the Detapa Council, and the planet’s fate is central to the Dominion War’s endgame.",
      "Appearance": {
        "GeneralLook": "A generally arid world with dust-toned landscapes and monumental urban architecture in major population centers.",
        "FromOrbit": [
          "Large landmasses with muted coloration consistent with arid regions",
          "Night-side illumination clustered around major urban centers and industrial corridors"
        ],
        "NotableLandscapes": [
          "Arid plains and rocky highlands",
          "Dusty basins and dry valleys",
          "Heavily built urban and industrial corridors"
        ],
        "SurfaceNotes": [
          "Public spaces in major cities can feel formal and surveilled; expect signage and guard presence even in civilian districts.",
          "Outside approved visitor routes, conditions can become harsher and services sparser."
        ]
      },
      "Geography": {
        "Biomes": [],
        "Landmarks": [
          {
            "Name": "Central Command (institutional seat, access restricted)",
            "Category": "Government / Military",
            "CityOrRegion": "Cardassia Prime",
            "VisitorNotes": []
          },
          {
            "Name": "Detapa Council (institutional seat, era-dependent)",
            "Category": "Government",
            "CityOrRegion": "Cardassia Prime",
            "VisitorNotes": []
          }
        ],
        "Cities": [
          {
            "Name": "Lakarian City",
            "Role": "Capital and primary visitor gateway (when open)",
            "Highlights": [
              "Monumental civic architecture",
              "Approved museums and public history venues",
              "Formal plazas and government-adjacent boulevards"
            ],
            "LocalVibe": "Controlled, ceremonial, and security-forward—public spaces often feel designed for processions, surveillance, and state visibility."
          }
        ]
      },
      "Inhabitants": {
        "Primary": [
          {
            "Species": "Cardassian",
            "Notes": ""
          }
        ],
        "NotableCultures": [
          {
            "Name": "State-and-service civic identity",
            "Notes": "Public messaging and ceremony frequently highlight duty and the legitimacy of institutions; visitors should expect formal conduct norms in civic spaces."
          }
        ],
        "VisitorEtiquette": [
          "Keep documentation ready; officials may request identification frequently.",
          "Use formal address and avoid casual jokes about the state, military, or recent conflicts.",
          "Don’t photograph guards, checkpoints, or restricted buildings unless explicitly permitted.",
          "If invited into a family home, follow host rules—hospitality can be formal and status-conscious.",
          "Avoid discussing Bajoran Occupation history with strangers; it is politically and personally sensitive."
        ]
      },
      "Weather": {
        "ClimateType": "Often characterized by heat, dry air, and dust-laden conditions in many regions.",
        "Seasonality": "Seasonal detail varies by region; heat and low humidity are common baseline conditions.",
        "TypicalConditions": [
          {
            "Region": "Capital/urban corridors",
            "Conditions": [
              "Warm to hot days",
              "Dry air",
              "Haze and dust",
              "Cooler nights depending on season"
            ]
          },
          {
            "Region": "Open plains and outskirts",
            "Conditions": [
              "Hot sun",
              "Dust-laden winds",
              "Low humidity",
              "Rapid visibility changes during gusts"
            ]
          }
        ],
        "Hazards": [
          {
            "Type": "Dust storms / wind events",
            "Notes": "Blowing dust can reduce visibility and irritate respiratory systems; use sealed eyewear and filtration when advised."
          },
          {
            "Type": "Heat exposure",
            "Notes": "Dehydration risk rises quickly in open areas; carry water and follow excursion time limits."
          }
        ],
        "TravelGear": [
          "Light, breathable clothing plus a sun-shielding outer layer",
          "Sealed eyewear for dust",
          "Hydration kit",
          "Weather-sealed pouch for comm devices"
        ]
      },
      "Tourism": {
        "TopAttractions": [],
        "Activities": [
          "Guided city walks in authorized districts",
          "Museum visits and public exhibitions (where open)",
          "Officially hosted cultural talks and receptions (permit/sponsor dependent)"
        ],
        "Restrictions": [
          "Government, intelligence, and military-adjacent areas are restricted.",
          "Political conditions can close attractions and reroute tours with little notice."
        ],
        "SafetyNotes": [
          "Use licensed guides and official booking channels—avoid ‘access brokers’ offering restricted entry.",
          "Follow checkpoint instructions immediately; do not argue protocol on-site.",
          "Stay aware of advisories related to post-war reconstruction or local unrest."
        ]
      },
      "Logistics": {
        "Entry": [
          "Entry requirements depend heavily on diplomatic conditions; sponsorship and escorted itineraries may be required.",
          "Expect inspections for weapons, recording equipment, and restricted materials."
        ],
        "LocalTransport": [
          "Checkpointed surface routes in major cities",
          "Licensed shuttles and controlled corridors between approved zones",
          "Reroutes and closures are common during security escalations"
        ],
        "CurrencyNotes": [
          "Exchange and purchasing rules can vary by era and policy; confirm what transactions are permitted before arrival."
        ],
        "Lodging": [
          "Authorized hotels/guest quarters within controlled districts (often arranged through sponsors)",
          "Diplomatic accommodations for official travelers"
        ],
        "Communications": [
          "Translator support is recommended for formal notices and legal terms; expect monitoring in some districts."
        ]
      },
      "CanonAppearances": {
        "FirstSeen": {
          "Series": "DS9",
          "EpisodeOrFilm": "What You Leave Behind",
          "YearInUniverse": null
        },
        "Key": [
          {
            "SeriesOrFilm": "DS9: What You Leave Behind",
            "Notes": ""
          }
        ]
      },
      "Tags": [
        "PermitSensitiveTravel",
        "HighSecurity",
        "MonumentalArchitecture",
        "AridConditions",
        "PostWarContext"
      ],
      "CitiesAndSites": {
        "MajorCities": [
          "Lakarian City"
        ]
      }
    }
  ]
}
