[
  {
    "PlanetID": "planet-earth",
    "Name": "Earth",
    "AlternateNames": [
      "Sol III",
      "Terra"
    ],
    "Tags": [
      "Homeworld",
      "Federation core world",
      "Starfleet Headquarters",
      "Federation governance hub"
    ],
    "TypeTags": [
      "Homeworld",
      "FederationCapital",
      "StarfleetHQ"
    ],
    "Meta": {
      "CanonicalName": "Earth",
      "Classification": "Inhabited Class M terrestrial planet (Sol III/Terra) in the Sol system; one natural satellite (Luna)",
      "Affiliation": "United Federation of Planets (founding world; Federation founded on Earth in 2161); Earth’s unified planetary authority is known as United Earth (22nd century onward)",
      "NativeSpecies": [
        "Human"
      ]
    },
    "Media": {
      "HeroImageURL": "https://raw.githubusercontent.com/BigBird7827/Pla-Trek/main/Images/Earth.png"
    },
    "TravelSummary": "Earth—also known as Sol III or Terra—is Humanity’s homeworld, located in the Sol system within Sector 001. Across Starfleet history it functions as a cultural homeworld and an administrative center, strongly associated with Starfleet Headquarters and Starfleet Academy in the San Francisco Bay / Presidio area, and with the Federation President’s office in Paris.\n\nEarth’s on-screen modern history includes major turning points: the Bell Riots in San Francisco’s Sanctuary District A in September 2024; the end of World War III in 2053 and the ensuing “post-atomic horror”; the Phoenix warp flight and First Contact with Vulcans on April 5, 2063 near Bozeman, Montana; the unification of the planet under United Earth in the 22nd century; and the founding of the United Federation of Planets on Earth (San Francisco) in 2161.\n\nIn the 23rd–24th centuries, Earth is repeatedly treated as strategically pivotal and is directly impacted by major crises, including the Whale Probe incident (2286), the Battle of Sector 001 during a Borg attempt to assimilate Earth (2373), and a Breen raid that struck Starfleet Headquarters and San Francisco in late 2375.",
    "Location": {
      "Quadrant": "Alpha Quadrant",
      "Sector": "Sector 001 (Sol sector / Terran sector)",
      "StarSystem": "Sol system (Terran system)",
      "Region": "Federation core",
      "NearbyLandmarks": [
        "Luna",
        "Earth orbit",
        "San Francisco Bay / Presidio (Starfleet campus area)"
      ]
    },
    "Appearance": "A blue-and-white globe with extensive oceans and dynamic cloud systems. Starfleet-era depictions often emphasize Earth’s limb with orbital traffic or installations, and the Golden Gate / San Francisco waterfront frequently serves as an iconic ground-level establishing view.",
    "Geography": "A water-rich, multi-continent Class M world with broad regional diversity (oceans, mountain ranges, deserts, forests, polar regions, and extensive urban development). Canon depictions frequently establish the San Francisco Bay / Golden Gate region as a major Starfleet landmark area, while other stories highlight sites such as Paris, Bozeman (Montana), and New Orleans.",
    "CitiesAndSites": [
      {
        "Name": "San Francisco Bay / Presidio (Starfleet campus area)",
        "Type": "Administrative / Academy",
        "Description": "Associated with Starfleet Headquarters and Starfleet Academy; repeatedly used as a visual and narrative anchor for Starfleet and Federation operations."
      },
      {
        "Name": "Paris, France",
        "Type": "Government / Diplomatic",
        "Description": "Associated with the office of the Federation President in some eras; referenced as a key Federation executive location on Earth."
      },
      {
        "Name": "Bozeman, Montana",
        "Type": "Historic site",
        "Description": "Associated with Zefram Cochrane’s Phoenix and the first open Human–Vulcan contact on April 5, 2063."
      },
      {
        "Name": "Sanctuary District A (San Francisco)",
        "Type": "Historic district",
        "Description": "Walled district central to the Bell Riots of September 2024."
      },
      {
        "Name": "New Orleans, Louisiana",
        "Type": "Cultural / Residential",
        "Description": "Joseph Sisko’s restaurant and the Sisko family’s home base; an Earthside setting during the Dominion War period."
      },
      {
        "Name": "Luna",
        "Type": "Natural satellite",
        "Description": "Earth’s moon; frequently referenced in navigation and often visible in orbital/planetary establishing shots."
      }
    ],
    "Inhabitants": "Humans are Earth’s native sentient species and the planet’s primary population across eras. As a Federation hub world, Earth also hosts frequent visitation and residency by many Federation member species; on-screen sources do not provide a consistent demographic breakdown.",
    "Tourism": "Earth is a premier destination for Federation-era history, culture, and iconic civic landmarks. Frequently highlighted canon points of interest include Starfleet’s San Francisco campus area, Paris as a Federation political site, and Bozeman’s First Contact legacy. The planet’s natural diversity supports a wide range of travel experiences.",
    "Logistics": "Approaches commonly route through Earth orbit and major transport infrastructure (spaceport/orbital facilities vary by era). Expect restricted access around Starfleet and Federation installations, and heightened security protocols during periods of crisis affecting the Sol sector.",
    "Weather": {
      "ClimateType": "Highly variable (multi-biome)",
      "Seasonality": "Varies strongly by region; temperate zones show pronounced seasonal cycles while tropical belts follow wet/dry patterns",
      "TypicalConditions": "Conditions range from marine-coastal fog and mild weather to continental storms and arid heat depending on location and season",
      "Hazards": [
        "Severe storms (region-dependent)",
        "Heatwaves/cold snaps (seasonal)",
        "Earthquakes/tsunami risk (localized)",
        "Wildfire risk (region-dependent)"
      ]
    },
    "History": {
      "Overview": "On-screen history places Earth’s major modern turning points across the 21st–24th centuries: the Bell Riots in September 2024; World War III ending in 2053 with a prolonged ‘post-atomic horror’ aftermath; First Contact with Vulcans on April 5, 2063; the rise of United Earth as a unified planetary authority in the 22nd century; and the founding of the United Federation of Planets on Earth in 2161. Earth remains strategically central and is repeatedly threatened by major external crises.",
      "KeyEras": [
        {
          "Era": "21st century (pre-warp)",
          "Summary": "Sanctuary Districts culminate in the Bell Riots (September 2024); later, World War III ends in 2053 and is followed by global turmoil remembered as the post-atomic horror."
        },
        {
          "Era": "First Contact and early interstellar era",
          "Summary": "Phoenix warp flight and first open Human–Vulcan contact occur on April 5, 2063 near Bozeman, Montana, accelerating Earth’s recovery and interstellar integration."
        },
        {
          "Era": "United Earth / NX era",
          "Summary": "Earth is unified under United Earth in the 22nd century; early Starfleet expands exploration and defense, including responses to major security threats."
        },
        {
          "Era": "Federation era",
          "Summary": "The Federation is founded on Earth (San Francisco) in 2161; Earth becomes a durable political, cultural, and Starfleet administrative hub."
        },
        {
          "Era": "Late 23rd–24th century crises",
          "Summary": "Earth is directly impacted by galaxy-scale events including the Whale Probe incident (2286), the Borg attack culminating in the Battle of Sector 001 (2373), and the Breen raid (2375)."
        }
      ],
      "MajorEvents": [
        {
          "When": "September 2024",
          "Event": "Bell Riots begin in San Francisco’s Sanctuary District A; treated as a pivotal social flashpoint."
        },
        {
          "When": "2053",
          "Event": "World War III ends; the ‘post-atomic horror’ describes the global turmoil that follows."
        },
        {
          "When": "April 5, 2063",
          "Event": "Phoenix achieves warp flight; first open Human–Vulcan contact occurs near Bozeman, Montana (First Contact Day)."
        },
        {
          "When": "22nd century",
          "Event": "Earth is unified under United Earth as a single planetary authority."
        },
        {
          "When": "2161",
          "Event": "United Federation of Planets founded on Earth (San Francisco)."
        },
        {
          "When": "2153",
          "Event": "Xindi probe attack strikes Earth, catalyzing an extended security and exploration response (Enterprise era)."
        },
        {
          "When": "2286",
          "Event": "Whale Probe crisis: a massive probe disrupts power and threatens Earth’s environment while seeking humpback whales."
        },
        {
          "When": "2373",
          "Event": "Battle of Sector 001: a Borg cube attempts to assimilate Earth; Starfleet destroys the cube with heavy losses."
        },
        {
          "When": "Late 2375",
          "Event": "Breen raid attacks Starfleet Headquarters and San Francisco, including damage to the Golden Gate region."
        }
      ]
    },
    "Government": {
      "Polity": "United Earth (unified planetary authority by the 22nd century); Earth is a founding member world of the United Federation of Planets",
      "Capital": "Not consistently stated on-screen (Earth is shown through multiple civic centers; Federation executive offices are associated with Paris and Starfleet’s principal campus with the San Francisco Bay / Presidio area)",
      "Institutions": [
        "United Earth (planetary authority; structure not consistently detailed on-screen)",
        "Office of the President of the United Federation of Planets (Paris, Earth)",
        "Federation Council (referenced as a central governing body)",
        "Starfleet Headquarters / Starfleet Command (San Francisco Bay / Presidio area)",
        "Starfleet Academy (headquarters in the Presidio; training facilities across the Golden Gate in Marin County)"
      ],
      "LawsAffectingVisitors": [
        "Standard transport, traffic-control, and customs procedures through orbital/planetary facilities (era-dependent)",
        "Restricted-access zones around Federation and Starfleet installations",
        "During security crises, emergency measures and heightened screening may be imposed; on-screen sources rarely enumerate specific legal texts"
      ],
      "Notes": "On-screen governance depictions on Earth focus mainly on Federation- and Starfleet-level institutions operating on-world; Earth’s planetary governmental mechanics are referenced far less directly than its role as a Federation hub."
    },
    "Economy": {
      "Overview": "In the Federation era, Earth is portrayed primarily as a civic, research, and administrative hub within a high-technology, low-scarcity society. On-screen stories rarely provide a single comprehensive description of Earth’s economic mechanisms.",
      "PrimaryIndustries": [
        "Education and research",
        "Public administration (Federation and Starfleet institutions)",
        "Cultural production and heritage preservation",
        "Orbital operations and logistics (in Starfleet contexts)"
      ],
      "TradeNotes": "Interstellar trade flows are implied through Earth’s status as a core world and major travel hub, but specific export/import profiles are not consistently stated on-screen.",
      "LocalCommerceNotes": "Local businesses and services appear across eras (especially in time-travel narratives), but details vary and are not systematically enumerated."
    },
    "Culture": {
      "Overview": "Earth culture is portrayed as pluralistic and strongly shaped by Federation-era ideals emphasizing education, exploration, and public service alongside local traditions.",
      "SocialCustoms": "Norms vary widely by region; metropolitan centers associated with Starfleet and Federation governance are often depicted as cosmopolitan and cross-cultural.",
      "ReligiousLife": "A wide variety of belief systems exist historically; on-screen sources do not present a single dominant faith and typically treat belief as personal and diverse.",
      "Festivals": "First Contact Day (April 5) commemorates the Phoenix warp flight and first open Human–Vulcan contact.",
      "ArtsAndMedia": "Earth remains a major cultural center with extensive artistic and educational traditions; specific institutions vary by story focus.",
      "LanguageNotes": "Many Earth languages are spoken; Standard is widely used in Federation contexts and multilingualism is common."
    },
    "Environment": {
      "Overview": "Habitable Class M biosphere with diverse ecosystems. Earth’s orbit is frequently depicted as a high-traffic region and a strategic theater during crises; Luna is a prominent nearby body in both navigation and imagery.",
      "Seasons": "Varies by latitude and region, ranging from four-season temperate cycles to tropical wet/dry patterns and polar extremes.",
      "NaturalHazards": [
        "Severe storms (region-dependent)",
        "Seismic/volcanic activity (localized)",
        "Wildfires (region-dependent)"
      ],
      "NightSky": "Luna is a dominant natural feature; in later eras, orbital traffic and installations are common near major population centers."
    },
    "Appearances": {
      "Overview": "Earth is a recurring setting across Star Trek, serving as Humanity’s homeworld and a central hub for Federation and Starfleet governance, as well as a frequent destination for time-travel stories and major crises.",
      "BySeriesOrFilm": [
        {
          "Era": "ENT",
          "Highlights": [
            "United Earth and early Starfleet operations; Earthside political/security stories in the pre-Federation period; the Xindi probe attack crisis and its aftermath."
          ]
        },
        {
          "Era": "TOS-era films",
          "Highlights": [
            "Federation/Starfleet institutions in San Francisco; the Whale Probe crisis impacting Earth in 2286."
          ]
        },
        {
          "Era": "TNG/DS9/VOY",
          "Highlights": [
            "Federation political center; internal-security crises; 2024 San Francisco time-travel depiction and Sanctuary District/Bell Riots arc; major strategic threats in the Sol sector."
          ]
        },
        {
          "Era": "PIC",
          "Highlights": [
            "Starfleet Headquarters/Federation policy context and Earthside personal/historical locations (era-dependent)."
          ]
        }
      ]
    },
    "CanonAppearances": {
      "Episodes": [
        "DS9: \"Past Tense, Part I\" / \"Past Tense, Part II\" (2024 San Francisco; Sanctuary Districts; Bell Riots)",
        "DS9: \"Homefront\" / \"Paradise Lost\" (Earth security crisis; Federation President’s office in Paris referenced)",
        "ENT: \"The Expanse\" (Xindi probe attack aftermath and response)",
        "DS9: \"The Changing Face of Evil\" (Breen attack on Starfleet Headquarters in San Francisco)"
      ],
      "Films": [
        "Star Trek: First Contact (Bozeman/First Contact; Borg attack and Battle of Sector 001 framing)",
        "Star Trek IV: The Voyage Home (Whale Probe crisis; Earth threatened in 2286)",
        "Star Trek VI: The Undiscovered Country (Federation President’s office associated with Paris)"
      ],
      "Notes": "Earth is referenced and/or visited across many additional episodes and films; this list highlights anchor appearances that establish key historical and governmental details used above."
    }
  },
  {
    "PlanetID": "planet-andoria",
    "Name": "Andoria",
    "AlternateNames": [
      "Andor"
    ],
    "Tags": [
      "Homeworld",
      "Andorians",
      "Icy world (shown on-screen)"
    ],
    "TypeTags": [
      "Homeworld"
    ],
    "Meta": {
      "CanonicalName": "Andoria",
      "Classification": "Inhabited moon; homeworld of the Andorians and Aenar; capital world of the Andorian Empire; later a founding Federation member world.",
      "Affiliation": "Andorian Empire; United Federation of Planets",
      "NativeSpecies": [
        "Andorian (including the Aenar subgroup; shown on-screen)"
      ]
    },
    "Media": {
      "HeroImageURL": "https://raw.githubusercontent.com/BigBird7827/Pla-Trek/main/Images/Andoria.png"
    },
    "TravelSummary": "Andoria is the homeworld of the Andorians. On-screen depictions (notably in Star Trek: Enterprise) present it as an intensely cold, ice-dominated environment, including subterranean settings associated with the Aenar. Visitor requirements, entry procedures, and tourism infrastructure are unknown.",
    "Location": {
      "Quadrant": "Beta Quadrant",
      "Sector": "Andorian sector",
      "StarSystem": "Andorian system",
      "Region": "Andorian space",
      "NearbyLandmarks": "Unknown"
    },
    "Appearance": "On-screen visuals depict Andoria as a frozen world with snow and ice dominating the landscape. Scenes associated with Andorian stories also include underground/subsurface environments. No consistent on-screen depiction of major surface cities or planetary-scale vistas with named landmarks is provided.",
    "Geography": "unknown beyond general icy terrain and subterranean environments shown in Star Trek: Enterprise.",
    "CitiesAndSites": [
      {
        "Name": "Aenar subterranean habitats (shown on-screen)",
        "Type": "Settlement / subterranean",
        "Description": "Star Trek: Enterprise depicts an underground Aenar community on Andoria. Specific city/settlement names and broader urban geography are unknown."
      },
      {
        "Name": "unknown (surface cities and capital)",
        "Type": "Unknown",
        "Description": "No named Andorian capital city or surface metropolitan area is established on-screen in the referenced episodes."
      }
    ],
    "Inhabitants": "Andorians are the native inhabitants associated with Andoria on-screen. Star Trek: Enterprise depicts the Aenar as a distinct Andorian subgroup living in subterranean communities. Population totals, demographics, and other resident species are unknown.",
    "Tourism": "unknown. Andoria is primarily presented in-story through diplomacy, security incidents, and cultural/military encounters rather than through leisure travel.",
    "Logistics": "unknown. Specifics such as entry permissions, customs/immigration procedures, safe-travel advisories, or recommended routes are not established on-screen.",
    "Weather": {
      "ClimateType": "Cold / icy conditions (shown on-screen)",
      "Seasonality": "Unknown",
      "TypicalConditions": "Snow and ice conditions are depicted on-screen; typical temperatures and weather patterns are unknown.",
      "Hazards": "unknown (beyond the inherent risks of severe cold implied by setting)."
    },
    "History": {
      "Overview": "On-screen (Enterprise era), Andoria is repeatedly referenced in the context of heightened tensions with Vulcan authorities, including allegations of surveillance and espionage directed at Andoria. Andoria is also the setting for events involving the Aenar during an attempted attack that is stopped with outside assistance. Broader prehistory and later political timelines are unknown.",
      "KeyEras": [
        {
          "Era": "22nd century (Enterprise era)",
          "Summary": "Andoria is referenced as a focal point in Andorian–Vulcan tension and espionage allegations, and it is depicted as the setting for Aenar-related events."
        },
        {
          "Era": "Federation era (later centuries)",
          "Summary": "Andorians are shown serving and representing Federation institutions across eras, but Andoria’s planet-specific political history in these periods is unknown."
        }
      ],
      "MajorEvents": [
        {
          "When": "22nd century (Enterprise era)",
          "Event": "A Vulcan facility at the P'Jem monastery is revealed to be used for surveillance of Andoria (alleged and then supported by discovered evidence on-screen)."
        },
        {
          "When": "22nd century (Enterprise era)",
          "Event": "Events involving the Aenar on Andoria are pivotal in stopping an attempted attack carried out via an unwilling pilot and remote control (telepresence) arrangements."
        }
      ]
    },
    "Government": {
      "Polity": "unknown. Andorian military/security is represented on-screen by the Andorian Imperial Guard.",
      "Capital": "Unknown",
      "Institutions": [
        "Andorian Imperial Guard (shown on-screen)",
        "unknown (civil government institutions are not detailed)"
      ],
      "LawsAffectingVisitors": [
        "Unknown"
      ],
      "Notes": "Andoria’s internal governance and legal system are not described in detail on-screen; references focus on security and diplomacy in specific incidents."
    },
    "Economy": {
      "Overview": "Unknown",
      "PrimaryIndustries": [
        "Unknown"
      ],
      "TradeNotes": "Unknown",
      "LocalCommerceNotes": "Unknown"
    },
    "Culture": {
      "Overview": "unknown in a comprehensive way.",
      "SocialCustoms": [
        "Andorian ale is referenced/consumed on-screen as a notable Andorian beverage.",
        "Other social customs are unknown."
      ],
      "ReligiousLife": "Unknown",
      "Festivals": "Unknown",
      "ArtsAndMedia": "Unknown",
      "LanguageNotes": "Unknown"
    },
    "Environment": {
      "Overview": "Cold, ice-dominated environments are shown on-screen; other environmental specifics are unknown.",
      "Seasons": "Unknown",
      "NaturalHazards": "unknown (beyond implied severe cold)",
      "NightSky": "Unknown"
    },
    "Appearances": {
      "Overview": "Andoria is primarily referenced and depicted in Star Trek: Enterprise in stories centered on the Andorians and the Aenar.",
      "BySeriesOrFilm": [
        {
          "Era": "ENT",
          "Highlights": [
            "Andoria is referenced as the subject of surveillance/espionage concerns tied to P'Jem.",
            "Andoria is shown as the setting for Aenar-related events in which an attack is prevented."
          ]
        }
      ]
    },
    "CanonAppearances": {
      "Episodes": [
        "ENT: \"The Andorian Incident\" (Andoria referenced as the target of Vulcan surveillance concerns)",
        "ENT: \"The Aenar\" (Andoria depicted as the setting for Aenar-related events)"
      ],
      "Films": [],
      "Notes": "Andoria is referenced in additional episodes involving the Andorians, but only explicitly verified references are listed here."
    }
  },
  {
    "PlanetID": "planet-qonos",
    "Name": "Qo'noS",
    "AlternateNames": [
      "Kronos"
    ],
    "Tags": [
      "Homeworld",
      "Klingon government center",
      "Klingon High Council"
    ],
    "TypeTags": [
      "Homeworld",
      "EmpireCapital"
    ],
    "Meta": {
      "CanonicalName": "Qo'noS",
      "Classification": "Inhabited planet; Klingon homeworld",
      "Affiliation": "Klingon Empire",
      "NativeSpecies": [
        "Klingon"
      ]
    },
    "Media": {
      "HeroImageURL": "https://raw.githubusercontent.com/BigBird7827/Pla-Trek/main/Images/Qo'noS.png"
    },
    "TravelSummary": "Qo'noS is the homeworld of the Klingon people and the primary seat of Klingon political power shown on-screen, associated with the First City and the Great Hall where the Klingon High Council convenes.\n\nVisitors in Federation-era stories typically approach Qo'noS for high-stakes diplomacy, legal proceedings, or House politics rather than leisure travel. Access to major political sites is portrayed as tightly controlled and strongly shaped by the current Chancellor, the High Council, and the major Houses.\n\nQo'noS is also tied to one of the Klingon Empire’s defining modern crises: the destruction of Praxis (an energy facility associated with Qo'noS) in 2293 and the resulting environmental emergency referenced in Star Trek VI: The Undiscovered Country, which drives the film’s peace negotiations.",
    "Location": {
      "Quadrant": "Beta Quadrant",
      "Sector": "Qo'noS sector",
      "StarSystem": "Qo'noS system",
      "Region": "Klingon Empire",
      "NearbyLandmarks": [
        "Praxis"
      ]
    },
    "Appearance": "Depicted on-screen as a rugged, imposing world: rocky terrain, harsh architecture, and dramatic skies are commonly used to emphasize Klingon culture and the gravity of political scenes set there.",
    "Geography": "Unknown (specific global geography is not described consistently on-screen beyond localized exterior/establishing shots).",
    "CitiesAndSites": [
      {
        "Name": "First City",
        "Type": "Capital / Government district",
        "Description": "Central governmental city associated with Klingon leadership and the High Council; depicted as the setting for major political gatherings and ceremonial spaces."
      },
      {
        "Name": "Great Hall",
        "Type": "Government / Ceremonial hall",
        "Description": "The principal meeting place shown for the Klingon High Council, used for succession, trials, and major state decisions."
      },
      {
        "Name": "Klingon High Council Chamber",
        "Type": "Government",
        "Description": "Interior political setting associated with Council proceedings; scenes here typically center on House accusations, succession disputes, and questions of honor."
      }
    ],
    "Inhabitants": "Primarily Klingons. Long-term non-Klingon demographic details are Unknown.",
    "Tourism": "Unknown (Qo'noS is portrayed more as a political and cultural destination than a conventional tourist world; specific visitor attractions are not described on-screen).",
    "Logistics": "Travel is depicted as politically sensitive and security-intensive, especially around High Council sites and during periods of internal conflict. Specific entry requirements and civil regulations are Unknown.",
    "Weather": {
      "ClimateType": "Unknown",
      "Seasonality": "Unknown",
      "TypicalConditions": "Unknown (on-screen depictions vary and are typically scene-driven rather than climatological).",
      "Hazards": [
        "Unknown"
      ]
    },
    "History": {
      "Overview": "Qo'noS is repeatedly framed as the Klingon Empire’s political and cultural heart. Major on-screen events connected to the planet include High Council proceedings and power struggles in the 24th century, and the environmental crisis following the Praxis disaster referenced in 2293, which becomes a catalyst for Klingon–Federation peace negotiations.",
      "KeyEras": [
        {
          "Era": "Late 23rd century (2293)",
          "Summary": "Praxis is destroyed and the resulting ecological emergency is presented as a driver for Klingon leadership to pursue peace with the Federation (Star Trek VI context)."
        },
        {
          "Era": "24th century (2360s–2370s)",
          "Summary": "The High Council and succession politics are depicted through multiple visits connected to Worf’s family and Klingon internal power struggles."
        },
        {
          "Era": "22nd century (Enterprise era)",
          "Summary": "Qo'noS is referenced as the Klingon homeworld and appears in the context of early Human–Klingon contact; detailed planetary history beyond those story contexts is Unknown."
        }
      ],
      "MajorEvents": [
        {
          "When": "2293",
          "Event": "Praxis disaster creates an environmental crisis referenced as threatening Qo'noS’ future habitability; this crisis drives the peace process in Star Trek VI: The Undiscovered Country."
        },
        {
          "When": "2366",
          "Event": "High Council proceedings on Qo'noS are central to Worf’s family dishonor and the politics of Klingon Houses (TNG era)."
        }
      ]
    },
    "Government": {
      "Polity": "Klingon Empire",
      "Capital": "First City (associated with the High Council and major state institutions)",
      "Institutions": [
        "Klingon High Council",
        "Chancellor of the Klingon Empire",
        "Great Hall (High Council meeting place)"
      ],
      "LawsAffectingVisitors": [
        "Unknown"
      ],
      "Notes": "On-screen depictions focus on Council proceedings, succession, and House politics; detailed civil administration and legal codes are Unknown."
    },
    "Economy": {
      "Overview": "Unknown (on-screen sources do not provide a consistent description of Qo'noS’ economic system).",
      "PrimaryIndustries": [
        "Unknown"
      ],
      "TradeNotes": "Unknown",
      "LocalCommerceNotes": "Unknown"
    },
    "Culture": {
      "Overview": "Klingon culture is portrayed as tradition-bound and centered on honor, House allegiance, and martial values, with politics often expressed through formal challenges, ceremony, and public declarations.",
      "SocialCustoms": "Rites of honor, formal accusations, and House-based obligations are repeatedly depicted. Specific visitor etiquette varies by context but is generally portrayed as strict and status-conscious.",
      "ReligiousLife": "Unknown (religious practice on Qo'noS is not consistently shown in a single, comprehensive way).",
      "Festivals": "Unknown",
      "ArtsAndMedia": "Unknown (cultural arts are referenced broadly across Klingon stories, but specific Qo'noS institutions are not detailed on-screen).",
      "LanguageNotes": "Klingon language is frequently used in ceremonial, political, and military contexts; Federation Standard is used in multilingual diplomatic settings."
    },
    "Environment": {
      "Overview": "Qo'noS is depicted as inhabited with heavy cultural and political infrastructure. In 2293, the Praxis disaster is explicitly linked to environmental damage affecting Qo'noS’ atmosphere in Star Trek VI’s narrative framing.",
      "Seasons": "Unknown",
      "NaturalHazards": [
        "Unknown"
      ],
      "NightSky": "Unknown"
    },
    "Appearances": {
      "Overview": "Qo'noS appears on-screen primarily as the Klingon Empire’s governmental and ceremonial center, used for High Council scenes, succession crises, and major diplomatic turning points.",
      "BySeriesOrFilm": [
        {
          "Era": "TNG",
          "Highlights": [
            "High Council and Great Hall scenes tied to Worf’s family honor and Klingon succession politics."
          ]
        },
        {
          "Era": "DS9",
          "Highlights": [
            "Qo'noS is depicted in \"The House of Quark\" as the setting for Klingon House and High Council business."
          ]
        },
        {
          "Era": "ENT",
          "Highlights": [
            "Qo'noS is referenced as the Klingon homeworld early in Human deep-space operations and appears in the context of Klingon legal/political proceedings."
          ]
        },
        {
          "Era": "Star Trek VI",
          "Highlights": [
            "Praxis disaster drives Klingon–Federation peace negotiations; Qo'noS is central to the stakes of the crisis."
          ]
        },
        {
          "Era": "DIS",
          "Highlights": [
            "Qo'noS is shown in the context of the Federation–Klingon war, including operations in/under the planet and political outcomes tied to Klingon leadership."
          ]
        },
        {
          "Era": "Kelvin films",
          "Highlights": [
            "Referred to as Kronos and depicted as the Klingon homeworld in Star Trek Into Darkness (alternate reality)."
          ]
        }
      ]
    },
    "CanonAppearances": {
      "Episodes": [
        "TNG: \"Sins of the Father\" (Klingon High Council/Great Hall on Qo'noS)",
        "TNG: \"Redemption\" / \"Redemption II\" (Arbiter of Succession; events involve travel to/from Qo'noS)",
        "DS9: \"The House of Quark\" (Qo'noS depicted)",
        "ENT: \"Broken Bow\" (mission destination: Qo'noS; Klingon homeworld context)",
        "ENT: \"Judgment\" (Klingon legal proceedings; Qo'noS context)"
      ],
      "Films": [
        "Star Trek VI: The Undiscovered Country (Praxis disaster; peace negotiations tied to Qo'noS’ environmental stakes)",
        "Star Trek Into Darkness (Kronos/Qo'noS depicted in alternate reality)"
      ],
      "Notes": "Qo'noS is referenced across many Klingon-focused stories; this list highlights anchor appearances establishing its role as the Klingon political center and the Praxis-linked crisis."
    }
  },
  {
    "PlanetID": "planet-vulcan",
    "Name": "Vulcan",
    "AlternateNames": [
      "Ni'Var"
    ],
    "Tags": [
      "Homeworld",
      "Vulcan civilization center",
      "Federation founding world"
    ],
    "TypeTags": [
      "Homeworld"
    ],
    "Meta": {
      "CanonicalName": "Vulcan",
      "Classification": "Inhabited M-class planet (also known as Ni'Var in the 32nd century); homeworld of the Vulcans and the ancestors of the Romulans.",
      "Affiliation": "Vulcan is a member of the United Federation of Planets in the Federation era; in the mid‑22nd century it is depicted with the Vulcan High Command as a dominant governing/military authority",
      "NativeSpecies": [
        "Vulcan"
      ]
    },
    "Media": {
      "HeroImageURL": "https://raw.githubusercontent.com/BigBird7827/Pla-Trek/main/Images/Vulcan.png"
    },
    "TravelSummary": "Vulcan is the homeworld of the Vulcan people and a major center of Vulcan culture, science, and diplomacy. On-screen visits commonly emphasize its traditions of logic and discipline alongside long‑standing ceremonial practices (including rites connected to pon farr, kal‑if‑fee, and katra).\n\nVisually, Vulcan is most often presented through stark, sunlit landscapes—especially arid deserts and rocky highlands. Some stories focus on dangerous wilderness regions (such as the Forge), while others center on civic and institutional settings linked to Vulcan government and academia.\n\nVulcan’s wider significance in Star Trek is tied to its long relationship with Earth and Starfleet, its role within the Federation era, and its deep historical connection to the Romulans. A separate film continuity (the Kelvin timeline) depicts Vulcan’s destruction as a defining event for that timeline.",
    "Location": {
      "Quadrant": "Beta Quadrant",
      "Sector": "Vulcan sector (aka Sector 005)",
      "StarSystem": "Vulcan system (40 Eridani A)",
      "Region": "Vulcan space",
      "NearbyLandmarks": [
        "Unknown"
      ]
    },
    "Appearance": "Often depicted as a reddish‑toned, arid world with broad desert basins, harsh sunlight, and rugged mountain terrain. Some episodes highlight heat, dust, and wind as immediate environmental realities for surface travel.",
    "Geography": "Vulcan is most commonly shown through dry deserts, rocky canyons, and mountainous or highland terrain. Named regions and sites appear in story contexts (for example, the Forge and Mount Seleya), but a comprehensive global map and biome breakdown is Unknown.",
    "CitiesAndSites": [
      {
        "Name": "ShiKahr",
        "Type": "City",
        "Description": "A named Vulcan city referenced and depicted as an important civic location in Vulcan‑centered stories."
      },
      {
        "Name": "Vulcan High Command complex",
        "Type": "Government / military",
        "Description": "Associated with Vulcan state authority during the Enterprise era; used as a setting for Vulcan political and security decisions."
      },
      {
        "Name": "Vulcan Science Academy",
        "Type": "Academic / scientific",
        "Description": "A prominent Vulcan institution referenced on-screen as a leading center for Vulcan science and education."
      },
      {
        "Name": "Mount Seleya",
        "Type": "Sacred site",
        "Description": "A revered location tied to Vulcan spiritual practice and major rites, including ceremonies involving katra."
      },
      {
        "Name": "The Forge",
        "Type": "Wilderness / desert region",
        "Description": "A hazardous desert region depicted with extreme heat and sandstorms; used as a key setting in the Enterprise-era Vulcan arc."
      }
    ],
    "Inhabitants": "Vulcans are Vulcan’s native sentient species and the planet’s primary population in on-screen depictions. Other residents and visitors appear in diplomatic, academic, and ceremonial contexts, but a demographic breakdown is Unknown.",
    "Tourism": "Visitor activity shown on-screen is most often tied to official business (diplomacy, research, security matters) and to attendance at significant cultural or spiritual sites. Leisure tourism patterns and visitor infrastructure are Unknown.",
    "Logistics": "Entry and movement on Vulcan are depicted as controlled and context-dependent, especially around government facilities and sacred locations. Required permits, customs procedures, and routine visitor rules are Unknown.",
    "Weather": {
      "ClimateType": "Arid / desert (as most commonly depicted on-screen)",
      "Seasonality": "Unknown",
      "TypicalConditions": "Dry heat, bright sun, and wind‑driven dust in desert regions; conditions vary by location and story focus.",
      "Hazards": [
        "Heat exposure and dehydration risk during surface travel",
        "Sandstorms / reduced visibility in desert regions (e.g., the Forge)",
        "Navigation disorientation in blowing dust"
      ]
    },
    "History": {
      "Overview": "On-screen history ties Vulcan to the teachings of Surak and to a cultural emphasis on logic, discipline, and the management of emotion. Vulcan’s past also includes an ancient divergence that links Vulcans and Romulans through shared ancestry. In the mid‑22nd century, Vulcan politics are depicted through the Vulcan High Command and a major internal reckoning tied to Vulcan tradition and governance. In later eras, Vulcan is portrayed as a key Federation member world and a focal point for stories involving Vulcan identity, diplomacy, and Romulan reunification efforts.",
      "KeyEras": [
        {
          "Era": "Ancient Vulcan history",
          "Summary": "Surak’s philosophy becomes central to Vulcan identity; the Vulcan–Romulan divergence is treated as a formative historical split."
        },
        {
          "Era": "Enterprise era (22nd century)",
          "Summary": "Vulcan is shown with the High Command as a powerful authority; internal conflict and revelations about Vulcan tradition reshape politics and policy."
        },
        {
          "Era": "23rd century (TOS era and films)",
          "Summary": "Vulcan appears in stories centered on rites such as kal‑if‑fee and ceremonies involving katra, including the fal‑tor‑pan."
        },
        {
          "Era": "24th century (TNG era)",
          "Summary": "Vulcan’s political and cultural context intersects with Spock’s reunification efforts and broader Federation diplomacy."
        },
        {
          "Era": "Kelvin timeline",
          "Summary": "One film continuity depicts the destruction of Vulcan during Nero’s attack, treated as a defining catastrophe for that timeline."
        }
      ],
      "MajorEvents": [
        {
          "When": "Ancient era",
          "Event": "Surak’s teachings and Vulcan cultural reforms become a defining foundation for Vulcan society."
        },
        {
          "When": "Ancient era",
          "Event": "Vulcans and Romulans are established as having shared ancestry and an ancient divergence."
        },
        {
          "When": "22nd century (Enterprise era)",
          "Event": "A major Vulcan internal crisis involving the Forge and ancient artifacts/teachings drives political upheaval and reform."
        },
        {
          "When": "23rd century",
          "Event": "Fal‑tor‑pan ceremonies on Vulcan are central to restoring Spock’s katra (film depiction)."
        },
        {
          "When": "24th century",
          "Event": "Spock’s reunification movement intersects with Vulcan politics and Romulan relations (episode depiction)."
        },
        {
          "When": "Kelvin timeline (23rd century)",
          "Event": "Vulcan is destroyed by Nero’s red‑matter attack (film depiction)."
        }
      ]
    },
    "Government": {
      "Polity": "Vulcan planetary governance is depicted differently across eras. The Enterprise era foregrounds the Vulcan High Command as a dominant authority; later stories treat Vulcan within Federation political context. A single, stable constitutional description is Unknown.",
      "Capital": "Unknown",
      "Institutions": [
        "Vulcan High Command (Enterprise era)",
        "Vulcan Council / leadership bodies (titles and structure vary by story; comprehensive civic structure is Unknown)",
        "Vulcan Science Academy (major institution; role as a government body is Unknown)",
        "Federation diplomatic and intergovernmental engagement involving Vulcan (details vary by era)"
      ],
      "LawsAffectingVisitors": [
        "Unknown"
      ],
      "Notes": "On-screen depictions focus on security, diplomacy, and ideological conflict more than routine civil administration."
    },
    "Economy": {
      "Overview": "A comprehensive description of Vulcan’s economy is Unknown. Vulcan is consistently portrayed as technologically advanced with strong emphasis on science, education, and public institutions.",
      "PrimaryIndustries": [
        "Science and research",
        "Education and academic institutions",
        "Diplomatic and governmental services"
      ],
      "TradeNotes": "Unknown",
      "LocalCommerceNotes": "Unknown"
    },
    "Culture": {
      "Overview": "Vulcan culture is depicted as strongly shaped by Surak’s philosophy and by social disciplines emphasizing logic, restraint, and formal practice. At the same time, multiple stories demonstrate that tradition and ritual remain central to Vulcan identity.",
      "SocialCustoms": "Formal speech and conduct, highly regulated emotional expression, and structured ritual practices are repeatedly shown. The extent of variation across Vulcan society is Unknown.",
      "ReligiousLife": "Vulcan spiritual practices and monastic traditions are depicted (including sacred sites and rites involving katra). The organizational structure of religion on Vulcan is Unknown.",
      "Festivals": "Unknown",
      "ArtsAndMedia": "Cultural production exists but is not described comprehensively on-screen; notable attention is placed on philosophy, education, and ceremonial tradition.",
      "LanguageNotes": "The Vulcan language is referenced; Federation Standard is also used in interspecies contexts."
    },
    "Environment": {
      "Overview": "Vulcan environments shown on-screen frequently emphasize arid deserts, heat, and rugged terrain. Specific planetary ecology and atmospheric details are Unknown beyond what is shown in individual scenes.",
      "Seasons": "Unknown",
      "NaturalHazards": [
        "Extreme heat in desert regions",
        "Sandstorms / blowing dust (e.g., the Forge)"
      ],
      "NightSky": "Unknown"
    },
    "Appearances": {
      "Overview": "Vulcan appears across Star Trek as a major homeworld and cultural touchstone, often serving as the setting for stories about Vulcan ritual, political authority, identity, and diplomacy.",
      "BySeriesOrFilm": [
        {
          "Era": "TOS",
          "Highlights": [
            "Vulcan surface setting for pon farr–related rites and kal‑if‑fee.",
            "Depictions of Vulcan ceremony and formal cultural practice."
          ]
        },
        {
          "Era": "ENT",
          "Highlights": [
            "The Forge and a major Vulcan political/spiritual arc involving the High Command and ancient tradition.",
            "Vulcan domestic security and ideological conflict shaping policy toward Earth and Starfleet."
          ]
        },
        {
          "Era": "TOS-era films",
          "Highlights": [
            "Fal‑tor‑pan ceremony and katra‑related rites on Vulcan."
          ]
        },
        {
          "Era": "TNG",
          "Highlights": [
            "Vulcan political context and Spock’s reunification movement involving Romulan relations."
          ]
        },
        {
          "Era": "Kelvin films",
          "Highlights": [
            "Vulcan’s depiction and destruction as a pivotal event in the Kelvin timeline."
          ]
        }
      ]
    },
    "CanonAppearances": {
      "Episodes": [
        "TOS: \"Amok Time\" (Vulcan; pon farr; kal‑if‑fee)",
        "ENT: \"The Forge\" / \"Awakening\" / \"Kir'Shara\" (Vulcan; the Forge; High Command; Syrrannite arc)",
        "TNG: \"Unification\" (Vulcan political context; reunification movement)"
      ],
      "Films": [
        "Star Trek III: The Search for Spock (Vulcan; fal‑tor‑pan; Mount Seleya)",
        "Star Trek (2009) (Kelvin timeline; Vulcan’s destruction)"
      ],
      "Notes": "This list highlights anchor stories where Vulcan is visited or its defining institutions and rites are central on-screen; Vulcan is referenced in many additional episodes and films."
    }
  },
  {
    "PlanetID": "planet-ferenginar",
    "Name": "Ferenginar",
    "AlternateNames": [],
    "Tags": [
      "Homeworld",
      "Ferengi Alliance capital world"
    ],
    "TypeTags": [
      "Homeworld"
    ],
    "Meta": {
      "CanonicalName": "Ferenginar",
      "Classification": "Inhabited planet; homeworld of the Ferengi; characterized by frequent rainfall in on-screen depictions.",
      "Affiliation": "Ferengi Alliance",
      "NativeSpecies": [
        "Ferengi"
      ]
    },
    "Media": {
      "HeroImageURL": "https://raw.githubusercontent.com/BigBird7827/Pla-Trek/main/Images/Ferenginar.png"
    },
    "TravelSummary": "Ferenginar is the homeworld of the Ferengi and the seat of the Ferengi Alliance. On-screen references emphasize a perpetually wet world associated with frequent rain. Visitor access, required documents, and standard travel restrictions are Unknown.",
    "Location": {
      "Quadrant": "Alpha Quadrant",
      "Sector": "Unknown",
      "StarSystem": "Ferenginar system",
      "Region": "Ferengi space",
      "NearbyLandmarks": []
    },
    "Appearance": "Depicted and described as a dark, rain-soaked world with persistent precipitation. Specific orbital/astronomical details and surface distribution of biomes are Unknown.",
    "Geography": "On-screen dialogue and set dressing associate Ferenginar with waterlogged terrain and muddy conditions. Named continents, oceans, mountain ranges, and global surface maps are Unknown.",
    "CitiesAndSites": [
      {
        "Name": "Tower of Commerce",
        "Type": "Government / Commercial complex",
        "Description": "A major Ferengi administrative and commercial site referenced/seen in DS9-era stories involving the Grand Nagus and Ferengi government affairs."
      },
      {
        "Name": "Sacred Marketplace",
        "Type": "Marketplace",
        "Description": "Referenced as a prominent marketplace on Ferenginar; specific location and size are Unknown."
      },
      {
        "Name": "Ishka’s house",
        "Type": "Residence",
        "Description": "Residence of Ishka (Quark and Rom’s mother) shown in DS9-era visits to Ferenginar."
      },
      {
        "Name": "Chamber of Petitioners",
        "Type": "Government chamber",
        "Description": "A formal audience/administrative space associated with the Grand Nagus’ operations; exact placement beyond Ferenginar is Unknown."
      }
    ],
    "Inhabitants": "Native population is Ferengi. Presence of significant non-Ferengi resident communities is Unknown. Off-world visitors appear primarily in business or official contexts on-screen.",
    "Tourism": "Tourism as a dedicated industry is Unknown. On-screen portrayals emphasize business travel, official visits, and commerce-driven activity.",
    "Logistics": "Entry/visa requirements, customs procedures, and common visitor restrictions are Unknown. Commercial regulation by Ferengi authorities (including the Ferengi Commerce Authority and the Office of the Grand Nagus) is referenced on-screen.",
    "Weather": {
      "ClimateType": "Rainy / waterlogged (frequent rainfall emphasized on-screen)",
      "Seasonality": "Unknown",
      "TypicalConditions": "Frequent rain and overcast skies are emphasized; typical temperatures and humidity ranges are Unknown.",
      "Hazards": [
        "Unknown"
      ]
    },
    "History": {
      "Overview": "On-screen Ferenginar stories focus on Ferengi domestic affairs, commerce, and political change under the Grand Nagus. Specific ancient/early history, founding dates, and pre-warp timelines are Unknown.",
      "KeyEras": [
        {
          "Era": "24th century (DS9 era)",
          "Summary": "Multiple DS9-era stories place Ferengi political and social change in motion, including reforms associated with the Grand Nagus and disputes involving Ferengi institutions."
        },
        {
          "Era": "Later-era references",
          "Summary": "Later on-screen references to Ferenginar continue to treat it as the Ferengi homeworld and Alliance political center; detailed continuity beyond those references is Unknown."
        }
      ],
      "MajorEvents": [
        {
          "When": "DS9 era",
          "Event": "Ferengi domestic disputes and reforms tied to the Grand Nagus and Ferengi law become recurring on-screen plot points."
        },
        {
          "When": "DS9 era",
          "Event": "Ferengi social rules regarding clothing and profit for females are challenged and altered in Ferengi-focused storylines."
        },
        {
          "When": "DS9 era",
          "Event": "Leadership changes in the office of the Grand Nagus impact Ferengi policy and the Alliance’s direction."
        }
      ]
    },
    "Government": {
      "Polity": "Ferengi Alliance",
      "Capital": "Unknown",
      "Institutions": [
        "Office of the Grand Nagus",
        "Ferengi Commerce Authority",
        "Tower of Commerce"
      ],
      "LawsAffectingVisitors": [
        "Unknown"
      ],
      "Notes": "On-screen governance is centered on the Grand Nagus and Ferengi legal/commercial institutions. Constitutional structure, legislative bodies, and judicial hierarchy are Unknown."
    },
    "Economy": {
      "Overview": "Commerce and profit are central to Ferengi society on-screen, and Ferenginar is treated as the Alliance’s economic and administrative heart. Specific planet-side industries and resource exports are Unknown.",
      "PrimaryIndustries": [
        "Commerce and trade"
      ],
      "TradeNotes": "Major trade partners and tariff regimes are Unknown.",
      "LocalCommerceNotes": "Local currency mechanics and market structure beyond general Ferengi ‘latinum’ usage are Unknown."
    },
    "Culture": {
      "Overview": "On-screen Ferengi culture is strongly profit-oriented and often framed through the Rules of Acquisition, contract law, and status tied to wealth. Cultural variation by region on Ferenginar is Unknown.",
      "SocialCustoms": "Social norms depicted on-screen include aggressive bargaining, strict contract etiquette, and gender restrictions in traditional Ferengi society (with reforms occurring over time).",
      "ReligiousLife": "Unknown",
      "Festivals": "Unknown",
      "ArtsAndMedia": "Unknown",
      "LanguageNotes": "Unknown"
    },
    "Environment": {
      "Overview": "Frequent rainfall is emphasized on-screen; broader ecological details are Unknown.",
      "Seasons": "Unknown",
      "NaturalHazards": [
        "Unknown"
      ],
      "NightSky": "Unknown"
    },
    "Appearances": {
      "Overview": "Ferenginar is used on-screen primarily for Ferengi-focused political, legal, and family stories, establishing it as the Ferengi homeworld and Alliance center.",
      "BySeriesOrFilm": [
        {
          "Era": "DS9",
          "Highlights": [
            "Visits to Ferenginar for Ferengi family and political plots; depictions of Ferengi institutions and reforms."
          ]
        }
      ]
    },
    "CanonAppearances": {
      "Episodes": [
        "DS9: Family Business",
        "DS9: Ferengi Love Songs",
        "DS9: Profit and Lace",
        "DS9: The Dogs of War"
      ],
      "Films": [],
      "Notes": "List reflects prominent on-screen Ferenginar-focused episodes; additional references may exist. Overall completeness is Unknown."
    }
  },
  {
    "PlanetID": "planet-cardassia-prime",
    "Name": "Cardassia Prime",
    "AlternateNames": [
      "Cardassia"
    ],
    "Tags": [
      "Cardassian Union",
      "Homeworld"
    ],
    "TypeTags": [
      "Terrestrial (inhabited)"
    ],
    "Meta": {
      "CanonicalName": "Cardassia Prime",
      "Classification": "Unknown",
      "Affiliation": "Cardassian Union (Cardassian state)",
      "NativeSpecies": "Cardassians"
    },
    "Media": {
      "HeroImageURL": "https://raw.githubusercontent.com/BigBird7827/Pla-Trek/main/Images/Cardassia%20Prime.jpg"
    },
    "TravelSummary": "Cardassia Prime—often shortened to simply “Cardassia”—is the Cardassian homeworld and the political center of the Cardassian Union. On-screen, it is most closely associated with state institutions such as the Detapa Council and Central Command, and with the Dominion War’s final campaign.\n\nVisitor-facing details like entry procedures, tourism norms, and local transit systems are largely Unknown on-screen. What is shown and discussed emphasizes security, government control, and the planet’s strategic importance during periods of conflict.",
    "Location": {
      "Quadrant": "Alpha Quadrant",
      "Sector": "Unknown",
      "StarSystem": "Cardassian system",
      "Region": "Cardassian space",
      "NearbyLandmarks": [
        "Unknown"
      ]
    },
    "Appearance": "Depictions on Cardassia Prime emphasize monumental Cardassian architecture—angular, imposing civic structures and dense urban skylines. When cities are shown, waterways and canal-like features are visible in some establishing shots, and the overall palette leans toward muted stone and warm, dusty tones.",
    "Geography": "Planet-wide geography (continents, oceans, and major landforms) is Unknown on-screen. The clearest specific locale referenced by name is Lakarian City; other scenes focus on government and wartime targets rather than mapping the world’s surface.",
    "CitiesAndSites": [
      {
        "Name": "Lakarian City",
        "Type": "City",
        "Description": "A major city on Cardassia Prime referenced as having leisure facilities such as an amusement center. During the Dominion War’s final arc, it is destroyed as a reprisal, becoming a defining trauma for the Cardassian population."
      },
      {
        "Name": "Detapa Council",
        "Type": "Civilian government",
        "Description": "The Cardassian civilian government body referenced in DS9. It is presented as a central political authority of the Cardassian Union."
      },
      {
        "Name": "Central Command",
        "Type": "Military / state leadership",
        "Description": "Cardassian military leadership referenced throughout DS9-era stories. It is tied to policy, security, and wartime decision-making affecting Cardassian territory and occupied or contested regions."
      },
      {
        "Name": "Dominion command presence on Cardassia Prime",
        "Type": "Wartime administration",
        "Description": "During the late Dominion War, Cardassia becomes a major Dominion partner territory. The Dominion maintains a command presence and directs harsh reprisals from Cardassia Prime in response to sabotage and resistance."
      }
    ],
    "Inhabitants": "Cardassians are the dominant native population. In the Dominion War period, Dominion forces (including Jem'Hadar) operate on Cardassia Prime, and Cardassian resistance activity is shown on-world.",
    "Tourism": "Unknown. On-screen stories depict Cardassia Prime primarily in political and wartime contexts rather than as a civilian tourist destination.",
    "Logistics": "Unknown. On-screen sources emphasize heightened security and state control during crises, but do not provide consistent, practical visitor guidance (visas, permits, customs inspections, or civilian transit rules).",
    "Weather": {
      "ClimateType": "Unknown",
      "Seasonality": "Unknown",
      "TypicalConditions": "Unknown",
      "Hazards": [
        "Unknown"
      ]
    },
    "History": {
      "Overview": "Cardassia Prime is presented as the core world of the Cardassian Union and a focal point for Cardassian state power. Across DS9, its off-screen influence is felt through the Occupation of Bajor, conflicts with the Federation and Klingons, and shifting internal politics. In the Dominion War, Cardassia becomes central to the war’s endgame, with the planet suffering devastating reprisals and widespread destruction.",
      "KeyEras": [
        {
          "Era": "Cardassian Union state era",
          "Summary": "Cardassia Prime is the seat of Cardassian governance and military authority as portrayed across DS9-era politics and security stories."
        },
        {
          "Era": "Occupation and post-Occupation era",
          "Summary": "Cardassian rule over Bajor shapes regional politics and Cardassia’s reputation; the aftermath drives ongoing tension with Bajorans and Federation-aligned powers."
        },
        {
          "Era": "Dominion War alliance period",
          "Summary": "Cardassia aligns with the Dominion, becomes a major theater of operations, and experiences internal resistance and severe reprisals."
        },
        {
          "Era": "Late-war devastation and aftermath",
          "Summary": "Events in the final Dominion War arc depict large-scale destruction on Cardassia Prime; the post-war recovery path is Unknown on-screen."
        }
      ],
      "MajorEvents": [
        {
          "When": "Unknown",
          "Event": "Cardassian Occupation of Bajor shapes the region and becomes a central political legacy referenced throughout DS9."
        },
        {
          "When": "Unknown (Dominion War)",
          "Event": "Cardassia joins the Dominion; Cardassian leadership broadcasts promises of renewed power in the Alpha Quadrant."
        },
        {
          "When": "Unknown (Dominion War finale)",
          "Event": "Resistance sabotage triggers Dominion retaliation: Lakarian City is reduced to ashes with no survivors, and Cardassian outrage helps catalyze open rebellion."
        },
        {
          "When": "Unknown (Dominion War finale)",
          "Event": "Cardassian forces turn on Dominion troops and cities are attacked during the final battle over Cardassia Prime."
        }
      ]
    },
    "Government": {
      "Polity": "Cardassian Union (state governance portrayed as heavily influenced by military/security institutions in multiple eras)",
      "Capital": "Unknown (a specific capital city is not consistently stated on-screen; Lakarian City is identified as a major city)",
      "Institutions": [
        "Detapa Council (civilian government)",
        "Central Command (military/state leadership)",
        "Obsidian Order (intelligence service; role referenced on-screen)",
        "Dominion administration (wartime control during the Dominion War)"
      ],
      "LawsAffectingVisitors": [
        "Unknown (on-screen sources do not enumerate visitor laws or entry requirements)",
        "During security crises, restrictions and reprisals are depicted, but specific legal texts are Unknown"
      ],
      "Notes": "On-screen depictions focus on political control, military influence, and wartime governance rather than civic processes, elections, or detailed administrative structure."
    },
    "Economy": {
      "Overview": "Unknown (on-screen stories emphasize politics, security, and war; economic structure is not described in consistent, practical detail).",
      "PrimaryIndustries": [
        "Unknown"
      ],
      "TradeNotes": "Unknown",
      "LocalCommerceNotes": "Unknown"
    },
    "Culture": {
      "Overview": "Cardassian culture on-screen is often framed through themes of duty to the state, family bonds, and a strong sense of national identity. DS9 also highlights Cardassian arts and literature as a point of pride and debate in conversations between Cardassians and Federation citizens.",
      "SocialCustoms": [
        "Formality and state-centered expectations are common in Cardassian political and military contexts",
        "Personal/civilian day-to-day customs are Unknown on-screen in a broad, planet-wide sense"
      ],
      "ReligiousLife": "Unknown",
      "Festivals": "Unknown",
      "ArtsAndMedia": "Cardassian literature is referenced on-screen, including discussion of prominent Cardassian epic forms and well-known works.",
      "LanguageNotes": "The Cardassian language exists and is used in multiple scenes; detailed linguistic notes are Unknown."
    },
    "Environment": {
      "Overview": "Unknown (planet-wide environmental conditions are not described consistently on-screen).",
      "Seasons": "Unknown",
      "NaturalHazards": [
        "Unknown"
      ],
      "NightSky": "Unknown"
    },
    "Appearances": {
      "Overview": "Cardassia Prime is a major locus of DS9-era politics and the Dominion War’s conclusion, with named locales (notably Lakarian City) and on-world resistance activity depicted in the final arc.",
      "BySeriesOrFilm": [
        {
          "Era": "TNG",
          "Highlights": [
            "Cardassia and Cardassian territory are frequently referenced as major regional powers; Cardassia Prime is the implied seat of the Cardassian state."
          ]
        },
        {
          "Era": "DS9",
          "Highlights": [
            "Cardassian institutions (Detapa Council, Central Command, Obsidian Order) and Cardassian politics are recurring drivers of the series.",
            "Dominion War climax includes major events on Cardassia Prime, including the destruction of Lakarian City and the final battle."
          ]
        }
      ]
    },
    "CanonAppearances": {
      "Episodes": [
        "DS9: \"Defiant\" (Lakarian City referenced; Cardassian politics and family stakes highlighted)",
        "DS9: \"The Die Is Cast\" (Cardassian intelligence/state power and Alpha Quadrant strategy discussed)",
        "DS9: \"By Inferno's Light\" (Cardassian alignment and ambitions in the Alpha Quadrant broadcast)",
        "DS9: \"The Changing Face of Evil\" (Dominion promises to extend Cardassian influence throughout the Alpha Quadrant referenced)",
        "DS9: \"What You Leave Behind\" (on-world resistance; Lakarian City destruction; final battle over Cardassia Prime)"
      ],
      "Films": [],
      "Notes": "This list highlights prominent on-screen references and the DS9 finale arc. Cardassia Prime is also referenced broadly across other Cardassian-focused stories."
    }
  },
  {
    "PlanetID": "planet-bajor",
    "Name": "Bajor",
    "AlternateNames": [],
    "Tags": [
      "Homeworld",
      "Major setting",
      "Post-occupation reconstruction",
      "Bajoran religion"
    ],
    "TypeTags": [
      "Homeworld",
      "DS9Setting",
      "ReconstructionEra"
    ],
    "Meta": {
      "CanonicalName": "Bajor",
      "Classification": "Inhabited Class M planet; homeworld of the Bajoran people.",
      "Affiliation": "Independent Bajoran government (Provisional Government during early DS9-era); close ties with the United Federation of Planets through joint administration of Deep Space 9.",
      "NativeSpecies": [
        "Bajoran"
      ]
    },
    "Media": {
      "HeroImageURL": "https://raw.githubusercontent.com/BigBird7827/Pla-Trek/main/Images/Bajor.png"
    },
    "TravelSummary": "Bajor is a beautiful, heavily visited world in the Alpha Quadrant, known for its deep spiritual traditions, agricultural countryside, and long recovery after decades of Cardassian occupation. Visitors most often arrive via Deep Space 9 and travel onward for cultural sites, religious pilgrimages, and rural retreats. Some travel conditions vary with local politics and regional recovery.",
    "Location": {
      "Quadrant": "Alpha Quadrant",
      "Sector": "Bajor Sector",
      "StarSystem": "Bajoran system",
      "Region": "Bajoran space",
      "NearbyLandmarks": [
        "Deep Space 9 (formerly Terok Nor)",
        "Bajoran wormhole / “Celestial Temple”",
        "Denorios Belt"
      ]
    },
    "Appearance": "On screen, Bajor is portrayed as a lush, habitable world with open skies, green valleys, farmland, and coastal or river landscapes. Rural settlements, stone architecture, and monastery-like religious sites are frequently shown, reflecting both everyday agrarian life and long-standing spiritual traditions.",
    "Geography": "Bajor is politically divided into provinces, and its terrain is shown as varied—fertile agricultural regions, rolling hills, rivers, and valleys. Episodes reference multiple provinces (including Dahkur, Kendra, and Rakantha), with life often centered on farms, small towns, and regional communities. Specific global metrics (continental layout, exact land/water ratios) are Unknown.",
    "CitiesAndSites": [
      {
        "Name": "Dahkur Province",
        "Type": "Province / Agricultural region",
        "Description": "Referenced as Major Kira Nerys’s home province and repeatedly associated with farms, hills, and resistance-era history. Post-occupation, it is shown as a place where former resistance members return to farming and local life."
      },
      {
        "Name": "Kendra Province",
        "Type": "Province / Rural region",
        "Description": "Referenced as a populated region affected by major historical trauma during the Occupation and later by natural disasters during wormhole-related instability. Sisko is shown selecting land here as a future home site."
      },
      {
        "Name": "Rakantha Province",
        "Type": "Province / Agricultural region",
        "Description": "Referenced in connection with Bajoran agriculture and weather impacts; episodes mention crop damage from flooding affecting local harvests."
      },
      {
        "Name": "City of B’hala",
        "Type": "Archaeological / Sacred site",
        "Description": "A legendary “lost” Bajoran city connected to prophecy and faith; rediscovered in the DS9 era and treated as a major cultural and religious landmark."
      },
      {
        "Name": "Fire Caves",
        "Type": "Cave system / Religious-mythic site",
        "Description": "A sacred and feared cavern complex tied to Bajoran religious mythology, associated with the Pah-wraiths and events late in Deep Space Nine."
      },
      {
        "Name": "Qui’al Dam (near Janir)",
        "Type": "Infrastructure / Landmark",
        "Description": "A major dam and waterworks site referenced in connection with prophecy and a real engineering project to manage water for nearby communities."
      }
    ],
    "Inhabitants": "Bajor is primarily inhabited by Bajorans. In the DS9 era, the planet is also shaped by the presence of off-world visitors and advisers—particularly Federation/Starfleet personnel connected to Deep Space 9—and by the lingering effects of Cardassian administration and exploitation during the Occupation. Specific global population figures are Unknown.",
    "Tourism": "Tourism is strongly tied to pilgrimage and culture: visitors attend festivals, visit temples and monasteries, and seek out historic or prophetic sites. Rural travel—farm stays, small-town markets, and countryside excursions—is commonly portrayed. Tourism can be affected by security conditions and local political tensions.",
    "Logistics": "Most off-world arrivals and departures are depicted through Deep Space 9, with onward surface travel by shuttles and local transport. Jurisdictional authority for visitors is primarily Bajoran, and access to sensitive areas may depend on current security conditions. Specific visa rules, entry requirements, and standard travel paperwork are Unknown.",
    "Weather": {
      "ClimateType": "Temperate/earthlike in many depicted regions (overall planetary climate specifics are Unknown).",
      "Seasonality": "Seasonal agricultural cycles are referenced; regional floods and harvest impacts occur in some provinces.",
      "TypicalConditions": "Often depicted as mild and pleasant in rural and coastal settings; conditions vary by region and season.",
      "Hazards": [
        "Flooding (region-dependent)",
        "Earthquakes (reported during periods of unusual wormhole-related instability)",
        "Unknown"
      ]
    },
    "History": {
      "Overview": "Bajor is one of the most culturally and spiritually prominent worlds in the Star Trek canon, with a long-lived civilization and a religion centered on the Prophets and their Orbs. In the modern era, Bajor emerges from a prolonged Cardassian occupation, rebuilding its government and society while navigating internal political conflict, the strategic implications of the nearby stable wormhole, and the wider Dominion War.",
      "KeyEras": [
        {
          "Era": "Ancient Bajoran civilization and prophecy traditions",
          "Summary": "Bajor’s religious and artistic heritage is portrayed as extremely old, with Orbs and prophetic texts shaping major social and political decisions."
        },
        {
          "Era": "Cardassian Occupation and Resistance",
          "Summary": "The Occupation is depicted as a period of forced labor, exploitation, and mass suffering, opposed by resistance cells and underground movements."
        },
        {
          "Era": "Post-Occupation Provisional Government and recovery",
          "Summary": "After liberation, Bajor rebuilds amid political fragmentation, resource disputes, and debates over Federation membership and sovereignty."
        },
        {
          "Era": "Wormhole era and Dominion War pressures",
          "Summary": "The discovery and strategic importance of the Bajoran wormhole reshapes Bajor’s place in the quadrant and draws it into major regional conflicts."
        }
      ],
      "MajorEvents": [
        {
          "When": "During the Occupation (late 24th century)",
          "Event": "Cardassian control, forced labor, and harsh repression; Bajoran resistance activity becomes widespread."
        },
        {
          "When": "Shortly before and during early DS9 era",
          "Event": "Cardassians withdraw from Bajor and Terok Nor; Bajor assumes authority and requests Federation help to stabilize Deep Space 9."
        },
        {
          "When": "Early DS9 era",
          "Event": "A stable wormhole in Bajoran space is discovered; the wormhole becomes central to Bajor’s religion and the sector’s politics."
        },
        {
          "When": "DS9 era",
          "Event": "Internal political crises—including extremist movements and leadership struggles—challenge the Provisional Government."
        },
        {
          "When": "Late DS9 era",
          "Event": "Major spiritual conflict involving the Prophets and Pah-wraiths culminates at sacred sites on Bajor."
        }
      ]
    },
    "Government": {
      "Polity": "Independent Bajoran government (Provisional Government during early DS9 era; later presented as the Bajoran Republic).",
      "Capital": "Unknown",
      "Institutions": [
        "First Minister and the Chamber of Ministers",
        "Bajoran Militia (planetary defense and security)",
        "Kai and the Bajoran religious hierarchy",
        "Vedek Assembly (religious council)",
        "Local provincial authorities"
      ],
      "LawsAffectingVisitors": [
        "Bajoran law and local jurisdiction apply, including to Deep Space 9 while it is administered jointly with Starfleet.",
        "Access to sacred sites and religious artifacts is often controlled by Bajoran religious authorities.",
        "Specific immigration/visa regulations are Unknown."
      ],
      "Notes": "Bajor’s politics are portrayed as highly sensitive in the post-occupation period, with sovereignty concerns often shaping interactions with the Federation and neighboring powers."
    },
    "Economy": {
      "Overview": "A recovering post-occupation economy with strong agricultural roots and significant rebuilding needs; trade and services expand alongside Deep Space 9’s role as a regional hub.",
      "PrimaryIndustries": [
        "Agriculture (including wheat and other staple crops)",
        "Reconstruction and infrastructure recovery",
        "Local crafts and cultural production",
        "Trade and services linked to Deep Space 9 and regional travel"
      ],
      "TradeNotes": "Federation aid and cooperative projects are depicted as important during recovery, while regional instability can disrupt commerce.",
      "LocalCommerceNotes": "Local commerce is shown through farms, markets, and community-based exchange; details of standard currency and pricing are Unknown."
    },
    "Culture": {
      "Overview": "Bajoran culture is portrayed as spiritually centered, tradition-rich, and strongly shaped by the trauma of occupation and the pride of survival.",
      "SocialCustoms": "Common on-screen cultural markers include family-name ordering (family name first), distinctive earrings as identity and tradition, and social emphasis on community and remembrance.",
      "ReligiousLife": "The Bajoran faith venerates the Prophets (linked to the wormhole) and uses sacred artifacts known as Orbs; religious leadership includes the Kai and Vedeks, and faith regularly intersects with governance and daily life.",
      "Festivals": "Annual public celebrations include the Bajoran Gratitude Festival (associated with the greeting “Peldor Joi”).",
      "ArtsAndMedia": "Bajoran art and architecture are frequently portrayed through paintings, carved stonework, ceremonial spaces, and devotional objects; prophetic texts and iconography recur throughout DS9.",
      "LanguageNotes": "Bajoran language and ancient forms exist, but specific linguistic details and standardized transliterations are Unknown."
    },
    "Environment": {
      "Overview": "Bajor is depicted as a scenic, life-supporting world with abundant farmland and livable rural regions; environmental recovery and resource pressure are recurring post-occupation themes.",
      "Seasons": "Seasonal patterns are implied by harvest cycles and region-specific weather events; a complete planetary seasonal model is Unknown.",
      "NaturalHazards": [
        "Flooding (reported in some agricultural regions)",
        "Earthquakes (reported in connection with unusual regional instability)",
        "Unknown"
      ],
      "NightSky": "From orbit-adjacent locations, Deep Space 9 may be visible as a bright moving point; other night-sky details (moons/constellations) are Unknown."
    },
    "Appearances": {
      "Overview": "Bajor is the central world of Star Trek: Deep Space Nine, repeatedly visited and referenced as its society rebuilds after the Occupation and confronts the political and spiritual consequences of the nearby wormhole.",
      "BySeriesOrFilm": [
        {
          "Era": "DS9",
          "Highlights": [
            "Post-occupation recovery and political instability (Provisional Government, coups, leadership struggles).",
            "Religious and prophetic storylines tied to the Prophets, Orbs, and the Emissary.",
            "Civilian life shown through provinces, farms, festivals, and sacred sites.",
            "Major late-series spiritual conflict culminating at sacred locations on Bajor."
          ]
        },
        {
          "Era": "TNG (references)",
          "Highlights": [
            "Bajor is discussed in connection with the Cardassian conflict and Bajoran refugees; Bajorans are introduced before DS9."
          ]
        }
      ]
    },
    "CanonAppearances": {
      "Episodes": [
        "DS9: \"Emissary\" (Bajor and its spiritual leadership; DS9 begins as Bajor rebuilds; wormhole discovered in Bajoran space)",
        "DS9: \"The Circle\" / \"The Siege\" (Bajoran political crisis and extremist movement)",
        "DS9: \"Shakaar\" (soil reclamators dispute in Dahkur Province; political transition)",
        "DS9: \"Destiny\" (Qui’al Dam and prophecy-related engineering project)",
        "DS9: \"Fascination\" (Bajoran Gratitude Festival / “Peldor Joi”)",
        "DS9: \"Rapture\" (rediscovery of the City of B’hala; Bajor and Federation membership debate)",
        "DS9: \"The Reckoning\" (Prophets/Pah-wraiths conflict; earthquakes in Bajoran provinces)",
        "DS9: \"Penumbra\" (Sisko’s land in Kendra Province; personal plans on Bajor)",
        "DS9: \"Image in the Sand\" / \"Shadows and Symbols\" (Bajor-centric spiritual storyline leading into final arc)",
        "DS9: \"What You Leave Behind\" (final resolution involving Bajoran sacred sites and spiritual conflict)"
      ],
      "Films": [],
      "Notes": "This list highlights major Bajor-focused episodes; Bajor is referenced throughout DS9 and appears in many additional episodes."
    }
  },
  {
    "PlanetID": "planet-risa",
    "Name": "Risa",
    "AlternateNames": [],
    "Tags": [
      "Resort world",
      "Pleasure planet",
      "Federation destination"
    ],
    "TypeTags": [
      "ResortWorld",
      "PleasurePlanet"
    ],
    "Meta": {
      "CanonicalName": "Risa",
      "Classification": "Inhabited Class M Federation planet; widely known as a major resort destination (\"pleasure planet\").",
      "Affiliation": "United Federation of Planets",
      "NativeSpecies": [
        "Risians"
      ]
    },
    "Media": {
      "HeroImageURL": "https://raw.githubusercontent.com/BigBird7827/Pla-Trek/main/Images/Risa.png"
    },
    "TravelSummary": "Risa is a well-known leisure destination repeatedly depicted as a “pleasure planet” visited by Starfleet personnel and other travelers for shore leave. On-screen stories present Risa as a place built around hospitality, recreation, and romance, with resort districts designed to keep visitors comfortable and entertained.\n\nA distinctive on-screen feature of Risa is its planetwide weather-control system, which maintains stable, pleasant conditions in the resort regions shown. When that system is disrupted, the environment can shift rapidly into severe storms and unsafe conditions, turning a vacation setting into an emergency.",
    "Location": {
      "Quadrant": "Beta Quadrant",
      "Sector": "Unnamed sector",
      "StarSystem": "Epsilon Ceti star system (Epsilon Ceti B)",
      "Region": "Federation space",
      "NearbyLandmarks": []
    },
    "Appearance": "On-screen depictions emphasize bright, inviting resort vistas—sunlit skies, beaches, lush greenery, and landscaped public spaces designed for relaxation and recreation.",
    "Geography": "Unknown",
    "CitiesAndSites": [
      {
        "Name": "Risan resort districts",
        "Type": "Tourism / Leisure",
        "Description": "Beachfront and garden-like resort areas are the primary locations shown on-screen, including hotels, promenades, and outdoor gathering spaces associated with shore leave."
      },
      {
        "Name": "Weather-control infrastructure",
        "Type": "Planetary system",
        "Description": "Risa is shown to depend on a planetwide weather-control capability that can be targeted or disrupted, causing severe storms and dangerous conditions."
      }
    ],
    "Inhabitants": "Risans are the planet’s native people. Risa is also shown as a frequent destination for offworld visitors, including Starfleet personnel on shore leave.",
    "Tourism": "Tourism and recreation are central to how Risa is portrayed on-screen: visitors come for relaxation, resort amenities, romance, and organized leisure experiences. The planet is commonly described as a “pleasure planet,” and its public spaces are designed to welcome travelers.",
    "Logistics": "Access is presented through typical interstellar travel (arrivals by starship and local transport to resort areas). Specific entry requirements, customs rules, or visitor regulations are Unknown.",
    "Weather": {
      "ClimateType": "Managed / controlled (planetwide weather-control system shown on-screen)",
      "Seasonality": "Unknown",
      "TypicalConditions": "Generally depicted with stable, pleasant resort weather; when the weather-control system is disrupted, severe storms and hazardous conditions can occur.",
      "Hazards": [
        "Severe storms during weather-control disruptions",
        "Security incidents targeting tourism infrastructure (rare, episode-specific)"
      ]
    },
    "History": {
      "Overview": "On-screen stories focus on Risa’s role as a long-established resort destination rather than a detailed political or historical timeline. Specific founding history and major historical eras are Unknown.",
      "KeyEras": [
        {
          "Era": "Starfleet/Federation-era shore leave destination",
          "Summary": "Risa is repeatedly depicted as a common shore leave location for Starfleet crews and a recognized interstellar resort world."
        }
      ],
      "MajorEvents": [
        {
          "When": "Unknown",
          "Event": "Risa’s weather-control system is shown being disrupted in at least one major incident, producing dangerous storms and forcing emergency response by visiting personnel."
        }
      ]
    },
    "Government": {
      "Polity": "Risa Hedony",
      "Capital": "Nuvia",
      "Institutions": [
        "Risa Hedony"
      ],
      "LawsAffectingVisitors": [
        "Unknown"
      ],
      "Notes": "On-screen depictions emphasize tourism operations and public safety incidents; specific governmental structure and legal codes are Unknown."
    },
    "Economy": {
      "Overview": "Risa is portrayed primarily as a tourism-driven world built around hospitality, recreation, and services for visitors.",
      "PrimaryIndustries": [
        "Tourism and hospitality",
        "Recreation and leisure services"
      ],
      "TradeNotes": "Unknown",
      "LocalCommerceNotes": "Resort services, accommodations, and leisure amenities are repeatedly depicted; details of broader commerce are unknown."
    },
    "Culture": {
      "Overview": "Risa is portrayed as socially open and welcoming to visitors, with a strong emphasis on leisure, romance, and consent-signaling customs in resort contexts.",
      "SocialCustoms": "The horga’hn is shown as a cultural symbol used in the context of local romantic/sexual customs; ‘jamaharon’ is referenced as part of that culture’s shore leave environment.",
      "ReligiousLife": "Unknown",
      "Festivals": "Unknown",
      "ArtsAndMedia": "Unknown",
      "LanguageNotes": "Unknown"
    },
    "Environment": {
      "Overview": "Risa is depicted as a carefully maintained resort environment, supported by a planetwide weather-control system.",
      "Seasons": "Unknown",
      "NaturalHazards": [
        "Unknown"
      ],
      "NightSky": "Unknown"
    },
    "Appearances": {
      "Overview": "Risa appears as a recurring shore leave and vacation setting across multiple Star Trek series, often used for character-focused stories that contrast relaxation with sudden crisis.",
      "BySeriesOrFilm": [
        {
          "Era": "TNG",
          "Highlights": [
            "Risa is shown as a Starfleet shore leave destination with resort environments and controlled weather."
          ]
        },
        {
          "Era": "DS9",
          "Highlights": [
            "Risa is used as a vacation setting where political and ideological conflict impacts the resort environment and its weather-control system."
          ]
        },
        {
          "Era": "ENT",
          "Highlights": [
            "Risa is depicted as an early-era pleasure destination visited by Enterprise crew during shore leave."
          ]
        }
      ]
    },
    "CanonAppearances": {
      "Episodes": [
        "TNG: \"Captain's Holiday\" (Risa shore leave; horga’hn/jamaharon references)",
        "TNG: \"The Game\" (Risa shore leave setting)",
        "DS9: \"Let He Who Is Without Sin…\" (Risa vacation setting; weather-control disruption)",
        "ENT: \"Two Days and Two Nights\" (Risa shore leave setting)"
      ],
      "Films": [],
      "Notes": "Risa is referenced in other contexts, but the items above are the primary on-screen stories that directly depict the planet as a setting."
    }
  }
]
