{
  "PlanetID": "planet-earth",
  "Name": "Earth",
  "AlternateNames": [
    "Sol III",
    "Terra"
  ],
  "Tags": [
    "Homeworld",
    "Federation capital",
    "Starfleet HQ",
    "Core world",
    "Federation hub",
    "Starfleet",
    "Human homeworld",
    "Time travel"
  ],
  "TypeTags": [
    "Homeworld",
    "FederationCapital",
    "StarfleetHQ",
    "Core world"
  ],
  "Meta": {
    "CanonicalName": "Earth",
    "Classification": "Class M terrestrial planet",
    "Affiliation": "United Federation of Planets (founding world)",
    "NativeSpecies": [
      "Human"
    ]
  },
  "Media": {
    "HeroImageURL": "https://raw.githubusercontent.com/BigBird7827/Pla-Trek/main/Images/Earth.png"
  },
  "TravelSummary": "Earth (also known as Terra or Sol III) is the Human homeworld and a founding world of the United Federation of Planets. It is the political and administrative heart of the Federation in many eras, and it is frequently depicted as the center of Starfleet education and command.\n\nFor visitors, Earth is less defined by a single “destination” than by density of history: pivotal first-contact milestones, major diplomatic institutions, and cultural regions that remain recognizable across centuries. The planet’s story is told repeatedly through time-travel visits (from 20th–21st-century crises to 24th-century security emergencies) and through its role as the Federation’s symbolic core.",
  "Location": {
    "Quadrant": "Alpha Quadrant",
    "Sector": "Sector 001",
    "StarSystem": "Sol system",
    "Region": "Federation core worlds",
    "NearbyLandmarks": [
      "Luna",
      "Mars",
      "Jupiter",
      "Saturn",
      "Starfleet Headquarters / Starfleet Academy (San Francisco)"
    ]
  },
  "Appearance": "From orbit, Earth is consistently portrayed as a blue-and-white globe with extensive oceans, swirling cloud systems, and bright polar caps. Night-side views commonly show concentrated city-light clusters and heavy orbital traffic around major facilities.\n\nOn the surface, depictions range from familiar 20th–21st-century cityscapes (San Francisco, Los Angeles, New York, Detroit) to late-23rd–24th-century futuristic skylines around Starfleet and Federation sites. Iconic landmarks such as the Golden Gate Bridge and the Parisian skyline recur as visual shorthand for the planet.",
  "Geography": "Earth is a multi-biome Class M terrestrial planet with extensive oceans and diverse climates. In canon depictions, coastlines, river deltas, mountain ranges, deserts, forests, and polar regions are all shown as major ecological zones, supporting dense population centers and large protected natural areas.\n\nRepeated screen appearances emphasize the San Francisco Bay Area (especially the Presidio and the Golden Gate Bridge) as a strategic hub for Starfleet facilities, while Europe (notably France and Paris) appears as a locus for Federation civil governance and long-standing family estates.",
  "CitiesAndSites": [
    {
      "Name": "San Francisco (Presidio) — Starfleet Headquarters & Starfleet Academy",
      "Type": "Administrative / Academy",
      "Description": "A recurring on-screen hub for Starfleet operations and training. The Presidio area is repeatedly associated with both Starfleet Headquarters and Starfleet Academy, often framed with the Golden Gate Bridge nearby."
    },
    {
      "Name": "Paris — Office of the Federation President",
      "Type": "Political / Executive",
      "Description": "Paris is identified as the location of the Federation President’s office in multiple on-screen contexts, and is used as a shorthand for Federation civil authority and high-level diplomacy."
    },
    {
      "Name": "Federation Council (San Francisco convening site, 2286)",
      "Type": "Government / Legislative",
      "Description": "The Federation Council is depicted convening in San Francisco during the events surrounding Earth’s 2286 crisis with the Whale Probe and the subsequent Federation Council proceedings."
    },
    {
      "Name": "Golden Gate Bridge",
      "Type": "Landmark",
      "Description": "A persistent visual landmark in Earth-set stories. It is shown prominently in connection with Starfleet facilities and is canonically damaged during the Dominion War-era Breen raid on Earth."
    },
    {
      "Name": "New Orleans — Joseph Sisko’s restaurant",
      "Type": "Cultural / Civilian",
      "Description": "A notable civilian setting tied to Benjamin Sisko’s family life, shown during Earth-focused Deep Space Nine stories about security and civil authority."
    },
    {
      "Name": "Bozeman, Montana — Warp flight / First Contact region",
      "Type": "Historical",
      "Description": "Associated with Zefram Cochrane’s warp flight and Humanity’s first contact with Vulcans as portrayed in Star Trek: First Contact."
    },
    {
      "Name": "San Francisco — Sanctuary District A (Bell Riots site, 2024)",
      "Type": "Historical / Social Crisis",
      "Description": "The walled “Sanctuary District” system and the Bell Riots are portrayed as pivotal early-21st-century events in San Francisco that influenced later human social development."
    },
    {
      "Name": "Los Angeles — time-visit settings (1996 / 2024)",
      "Type": "Time-Travel Setting",
      "Description": "Depicted in multiple time-travel narratives, including late-20th-century and early-21st-century visits with major consequences for the timeline."
    },
    {
      "Name": "Spacedock One (Earth orbit)",
      "Type": "Orbital Facility",
      "Description": "A major Starfleet spacedock in Earth orbit from the late 23rd through early 25th centuries, shown as a key shipyard/berthing facility."
    }
  ],
  "Inhabitants": "Earth’s native intelligent species is Human, and Humans remain the planet’s primary population throughout the franchise. Because Earth is closely tied to Federation governance and Starfleet, it is also shown hosting substantial numbers of off‑world residents and visitors in major cities.\n\nOn-screen stories emphasize Earth’s pluralistic culture (multiple languages, traditions, and regional identities) alongside the Federation’s broader multi-species civic identity. During crises (such as infiltration scares or wartime raids) civilian life is portrayed as both resilient and politically consequential, with Earth’s population and institutions influencing Federation-wide decisions.",
  "Tourism": {
    "Overview": "Earth is portrayed less as an “exotic” destination and more as the Federation’s cultural anchor: a place to study, to commemorate, and to conduct diplomacy. Tourism in canon typically appears indirectly—through visits to family homes, historic sites tied to first contact, and major civic landmarks.\n\nBecause of frequent time-travel narratives, many Earth locations are also depicted as historically significant in more than one era (e.g., early-21st-century social policy sites later remembered as turning points).",
    "RecommendedExperiences": [
      "Visit the Starfleet Academy grounds and adjacent Presidio vistas in San Francisco (when accessible).",
      "Walk the Golden Gate Bridge and waterfront approaches used as establishing shots for Starfleet-era San Francisco.",
      "Explore Parisian civic districts associated with Federation executive authority.",
      "Historical tours of First Contact-related sites associated with Cochrane-era milestones."
    ],
    "CulturalEtiquetteNotes": "Earth’s etiquette varies widely by region, but Starfleet and Federation civic spaces tend to emphasize formality, security protocols, and respect for multicultural norms. During heightened security periods, visitors should expect screenings and restricted access around governmental and Starfleet facilities."
  },
  "Logistics": "Major transport hubs connect surface cities to orbital facilities and Starfleet traffic. High-security zones around Federation and Starfleet sites may impose access restrictions; visitors should expect screening and controlled transit in sensitive areas.",
  "Weather": {
    "ClimateType": "Highly variable (multi-biome)",
    "Seasonality": "Pronounced seasons at mid/high latitudes; monsoons and dry seasons in some regions; tropical belts remain warm year-round.",
    "TypicalConditions": "Weather ranges from mild coastal fog to continental storms; conditions depend heavily on region and season.",
    "Hazards": [
      "Severe storms (region-dependent)",
      "Heatwaves/cold snaps (seasonal)",
      "Earthquakes and volcanic activity (localized)"
    ]
  },
  "History": {
    "Overview": "Earth’s canon history is repeatedly framed as a long arc from 20th–21st-century upheaval to an interstellar, post-scarcity Federation society. The planet’s role in founding the United Federation of Planets makes it a frequent backdrop for political turning points and symbolic crises.",
    "KeyEvents": [
      {
        "Event": "Bell Riots and the Sanctuary District crisis (San Francisco)",
        "Era": "21st century (2024)",
        "Summary": "A pivotal civil disturbance tied to the Sanctuary District system; depicted as a watershed event in early-21st-century Earth social history."
      },
      {
        "Event": "First contact era milestones (Cochrane’s warp flight; Vulcan contact)",
        "Era": "Mid-21st century",
        "Summary": "Earth’s transition to interstellar engagement is dramatized through the first-warp/first-contact narrative central to the Federation’s origin story."
      },
      {
        "Event": "V’Ger crisis",
        "Era": "Late 23rd century (2273)",
        "Summary": "An immense entity threatens Earth, prompting a high-stakes response by the refitted USS Enterprise."
      },
      {
        "Event": "Whale Probe crisis",
        "Era": "Late 23rd century (2286)",
        "Summary": "An unknown probe disables systems and threatens planetary catastrophe until its signal is answered."
      },
      {
        "Event": "Changeling infiltration scare and attempted militarized takeover",
        "Era": "24th century (2372)",
        "Summary": "Earth undergoes severe security measures amid fears of Dominion infiltration; events include martial-law conditions and an attempted coup narrative."
      },
      {
        "Event": "Battle of Sector 001 (Borg incursion)",
        "Era": "24th century (2373)",
        "Summary": "A Borg assault reaches Earth’s vicinity; the battle becomes a defining event in Federation security history."
      },
      {
        "Event": "Breen attack on Earth",
        "Era": "24th century (late 2375)",
        "Summary": "A surprise raid strikes San Francisco and Starfleet Headquarters during the Dominion War, inflicting major damage including to the Golden Gate Bridge."
      }
    ],
    "ContinuityNotes": [
      "Earth’s 20th–21st-century depictions vary depending on time-travel episode/film, but major events like the Bell Riots are treated as timeline-critical.",
      "Earth is repeatedly framed as central to Federation governance and Starfleet infrastructure across eras."
    ]
  },
  "Government": {
    "Overview": "Earth is shown operating under planetary-level governance (e.g., “United Earth” in the pre-Federation era) and, later, as a core member world within the United Federation of Planets. In the Federation era, Earth is closely associated with executive leadership and high-level civil administration.",
    "LocalGovernmentNotes": "Specific local political structures are rarely detailed on-screen; most Earth political storytelling focuses on Federation/Starfleet decision-making, security powers, and civil-military boundaries.",
    "FederationPresence": "Earth is repeatedly depicted as hosting critical Federation institutions and Starfleet command functions, making it a focal point for debates about civil authority versus Starfleet security powers."
  },
  "Economy": {
    "Overview": "Earth is often portrayed as part of a post-scarcity Federation society where replicator technology and social priorities reduce traditional resource scarcity. On-screen, discussions about wealth and labor frequently emphasize service, exploration, and civic responsibility over accumulation.",
    "TradeNotes": "Earth functions as an administrative and cultural hub rather than a frontier trade world. When commerce is shown, it is usually tied to off-world travel, Starfleet logistics, or specific historical-era depictions.",
    "LocalCommerceNotes": "Civilian businesses appear in certain eras and time-travel contexts (restaurants, bars, services), but the franchise seldom provides a comprehensive economic model for Earth."
  },
  "Culture": {
    "Overview": "Earth’s culture is depicted as pluralistic and regionally diverse, with long-lived traditions persisting into the Federation era. The planet also embodies a Federation-wide identity built around cooperation, exploration, and diplomacy.",
    "SocialCustoms": "Social norms vary by region and era. In Starfleet-adjacent environments, professional decorum and chain-of-command expectations are common, while civilian settings emphasize family, art, food, and local community life.",
    "ReligiousLife": "Earth’s religious diversity is implied rather than explored in depth; stories more often focus on secular civic ideals and the ethical responsibilities of a spacefaring society.",
    "Festivals": "Specific Earth festivals are occasionally referenced, but most Earth cultural moments on-screen appear through family gatherings, commemorations, and Academy or governmental ceremonies.",
    "ArtsAndMedia": "Earth art, music, and literature are frequently referenced across the franchise as shared heritage, often used to contrast 24th-century ethics with earlier centuries.",
    "LanguageNotes": "Human languages remain in use, but Federation Standard (often presented as English for the audience) dominates in most interstellar contexts."
  },
  "Environment": {
    "Overview": "Earth is portrayed as environmentally rich and habitable, with stable ecosystems that support extensive human settlement and protected natural regions. Weather is shown as largely familiar to contemporary Earth, with the occasional depiction of severe anomalies during extraordinary events.",
    "Seasons": "Seasonal variation is implied across Earth regions; most episodes focus on temperate coastal climates (notably the San Francisco Bay Area) unless a story requires another environment.",
    "NaturalHazards": "Natural hazards are not a dominant theme for Earth in most eras; major environmental threats depicted on-screen are typically induced (e.g., the Whale Probe’s global effects) rather than purely geological or meteorological.",
    "NightSky": "Earth’s night sky is occasionally depicted with visible orbital traffic and spacedock facilities; otherwise it matches familiar stellar backdrops depending on era and production needs."
  },
  "Appearances": {
    "Overview": "Earth appears throughout Star Trek as both a homecoming setting (family visits, Academy life, diplomacy) and as a high-stakes target during major crises. It is also one of the franchise’s most common time-travel destinations.",
    "BySeriesOrFilm": {
      "TOS": "Prominently featured in time-travel and historical-visitor stories such as “Assignment: Earth” and “The City on the Edge of Forever.”",
      "TNG": "Seen in episodes tied to Starfleet, family life, and Federation politics; Earth often functions as the setting for institutional and personal turning points.",
      "DS9": "Central to “Past Tense” (2024), and later to the Dominion infiltration and security crises in “Homefront/Paradise Lost,” plus wartime consequences.",
      "VOY": "Visited in time-travel arcs and referenced as home; Earth’s institutions (Academy/Command) recur in Voyager-era storytelling.",
      "ENT": "Depicted in pre-Federation contexts and time-travel episodes, emphasizing Earth’s early interstellar era and its vulnerabilities.",
      "PIC": "Used as a focal setting for early-21st-century timeline manipulation and as a touchstone for legacy characters."
    }
  },
  "CanonAppearances": {
    "Episodes": [
      "TOS: “Assignment: Earth”",
      "TOS: “The City on the Edge of Forever”",
      "TNG: “The First Duty”",
      "DS9: “Past Tense, Part I” / “Past Tense, Part II”",
      "DS9: “Homefront” / “Paradise Lost”",
      "VOY: “Future’s End, Part I” / “Future’s End, Part II”",
      "ENT: “Carpenter Street”",
      "PIC: “Assimilation” (2024 setting)"
    ],
    "Films": [
      "Star Trek: The Motion Picture",
      "Star Trek IV: The Voyage Home",
      "Star Trek: First Contact"
    ],
    "Notes": "This list is representative rather than exhaustive; Earth is referenced or briefly seen in many additional episodes and films."
  },
  "DataQuality": {
    "Confidence": "High",
    "Coverage": "High for government/Starfleet landmarks and major on-screen crises; moderate for local civilian life outside featured episodes/films.",
    "KnownGaps": [
      "Precise details of Earth’s day-to-day civilian administration and economy are rarely specified on-screen.",
      "Many regional locations on Earth are mentioned only once or appear briefly without broader context."
    ],
    "VerificationNotes": [
      "Key institutional locations (San Francisco/Presidio; Paris President’s office) and major crises (Bell Riots; Breen raid; Whale Probe) are supported by on-screen references summarized in canonical encyclopedic sources."
    ]
  }
}
