{
  "Meta": {
    "Project": "Plan-Trek",
    "DataSet": "TravelGuidePlanets",
    "Build": 11,
    "Version": 1,
    "LastUpdated": "2025-12-15",
    "Schema": {
      "SchemaName": "Pla-Trek Planets",
      "SchemaVersion": "1.1",
      "AdditiveUpgrade": true
    }
  },
  "Planets": [
    {
      "PlanetID": "planet-earth",
      "Name": "Earth",
      "AlternateNames": [
        "Sol III",
        "Terra"
      ],
      "TypeTags": [
        "Homeworld",
        "FederationCapital",
        "StarfleetHQ"
      ],
      "Location": {
        "Quadrant": "Alpha Quadrant",
        "QuadrantNotes": "Earth is the human homeworld and the seat of major Federation institutions.",
        "StarSystem": "Sol system",
        "Sector": "Sector 001",
        "Region": "United Federation of Planets (core worlds)",
        "Subregion": "Terran system space",
        "DistanceFromSolLy": 0,
        "Notes": "Earth is the third planet of the Sol system (Sol III) and a principal administrative world for Federation affairs."
      },
      "QuickFacts": {
        "Class": "Class M",
        "PrimaryInhabitants": [
          "Humans"
        ],
        "PrimaryLanguageNotes": [
          "Federation Standard is widely used; most visitors will not have communication issues."
        ],
        "LocalTimekeeping": {
          "DayLengthHours": 24,
          "TimeFormat": "24-hour commonly used in Starfleet contexts"
        }
      },
      "TravelSummary": "Earth (Sol III) is the human homeworld and a core member world of the United Federation of Planets. In the 23rd–25th centuries it hosts major Federation and Starfleet institutions, making it a frequent destination for diplomacy, education, and interstellar travel.",
      "Appearance": "From orbit, Earth presents bright blue oceans, varied green-brown landmasses, and extensive white cloud systems. The planet’s night side is often marked by dense city-light patterns, while orbital infrastructure and traffic can be heavy near major hubs.",
      "Geography": "A Class-M world with diverse biomes and seven major continents separated by broad oceans. Key climatic zones range from polar ice caps to temperate forests and equatorial tropics; many regions have been restored and protected after earlier industrial damage.",
      "Inhabitants": "Primarily Humans, with a long history of multicultural societies and wide linguistic diversity. By the Federation era, Earth regularly hosts large non-human populations for diplomatic, academic, and Starfleet-related reasons.",
      "Weather": {
        "ClimateType": "Varied (global range: polar to tropical)",
        "Seasonality": "Pronounced seasonal variation in many temperate regions; regional microclimates are common.",
        "TypicalConditions": "Conditions vary widely by latitude and terrain; coastal zones can be humid and storm-prone, interiors can be arid or continental.",
        "Hazards": [
          "Tropical cyclones and severe storms in some ocean basins",
          "Blizzards in polar/high-latitude regions",
          "Heat waves and drought in some continental interiors"
        ]
      },
      "Tourism": "Earth supports a broad range of visitor experiences: cultural centers, historic landmarks, natural preserves, and major Federation institutions. Visitors should expect strict security protocols near key governmental and Starfleet facilities.",
      "Logistics": "Earth has extensive space traffic control, multiple orbital facilities, and frequent starship arrivals. Transit between major cities is efficient; access to restricted sites (e.g., sensitive government or Starfleet areas) typically requires authorization.",
      "CanonAppearances": {
        "FirstSeen": {
          "Series": "TOS",
          "EpisodeOrFilm": "The Cage (as referenced) / later visits",
          "YearInUniverse": null
        },
        "Key": []
      },
      "Tags": [
        "Capital World",
        "Class M",
        "CoreWorld",
        "Federation Core",
        "HighInfrastructure",
        "HighSecurityPotential",
        "Human Homeworld"
      ],
      "Media": {
        "HeroImageURL": "https://raw.githubusercontent.com/BigBird7827/Pla-Trek/main/Images/Earth.png",
        "Gallery": []
      },
      "CitiesAndSites": [
        {
          "Name": "San Francisco (Starfleet Headquarters)",
          "Type": "City / Starfleet hub",
          "Description": "A major Starfleet administrative center and common location for fleet operations and ceremonial events; closely associated with Starfleet Academy."
        },
        {
          "Name": "Starfleet Academy",
          "Type": "Academy",
          "Description": "Starfleet’s premier officer-training institution, widely depicted as located in the San Francisco area."
        },
        {
          "Name": "Paris (Federation capital functions)",
          "Type": "City / Government center",
          "Description": "Commonly associated with Federation-level governmental functions, including offices connected with the Federation President and Council."
        },
        {
          "Name": "Bozeman, Montana (First warp flight site)",
          "Type": "Historic site",
          "Description": "Site associated with Zefram Cochrane’s first warp flight and the historic first contact with Vulcans."
        }
      ],
      "PlaceRefs": {
        "Cities": [],
        "Regions": [],
        "Landmarks": [],
        "Settlements": [],
        "Moons": [],
        "OrbitalFacilities": []
      },
      "FeatureRefs": [],
      "OrganizationRefs": [],
      "History": {
        "Overview": "Earth’s modern interstellar era begins with the warp age and first contact with Vulcans, leading to United Earth and, later, the founding of the United Federation of Planets. Across multiple centuries, Earth remains a political and cultural center while also serving as a key Starfleet staging and training world.",
        "KeyEras": [
          {
            "Era": "Warp and First Contact era",
            "Summary": "Humanity’s transition to warp travel and first interstellar diplomacy."
          },
          {
            "Era": "Federation founding and expansion",
            "Summary": "Earth as a principal founding world and administrative hub."
          },
          {
            "Era": "Klingon, Romulan, and Dominion-era crises",
            "Summary": "Repeated security incidents and wartime mobilization impacting Earth and its institutions."
          }
        ],
        "MajorEvents": [
          {
            "When": "2063",
            "Event": "First warp flight and first contact with Vulcans (Bozeman)."
          },
          {
            "When": "2161",
            "Event": "Founding of the United Federation of Planets (Earth as a founding world)."
          },
          {
            "When": "24th century",
            "Event": "Earth repeatedly serves as the location for high-level Federation and Starfleet decision-making during major conflicts."
          }
        ]
      },
      "Government": {
        "Polity": "United Federation of Planets; Earth also maintains planetary governance (United Earth in various eras).",
        "Capital": "Paris (Federation capital functions); major Starfleet command functions in the San Francisco area.",
        "Institutions": [
          "Federation Council and executive offices (Federation era)",
          "Starfleet Headquarters",
          "Starfleet Academy"
        ],
        "LawsAffectingVisitors": [
          "Strict security zones around sensitive facilities",
          "Standard Federation customs and immigration controls for off-world visitors"
        ],
        "Notes": "Earth is routinely treated as a political capital and major Starfleet hub in multiple eras."
      },
      "Economy": {
        "Overview": "A post-scarcity Federation core world emphasizing governance, education, science, and cultural exchange.",
        "PrimaryIndustries": [
          "Administration and diplomacy",
          "Academia and research",
          "Starfleet training and logistics",
          "Tourism and cultural institutions"
        ],
        "TradeNotes": "Earth’s strategic value is institutional rather than export-driven; it hosts conferences, councils, and major interstellar events.",
        "LocalCommerceNotes": "Commercial activity exists, but day-to-day life is depicted as largely beyond traditional monetary scarcity within Federation society."
      },
      "Culture": {
        "Overview": "Highly pluralistic human culture with strong traditions in arts, cuisine, and civic institutions; Earth is frequently portrayed as a meeting place for Federation worlds.",
        "SocialCustoms": "Visitors are expected to observe local customs of the region they are in; major governmental and Starfleet facilities operate with formal protocols.",
        "ReligiousLife": "A wide range of religious and philosophical traditions persist in the Federation era, alongside secular civic culture.",
        "Festivals": "Numerous regional and planetary holidays; large public ceremonies sometimes accompany Federation or Starfleet events.",
        "ArtsAndMedia": "Earth remains a major center for literature, music, museums, and performance, often serving as a cultural reference point for other worlds.",
        "LanguageNotes": "Many languages remain in active use; Federation Standard is common in interstellar contexts."
      },
      "Environment": {
        "Overview": "Ecologically diverse world with significant protected areas; restoration and conservation are frequently implied in Federation-era portrayals.",
        "Seasons": "Strong latitudinal seasons on many landmasses; stable temperate climates in some coastal regions.",
        "NaturalHazards": [
          "Natural seismic activity",
          "Severe weather in some regions"
        ],
        "NightSky": "A busy orbital environment is common near major population centers; lunar visibility is prominent in many depictions."
      },
      "DataQuality": {
        "Certainty": "High",
        "Notes": ""
      },
      "Appearances": {
        "Overview": "Appears across nearly every Star Trek era as an anchor location for Federation politics and Starfleet.",
        "BySeriesOrFilm": [
          {
            "Era": "TOS/TAS films era",
            "Highlights": [
              "Starfleet operations and return-to-Earth story beats in films"
            ]
          },
          {
            "Era": "TNG/DS9/VOY era",
            "Highlights": [
              "Federation political center; Starfleet security and crisis response episodes"
            ]
          },
          {
            "Era": "ENT era",
            "Highlights": [
              "United Earth and early Starfleet; post-warp political development"
            ]
          },
          {
            "Era": "PIC era",
            "Highlights": [
              "Starfleet Headquarters and Federation policy decisions"
            ]
          }
        ]
      }
    },
    {
      "PlanetID": "planet-vulcan",
      "Name": "Vulcan",
      "AlternateNames": [
        "Ni'Var (later era name)",
        "Ni'Var (later era)"
      ],
      "TypeTags": [
        "Homeworld",
        "FederationFoundingWorld"
      ],
      "Location": {
        "Quadrant": "Beta Quadrant",
        "QuadrantNotes": "Vulcan is a core Federation member world associated with early Federation history.",
        "StarSystem": "Vulcan system",
        "Sector": "Vulcan sector (Sector 005)",
        "Region": "Federation space / Vulcan territory",
        "Notes": "Vulcan is commonly placed in the Vulcan sector and relatively close to Earth by interstellar standards."
      },
      "QuickFacts": {
        "Class": "Class M",
        "PrimaryInhabitants": [
          "Vulcans"
        ],
        "SkyNotes": [
          "Vulcan has no natural moons in canon references; it forms a binary pair with the companion planet T'Khut, which can be prominent in the sky under clear conditions."
        ],
        "LocalTimekeeping": {
          "DayLengthHours": null,
          "TimeFormat": "Local standards; visitors commonly rely on shipboard chronometers and civic time beacons."
        }
      },
      "TravelSummary": "Vulcan is the homeworld of the Vulcans and one of the most influential founding worlds associated with the Federation. The planet is known for its arid landscapes, intense heat, and ancient cultural sites tied to Vulcan philosophy and tradition.",
      "Appearance": "From orbit, Vulcan shows broad rust-red and ochre deserts broken by darker volcanic terrain and rugged mountain chains. Atmospheric haze and dust can soften surface contrast, especially near desert basins.",
      "Geography": "A predominantly arid Class-M world with extensive deserts and badlands. Notable regions include the Forge, a harsh desert expanse, and mountainous areas associated with major cultural institutions.",
      "Inhabitants": "Primarily Vulcans. Off-world residents and visitors are common in diplomatic and academic contexts, including at major scientific institutions.",
      "Weather": {
        "ClimateType": "Hot arid (desert-dominant)",
        "Seasonality": "Seasonal variation exists but is often less pronounced than daily extremes in desert regions.",
        "TypicalConditions": "High temperatures, low precipitation, and frequent dry winds; local microclimates exist near protected settlements and oases.",
        "Hazards": [
          "Heat exposure and dehydration risk in open deserts",
          "Dust storms in arid basins",
          "Rapid temperature drops after sunset in some regions"
        ]
      },
      "Tourism": "Vulcan’s primary draws are cultural and scientific: historic temples, academic institutions, and ceremonial sites. Visitors should expect reserved social norms and should avoid interrupting rituals or meditative practices.",
      "Logistics": "Major population centers and institutions are accessible via established transport corridors. Travel into harsh desert regions requires preparation, environmental protection, and—at times—local guidance.",
      "CanonAppearances": {
        "FirstSeen": {
          "Series": "TOS",
          "EpisodeOrFilm": "Amok Time",
          "YearInUniverse": null
        },
        "Key": []
      },
      "Tags": [
        "Arid",
        "Class M",
        "EtiquetteCritical",
        "Founding World",
        "GuidesRecommendedForWilderness",
        "HeatPreparednessRequired",
        "Vulcan Homeworld"
      ],
      "Media": {
        "HeroImageURL": "https://raw.githubusercontent.com/BigBird7827/Pla-Trek/main/Images/Vulcan.png",
        "Gallery": []
      },
      "CitiesAndSites": [
        {
          "Name": "ShiKahr",
          "Type": "City",
          "Description": "A major Vulcan city associated with prominent institutions and governmental or cultural activity in multiple eras."
        },
        {
          "Name": "Vulcan Science Academy",
          "Type": "Scientific institution",
          "Description": "A leading Vulcan academic institution, frequently referenced in Federation-era science and policy contexts."
        },
        {
          "Name": "Mount Seleya",
          "Type": "Sacred mountain / monastery region",
          "Description": "A major spiritual and cultural site associated with Vulcan rites and tradition."
        },
        {
          "Name": "The Forge",
          "Type": "Desert region",
          "Description": "A harsh desert expanse known for dangerous conditions and historical significance in 22nd-century Vulcan stories."
        }
      ],
      "PlaceRefs": {
        "Cities": [],
        "Regions": [],
        "Landmarks": [],
        "Settlements": [],
        "Moons": [],
        "OrbitalFacilities": []
      },
      "FeatureRefs": [],
      "OrganizationRefs": [],
      "History": {
        "Overview": "Vulcan civilization is portrayed as ancient and highly influential, with a major cultural shift toward logic and emotional discipline shaping its global institutions. In the modern era, Vulcan becomes central to interstellar diplomacy and serves as a crucial partner in early human spaceflight and Federation founding.",
        "KeyEras": [
          {
            "Era": "Reformation toward logic",
            "Summary": "Cultural transformation emphasizing logic and emotional control, shaping Vulcan society and governance."
          },
          {
            "Era": "Early human–Vulcan relations",
            "Summary": "Vulcan guidance and friction during humanity’s early warp era."
          },
          {
            "Era": "Federation era",
            "Summary": "Vulcan as a major diplomatic, scientific, and cultural center within the Federation framework."
          }
        ],
        "MajorEvents": [
          {
            "When": "22nd century",
            "Event": "Vulcan institutions and politics play a key role in early United Earth and Starfleet development."
          },
          {
            "When": "2161",
            "Event": "Vulcan is associated with the founding era of the United Federation of Planets."
          }
        ]
      },
      "Government": {
        "Polity": "Vulcan planetary governance; historically includes bodies such as the Vulcan High Command in the 22nd century, with later civilian structures within Federation context.",
        "Capital": "ShiKahr (commonly associated with major institutions and governance).",
        "Institutions": [
          "Vulcan Science Academy",
          "Vulcan governmental councils (various eras)",
          "Religious/monastic orders tied to major rites"
        ],
        "LawsAffectingVisitors": [
          "Respect for restricted ceremonial sites",
          "Permits and escorts may be required for travel into hazardous desert regions"
        ],
        "Notes": "Governance and institutional names vary across eras; Vulcan is often depicted as operating with strong civil and scientific authority."
      },
      "Economy": {
        "Overview": "A science- and diplomacy-oriented society emphasizing education, research, and interstellar policy influence rather than mass export industry.",
        "PrimaryIndustries": [
          "Science and research",
          "Education",
          "Diplomacy and interstellar administration",
          "Specialized manufacturing and cultural goods"
        ],
        "TradeNotes": "Vulcan’s major interstellar value is institutional and intellectual; technological and scientific collaboration is repeatedly emphasized.",
        "LocalCommerceNotes": "Visitors typically interact with structured institutions, academic campuses, and regulated cultural sites."
      },
      "Culture": {
        "Overview": "A tradition-heavy culture organized around logic, ritual discipline, and deep historical continuity; public behavior tends to be formal and reserved.",
        "SocialCustoms": "Ritual etiquette is important; visitors are expected to be punctual, quiet in ceremonial settings, and respectful of personal boundaries.",
        "ReligiousLife": "Philosophical and spiritual traditions remain influential, particularly at sites tied to historic rites and monastic orders.",
        "Festivals": "Ceremonial observances and rites are prominent, sometimes involving pilgrimages to sacred locations.",
        "ArtsAndMedia": "Vulcan arts are portrayed as refined and formal, often connected to long cultural lineages.",
        "LanguageNotes": "Vulcan language is widely used locally; Federation Standard is common in interstellar contexts."
      },
      "Environment": {
        "Overview": "Arid ecosystems with hardy desert-adapted flora and fauna; settlements rely on infrastructure, careful resource management, and protected habitats.",
        "Seasons": "Hot seasons dominate many regions; some highland areas can be cooler.",
        "NaturalHazards": [
          "Extreme heat in open deserts",
          "Desert storms",
          "Long-range travel risks in sparsely populated regions"
        ],
        "NightSky": "Clear desert nights can offer high visibility, though dust haze can reduce clarity during storm periods."
      },
      "DataQuality": {
        "Certainty": "High",
        "Notes": ""
      },
      "Appearances": {
        "Overview": "Appears as a key cultural and diplomatic world, especially in stories about early Federation history and Vulcan tradition.",
        "BySeriesOrFilm": [
          {
            "Era": "ENT era",
            "Highlights": [
              "Vulcan politics, the Forge, and early human–Vulcan relations"
            ]
          },
          {
            "Era": "TOS/TNG era",
            "Highlights": [
              "Vulcan culture, rites, and diplomatic contexts"
            ]
          },
          {
            "Era": "Films/PIC era",
            "Highlights": [
              "Federation-era Vulcan institutions and their influence on interstellar events"
            ]
          }
        ]
      }
    },
    {
      "PlanetID": "planet-ferenginar",
      "Name": "Ferenginar",
      "AlternateNames": [],
      "TypeTags": [
        "Homeworld"
      ],
      "Media": {
        "HeroImageURL": "https://raw.githubusercontent.com/BigBird7827/Pla-Trek/main/Images/Ferenginar.png",
        "Gallery": []
      },
      "Location": {
        "Quadrant": "Alpha Quadrant",
        "QuadrantNotes": "Ferenginar is located in Ferengi space in the Alpha Quadrant; no consistent sector label is established in primary canon.",
        "StarSystem": "Ferenginar system (often referenced as a system; star name not consistently specified)",
        "Sector": "Ferengi space (sector designation not consistently specified on-screen)",
        "Region": "Ferengi Alliance space",
        "Notes": "Ferenginar is treated as a major political and economic hub for Ferengi civilization."
      },
      "QuickFacts": {
        "Class": "Class M",
        "PrimaryInhabitants": [
          "Ferengi"
        ],
        "PrimaryLanguageNotes": [
          "Ferengi language is common in domestic contexts; Federation Standard is widely understood in trade-facing areas."
        ],
        "LocalTimekeeping": {
          "DayLengthHours": null,
          "TimeFormat": "Local standards; visitors typically rely on shipboard chronometers and civic time beacons for appointments."
        }
      },
      "TravelSummary": "Ferenginar is the homeworld and capital world of the Ferengi Alliance. It is famed for near-constant rain, dense cloud cover, and a culture where commerce and the Rules of Acquisition shape public life.",
      "Appearance": "A humid green-brown world often concealed by thick cloud decks and storm bands. Wet lowlands, winding waterways, and sprawling urban-commercial centers dominate many depictions.",
      "Geography": "Low-lying, waterlogged terrain with extensive wetlands, river deltas, and muddy basins. Built environments emphasize towers, markets, and enclosed commercial districts adapted to heavy rainfall.",
      "Inhabitants": "Primarily Ferengi. Off-worlders commonly visit for trade, contracts, and diplomatic meetings with the Ferengi Alliance.",
      "Weather": {
        "ClimateType": "Humid subtropical / wet tropical (storm-dominant)",
        "Seasonality": "Frequent precipitation year-round; seasonal shifts are less emphasized than persistent storm patterns.",
        "TypicalConditions": "Heavy rain, high humidity, overcast skies, and frequent lightning storms; ground conditions are often muddy or waterlogged.",
        "Hazards": [
          "Severe thunderstorms and lightning",
          "Flooding in lowlands",
          "Poor visibility during heavy rain"
        ],
        "TravelGear": [
          "Sealed outer layer or poncho; quick-dry clothing",
          "Waterproof bags for comm devices and padds",
          "Non-slip footwear",
          "Anti-fog eye protection in heavy humidity"
        ]
      },
      "Tourism": "Visitors typically come for commerce: markets, auctions, and meetings with Ferengi institutions. Cultural norms favor negotiation; conspicuous displays of profit-making are socially accepted.",
      "Logistics": "Rain gear is essential. Many transactions are conducted in controlled indoor spaces. Visitors should expect active legal/financial oversight by Ferengi authorities and strict enforcement of contract terms.",
      "CanonAppearances": {
        "FirstSeen": {
          "Series": "DS9",
          "EpisodeOrFilm": "Family Business",
          "YearInUniverse": null
        },
        "Key": [
          {
            "SeriesOrFilm": "DS9: Family Business",
            "Notes": ""
          },
          {
            "SeriesOrFilm": "DS9: Prophet Motive",
            "Notes": ""
          },
          {
            "SeriesOrFilm": "DS9: The Magnificent Ferengi",
            "Notes": ""
          }
        ]
      },
      "Tags": [
        "Capital World",
        "Class M",
        "Ferengi Homeworld",
        "HighHaggleCulture",
        "HumidityPreparednessRequired",
        "RainWorld",
        "TouristScamRisk",
        "Wet Climate"
      ],
      "CitiesAndSites": [
        {
          "Name": "Tower of Commerce",
          "Type": "Commercial/government complex",
          "Description": "A prominent Ferengi commercial landmark associated with high-level business and Alliance affairs."
        },
        {
          "Name": "Ferengi Commerce Authority offices",
          "Type": "Regulatory institution",
          "Description": "Administrative centers connected with regulation, enforcement, and dispute resolution in Ferengi commerce."
        },
        {
          "Name": "Grand Nagus residence/seat",
          "Type": "Governmental site",
          "Description": "The seat of the Grand Nagus, central to Ferengi political leadership and major decisions."
        }
      ],
      "PlaceRefs": {
        "Cities": [],
        "Regions": [],
        "Landmarks": [],
        "Settlements": [],
        "Moons": [],
        "OrbitalFacilities": []
      },
      "FeatureRefs": [],
      "OrganizationRefs": [],
      "History": {
        "Overview": "Ferenginar’s modern identity is defined by the rise of the Ferengi Alliance and a society organized around profit, contracts, and commercial law. Across the 24th century, reforms and political shifts occur, but the planet remains the symbolic and operational center of Ferengi power.",
        "KeyEras": [
          {
            "Era": "Alliance consolidation",
            "Summary": "Political unification under Alliance leadership and codified commercial practice."
          },
          {
            "Era": "24th-century reform period",
            "Summary": "Social and legal changes amid shifting leadership and external pressures."
          }
        ],
        "MajorEvents": [
          {
            "When": "24th century",
            "Event": "Political leadership and legal reforms tied to Grand Nagus administrations affect trade norms and social policy."
          }
        ]
      },
      "Government": {
        "Polity": "Ferengi Alliance",
        "Capital": "Ferenginar (planetary capital functions concentrated in major commercial/government districts).",
        "Institutions": [
          "Grand Nagus",
          "Ferengi Commerce Authority",
          "Legal and financial boards overseeing contracts and commerce"
        ],
        "LawsAffectingVisitors": [
          "Strict contract enforcement",
          "Commercial regulations overseen by Ferengi authorities",
          "Visitors should retain verifiable contract records"
        ],
        "Notes": "Ferengi governance is closely tied to commercial authority and the legitimacy of financial/legal institutions."
      },
      "Economy": {
        "Overview": "Highly market-driven economy centered on trade, finance, extraction, and interstellar commerce.",
        "PrimaryIndustries": [
          "Interstellar trade and brokerage",
          "Finance and banking",
          "Manufacturing and logistics",
          "Legal services and contract arbitration"
        ],
        "TradeNotes": "Ferenginar is treated as a major node for deals, auctions, and political trade agreements.",
        "LocalCommerceNotes": "Negotiation culture is pervasive; prices and terms are often expected to be bargained rather than fixed."
      },
      "Culture": {
        "Overview": "Commerce-centered culture structured by the Rules of Acquisition and strong expectations around profit, negotiation, and status.",
        "SocialCustoms": "Haggling is normal; direct discussion of profit is socially acceptable. Visitors should learn basic Ferengi negotiation etiquette and avoid insulting offers.",
        "ReligiousLife": "Traditional Ferengi beliefs exist alongside pragmatic commercial priorities; religious practice is less emphasized than legal and cultural codes in many depictions.",
        "Festivals": "Celebrations often revolve around business success, family status, and Alliance leadership events.",
        "ArtsAndMedia": "Material status symbols, luxury goods, and commercial spectacle are common cultural markers.",
        "LanguageNotes": "Ferengi language and business jargon are common; Federation Standard is widely used for interstellar deals."
      },
      "Environment": {
        "Overview": "Wetland-dominant environment with persistent storm systems and heavy cloud cover.",
        "Seasons": "Less distinct seasons; storm frequency and intensity dominate the lived environment.",
        "NaturalHazards": [
          "Lightning storms",
          "Flooding",
          "Mold and humidity-related infrastructure challenges in exposed areas"
        ],
        "NightSky": "Cloud cover frequently obscures the night sky; clearer views are more likely during brief breaks in storm bands."
      },
      "DataQuality": {
        "Certainty": "High",
        "Notes": ""
      },
      "Appearances": {
        "Overview": "Appears chiefly in stories focused on Ferengi politics, commerce, and social change.",
        "BySeriesOrFilm": [
          {
            "Era": "TNG/DS9 era",
            "Highlights": [
              "Ferengi Alliance leadership, business intrigues, and cultural norms"
            ]
          },
          {
            "Era": "VOY era",
            "Highlights": [
              "Occasional Ferengi-related trade and cultural references"
            ]
          }
        ]
      }
    },
    {
      "PlanetID": "planet-risa",
      "Name": "Risa",
      "AlternateNames": [],
      "TypeTags": [
        "ResortWorld"
      ],
      "Media": {
        "HeroImageURL": "https://raw.githubusercontent.com/BigBird7827/Pla-Trek/main/Images/Risa.png",
        "Gallery": []
      },
      "Location": {
        "Quadrant": "Beta Quadrant",
        "QuadrantNotes": "Risa’s quadrant placement varies across cartography and reference works; recent star charts and summaries commonly place it in the Beta Quadrant.",
        "StarSystem": "Epsilon Ceti system",
        "Sector": "Risa sector (designation not consistently emphasized on-screen)",
        "Region": "Federation space",
        "Notes": "Risa is treated as a well-traveled Federation leisure destination, often reachable via routine starship travel."
      },
      "QuickFacts": {
        "Class": "Class M",
        "PrimaryInhabitants": [
          "Risians"
        ],
        "PrimaryLanguageNotes": [
          "Federation Standard is widely used in tourism districts; local language and customs remain prominent in cultural settings."
        ],
        "LocalTimekeeping": {
          "DayLengthHours": null,
          "TimeFormat": "Local standards; resort schedules and Starfleet visitors commonly operate on shipboard chronometers."
        }
      },
      "TravelSummary": "Risa is widely known as a resort world and a major leisure destination for Federation citizens and visitors. Its reputation rests on carefully managed climate stability, extensive hospitality infrastructure, and a culture that treats pleasure and relaxation as social goods.",
      "Appearance": "A bright ocean world with lush islands, pale coastlines, and frequent fair-weather cloud patterns. Large resort complexes and transit hubs are common in inhabited regions.",
      "Geography": "Island chains, warm shallow seas, beaches, and tropical interiors form the dominant geography. Built environments focus on open-air resorts, cultural plazas, and visitor-oriented waterfront districts.",
      "Inhabitants": "Risians, along with a large seasonal and permanent population tied to tourism and services. The planet hosts visitors from many Federation and non-Federation worlds.",
      "Weather": {
        "ClimateType": "Tropical maritime (highly regulated/controlled in inhabited resort zones)",
        "Seasonality": "Engineered stability is emphasized over natural seasonal swings in key tourist regions.",
        "TypicalConditions": "Warm temperatures, gentle winds, and frequent clear conditions; cloud cover tends to be light and scenic rather than storm-dominant.",
        "Hazards": [
          "Rare severe weather events can occur if climate controls fail or are disrupted",
          "Localized seismic risk is mitigated by planetary regulators"
        ],
        "TravelGear": [
          "Light breathable clothing plus one dry layer for sudden storms",
          "Sun protection (hat/visor, sunscreen)",
          "Waterproof pouch for comm devices",
          "Comfort footwear for long promenade walks"
        ],
        "Summary": "Tropical ‘paradise’ conditions are largely engineered: Risa’s weather control system is used to maintain consistently pleasant temperatures, breezes, and skies for visitors."
      },
      "Tourism": "Risa’s attractions include beaches, resorts, cultural festivals, and a social environment known for openness. Symbols such as the horga’hn are recognized locally as indicators of romantic interest; visitors should be aware of the cultural meaning to avoid misunderstandings.",
      "Logistics": "Risa is built around hospitality. Visitors should expect comprehensive services, from medical and security support to transport across resort districts. Local regulations focus on maintaining public safety and the planet’s controlled environment.",
      "CanonAppearances": {
        "FirstSeen": {
          "Series": "TNG",
          "EpisodeOrFilm": "Captain's Holiday",
          "YearInUniverse": null
        },
        "Key": [
          {
            "SeriesOrFilm": "TNG: Captain's Holiday",
            "Notes": ""
          },
          {
            "SeriesOrFilm": "DS9: Let He Who Is Without Sin...",
            "Notes": ""
          },
          {
            "SeriesOrFilm": "ENT: Two Days and Two Nights",
            "Notes": ""
          }
        ]
      },
      "Tags": [
        "Class M",
        "ConsentCulture",
        "Federation Space",
        "HighTourismDensity",
        "InfrastructureDependentWeather",
        "ParadiseByDesign",
        "Resort World",
        "Tropical"
      ],
      "CitiesAndSites": [
        {
          "Name": "Risan resort districts",
          "Type": "Tourist zone",
          "Description": "Coastal and island resort regions designed for long-term visitors, with extensive lodging and recreation."
        },
        {
          "Name": "Horga’hn cultural sites",
          "Type": "Cultural symbol",
          "Description": "Locations and displays where the horga’hn symbol is featured; understanding its meaning is part of visitor etiquette."
        }
      ],
      "PlaceRefs": {
        "Cities": [],
        "Regions": [],
        "Landmarks": [],
        "Settlements": [],
        "Moons": [],
        "OrbitalFacilities": []
      },
      "FeatureRefs": [],
      "OrganizationRefs": [],
      "History": {
        "Overview": "Risa’s modern prominence stems from its development into a major interstellar leisure destination, especially for Federation travelers. Its infrastructure and climate-regulation systems support large visitor volumes and consistent ‘paradise’ conditions.",
        "KeyEras": [
          {
            "Era": "Federation leisure destination era",
            "Summary": "Expansion of resort infrastructure and climate management to support interstellar tourism."
          }
        ],
        "MajorEvents": [
          {
            "When": "24th century",
            "Event": "Risa becomes a recurring setting for Federation recreation and diplomatic ‘informal’ meetings."
          }
        ]
      },
      "Government": {
        "Polity": "Risan local governance within Federation space (exact structures are not always foregrounded on-screen).",
        "Capital": "Not consistently specified on-screen; key civic functions are associated with major resort and administrative districts.",
        "Institutions": [
          "Local civic administration",
          "Hospitality and security services",
          "Planetary environmental control infrastructure"
        ],
        "LawsAffectingVisitors": [
          "Public-safety ordinances in high-tourism zones",
          "Regulations supporting climate and seismic stabilization systems"
        ],
        "Notes": "On-screen focus is typically on tourism culture; formal political institutions are less frequently named."
      },
      "Economy": {
        "Overview": "Tourism and hospitality-dominant economy supporting large-scale interstellar travel and resort operations.",
        "PrimaryIndustries": [
          "Hospitality and resorts",
          "Transport and visitor services",
          "Entertainment and recreation",
          "Environmental/climate control operations"
        ],
        "TradeNotes": "Risa’s ‘export’ is experience: lodging, leisure services, and venue hosting for interstellar visitors.",
        "LocalCommerceNotes": "Visitor-facing commerce is widespread, with services tailored to many species’ needs."
      },
      "Culture": {
        "Overview": "A leisure-forward culture emphasizing relaxation, personal freedom, and social openness; hospitality is treated as a civic priority.",
        "SocialCustoms": "Consent and social signaling are culturally important; visitors should learn common local symbols and avoid assumptions.",
        "ReligiousLife": "Religious life is not commonly emphasized in on-screen depictions of Risa.",
        "Festivals": "Frequent seasonal-style celebrations and themed events oriented toward visitors and local tradition.",
        "ArtsAndMedia": "Public art, performance, and recreation-oriented design are prominent in resort spaces.",
        "LanguageNotes": "Local language exists but Federation Standard is widely used given the volume of off-world visitors."
      },
      "Environment": {
        "Overview": "Tropical island and ocean ecosystems, with human/alien-made systems maintaining stable weather in key inhabited zones.",
        "Seasons": "Warm ocean-driven cycles; engineered stability often supersedes natural variation in tourist corridors.",
        "NaturalHazards": [
          "Environmental-control disruption risks",
          "Coastal storm surge if severe weather develops"
        ],
        "NightSky": "Clear skies are common in resort areas, making stargazing a frequent part of the visitor experience."
      },
      "DataQuality": {
        "Certainty": "High",
        "Notes": ""
      },
      "Appearances": {
        "Overview": "Appears primarily as a Federation leisure world and backdrop for interpersonal stories, diplomacy, and cultural misunderstandings.",
        "BySeriesOrFilm": [
          {
            "Era": "TNG era",
            "Highlights": [
              "Risa as a leisure destination and setting for character-focused stories"
            ]
          },
          {
            "Era": "DS9 era",
            "Highlights": [
              "Risa as a cultural touchpoint; occasional direct visits or references"
            ]
          }
        ]
      }
    },
    {
      "PlanetID": "planet-qonos",
      "Name": "Qo'noS",
      "AlternateNames": [
        "Kronos",
        "The Klingon Homeworld"
      ],
      "TypeTags": [
        "Homeworld",
        "CapitalWorld"
      ],
      "Media": {
        "HeroImageURL": "https://raw.githubusercontent.com/BigBird7827/Pla-Trek/main/Images/Qo'noS.png",
        "Gallery": []
      },
      "Location": {
        "Quadrant": "Beta Quadrant",
        "QuadrantNotes": "Sector label for Qo'noS is given in reference summaries and cartography; Klingon-space borders shift by era.",
        "StarSystem": "Qo'noS system",
        "Sector": "Sector 70",
        "Region": "Klingon Empire core territory",
        "Notes": "Qo’noS is repeatedly treated as the capital world of the Klingon Empire and a key strategic location near Federation space."
      },
      "QuickFacts": {
        "Class": "Class M",
        "PrimaryInhabitants": [
          "Klingons"
        ],
        "PrimaryLanguageNotes": [
          "Klingon (tlhIngan Hol) is dominant; Federation Standard is understood in diplomatic, trade, and offworlder-facing contexts."
        ],
        "LocalTimekeeping": {
          "DayLengthHours": null,
          "TimeFormat": "Local standards; visitors often rely on shipboard chronometers when coordinating with offworld schedules."
        }
      },
      "TravelSummary": "Qo’noS is the Klingon homeworld and political center of the Klingon Empire. It is characterized by strong martial traditions, ceremonial architecture, and high-security governance centered on the High Council.",
      "Appearance": "A dark, rugged world with broad landmasses, frequent cloud systems, and regions marked by harsh weather and heavy industry. Urban centers can appear dense and fortified, with monumental civic complexes.",
      "Geography": "Varied Class-M terrain including mountain ranges, rocky highlands, and temperate regions supporting large population centers. Industrial zones and fortified government districts are prominent in many depictions.",
      "Inhabitants": "Primarily Klingons; significant off-world presence tends to be diplomatic, military, or intelligence-related rather than recreational.",
      "Weather": {
        "ClimateType": "Temperate-to-variable (not consistently detailed on-screen)",
        "Seasonality": "Seasonal cycles are implied but not often the focus; weather can shift rapidly in some stories.",
        "TypicalConditions": "Frequent cloud cover and storms are commonly depicted; conditions vary by region and elevation.",
        "Hazards": [
          "Severe storms in some regions",
          "Security restrictions and civil unrest risks during political crises"
        ],
        "TravelGear": [
          "Layered clothing for variable temperatures",
          "Weather-sealed bag for comm devices",
          "Sturdy boots with good traction",
          "A formal outfit if attending civic events (as advised by your liaison)"
        ]
      },
      "Tourism": "Qo’noS is not typically portrayed as a leisure destination. Visitors usually arrive on official business: diplomacy, legal proceedings, or inter-empire negotiations.",
      "Logistics": "Expect stringent security, inspections, and escort requirements. Cultural protocol matters: formal address, respect for Klingon tradition, and careful behavior around political institutions.",
      "CanonAppearances": {
        "FirstSeen": {
          "Series": "TNG",
          "EpisodeOrFilm": "Sins of the Father",
          "YearInUniverse": null
        },
        "Key": [
          {
            "SeriesOrFilm": "TNG: Sins of the Father",
            "Notes": ""
          },
          {
            "SeriesOrFilm": "TNG: Redemption / Redemption II",
            "Notes": ""
          },
          {
            "SeriesOrFilm": "Star Trek VI: The Undiscovered Country (Praxis disaster context)",
            "Notes": ""
          }
        ]
      },
      "Tags": [
        "Beta Quadrant",
        "Capital World",
        "CeremonyHeavy",
        "Class M",
        "HighSecurity",
        "HonorCulture",
        "Klingon Homeworld",
        "PoliticalFlashpoint",
        "VolcanicGeology"
      ],
      "CitiesAndSites": [
        {
          "Name": "First City",
          "Type": "Capital city",
          "Description": "The political heart of the Klingon Empire and the location associated with major government and ceremonial structures."
        },
        {
          "Name": "Great Hall / High Council complex",
          "Type": "Government complex",
          "Description": "A monumental complex tied to the Klingon High Council and chancellorship, central to imperial decision-making."
        },
        {
          "Name": "Klingon High Council Chamber",
          "Type": "Government chamber",
          "Description": "Key venue for Klingon political proceedings, including leadership disputes and major imperial decisions."
        }
      ],
      "PlaceRefs": {
        "Cities": [],
        "Regions": [],
        "Landmarks": [],
        "Settlements": [],
        "Moons": [],
        "OrbitalFacilities": []
      },
      "FeatureRefs": [],
      "OrganizationRefs": [],
      "History": {
        "Overview": "Qo’noS is central to the Klingon Empire’s political and cultural identity. Its modern history is marked by recurring leadership crises, shifting alliances with the Federation, and major events such as the ecological and political fallout tied to the Praxis disaster.",
        "KeyEras": [
          {
            "Era": "Praxis aftermath era",
            "Summary": "Political and environmental consequences ripple through Klingon society after the Praxis catastrophe."
          },
          {
            "Era": "24th-century High Council instability",
            "Summary": "Repeated chancellorship disputes and internal power struggles affect imperial policy."
          }
        ],
        "MajorEvents": [
          {
            "When": "2293",
            "Event": "Praxis explosion triggers major political pressures and drives treaty negotiations affecting the Empire."
          },
          {
            "When": "2360s–2370s",
            "Event": "High Council leadership crises and shifting alliances repeatedly bring Federation and Klingon representatives to Qo’noS."
          }
        ]
      },
      "Government": {
        "Polity": "Klingon Empire",
        "Capital": "First City (Qo’noS)",
        "Institutions": [
          "Klingon High Council",
          "Chancellor and Great Hall administration",
          "Imperial military and intelligence services"
        ],
        "LawsAffectingVisitors": [
          "Restricted access to government districts",
          "Strict weapons and security controls for visitors",
          "Behavioral expectations under Klingon honor codes"
        ],
        "Notes": "Klingon politics can change rapidly; access and safety conditions vary with the internal situation of the High Council."
      },
      "Economy": {
        "Overview": "Imperial economy shaped by military capacity, shipbuilding, and strategic resources; civilian life is strongly influenced by political and house structures.",
        "PrimaryIndustries": [
          "Military and shipbuilding",
          "Heavy industry",
          "Administration and logistics",
          "House-based economic networks"
        ],
        "TradeNotes": "External trade exists but is filtered through imperial policy and house interests; diplomacy can affect market access.",
        "LocalCommerceNotes": "Visitors typically interact through official channels rather than open consumer markets."
      },
      "Culture": {
        "Overview": "Martial honor culture with strong traditions of ritual, house loyalty, and public ceremony; political life is inseparable from cultural identity.",
        "SocialCustoms": "Formal respect in speech and posture matters; misunderstandings can escalate quickly. Visitors should avoid insults and recognize ritual contexts.",
        "ReligiousLife": "Spiritual and mythic traditions exist, though political/house ritual often dominates public ceremony in depictions.",
        "Festivals": "Ceremonial gatherings, succession rites, and commemorations tied to houses and the Empire are central.",
        "ArtsAndMedia": "Song, opera, and martial arts traditions are culturally significant; architecture favors monumental and fortress-like forms.",
        "LanguageNotes": "Klingon language is prevalent; Federation Standard is used in diplomatic contexts but not assumed in all settings."
      },
      "Environment": {
        "Overview": "Inhabited Class-M world with industrial and urban concentration in key regions; environmental conditions are not consistently detailed but storms and rugged terrain recur visually.",
        "Seasons": "Implied seasonal cycles; regional variability likely.",
        "NaturalHazards": [
          "Storm systems",
          "Industrial pollution in some zones",
          "Political unrest risks during transitions"
        ],
        "NightSky": "Urban centers can be brightly lit; elsewhere, cloud cover can limit visibility."
      },
      "DataQuality": {
        "Certainty": "High",
        "Notes": ""
      },
      "Appearances": {
        "Overview": "Appears most often as the Klingon seat of power during diplomatic crises and leadership disputes.",
        "BySeriesOrFilm": [
          {
            "Era": "TNG era",
            "Highlights": [
              "High Council politics and succession disputes"
            ]
          },
          {
            "Era": "DS9 era",
            "Highlights": [
              "Klingon–Federation tensions and internal politics"
            ]
          },
          {
            "Era": "Films era",
            "Highlights": [
              "Praxis aftermath and treaty-era political pressures"
            ]
          }
        ]
      }
    },
    {
      "PlanetID": "planet-andoria",
      "Name": "Andoria",
      "AlternateNames": [
        "Andor"
      ],
      "TypeTags": [
        "Homeworld",
        "IceWorld"
      ],
      "Media": {
        "HeroImageURL": "https://raw.githubusercontent.com/BigBird7827/Pla-Trek/main/Images/Andoria.png",
        "Gallery": []
      },
      "Location": {
        "Quadrant": "Beta Quadrant",
        "QuadrantNotes": "Andoria (also known as Andor) is the Andorian homeworld and a core Federation member world in later eras.",
        "StarSystem": "Andorian system (Procyon system association)",
        "Sector": "Sector 006 (Andorian sector)",
        "Region": "Federation space / Andorian territory",
        "DistanceFromSol_LY": 11,
        "Notes": "Reference materials commonly associate Andoria with the Procyon system; it is often described as a moon (also called Andor in some sources)."
      },
      "QuickFacts": {
        "Class": "Class M",
        "PrimaryInhabitants": [
          "Andorians",
          "Aenar"
        ],
        "PrimaryLanguageNotes": [
          "Andorian is common in domestic settings; Federation Standard is widely used in government, trade, and offworlder-facing contexts."
        ],
        "LocalTimekeeping": {
          "DayLengthHours": null,
          "TimeFormat": "Local standards; visitors commonly coordinate via shipboard chronometers for tours and transport windows."
        }
      },
      "TravelSummary": "Andoria is the Andorian homeworld and a key founding world associated with early Federation history. It is depicted as an icy, high-latitude world (often treated as a moon in its system) with major population centers adapted to extreme cold.",
      "Appearance": "A pale blue-white world dominated by ice sheets, frozen seas, and glacial terrain. Cloud cover can be thin and crisp, with polar haze and occasional auroral activity.",
      "Geography": "Extensive polar ice caps and broad frozen surfaces with rugged mountain ridges. Many settlements are portrayed as protected or subterranean, minimizing exposure to surface extremes.",
      "Inhabitants": "Primarily Andorians (including Aenar populations in some depictions). Off-world traffic is common for diplomacy and Starfleet-era cooperation, but harsh conditions limit casual visitation.",
      "Weather": {
        "ClimateType": "Polar / subpolar (ice world)",
        "Seasonality": "Long cold seasons; limited thaw in some sheltered or lower-latitude zones depending on region.",
        "TypicalConditions": "Very low temperatures, dry cold air, and frequent ice fog; blizzards can develop rapidly over open ice.",
        "Hazards": [
          "Blizzards and whiteout conditions",
          "Extreme cold exposure",
          "Crevasse and ice-shelf instability in some regions"
        ],
        "TravelGear": [
          "Thermal layers with windproof outer shell",
          "Insulated boots with high-traction soles",
          "Eye protection for blowing snow",
          "Weather-sealed pouch for comm devices",
          "Emergency heat packs for excursions"
        ]
      },
      "Tourism": "Visits are typically cultural, diplomatic, or scientific rather than leisure-oriented. The planet offers unique polar landscapes and Andorian cultural sites, but travel conditions require preparation.",
      "Logistics": "Thermal protection is mandatory for surface travel. Many destinations are accessed via enclosed transport networks or subterranean complexes; visitors should coordinate with local authorities.",
      "CanonAppearances": {
        "FirstSeen": {
          "Series": "ENT",
          "EpisodeOrFilm": "The Andorian Incident",
          "YearInUniverse": null
        },
        "Key": [
          {
            "SeriesOrFilm": "ENT: The Andorian Incident",
            "Notes": ""
          },
          {
            "SeriesOrFilm": "ENT: United",
            "Notes": ""
          }
        ]
      },
      "Tags": [
        "Andorian Homeworld",
        "Beta Quadrant",
        "Founding World",
        "FoundingWorld",
        "GuidedExcursionsRecommended",
        "Ice World",
        "IceWorld",
        "PermitSensitiveAreas",
        "SevereWeather"
      ],
      "PlaceRefs": {
        "Cities": [],
        "Regions": [],
        "Landmarks": [],
        "Settlements": [],
        "Moons": [],
        "OrbitalFacilities": []
      },
      "FeatureRefs": [],
      "OrganizationRefs": [],
      "History": {
        "Overview": "Andoria plays a prominent role in early interstellar politics and is repeatedly associated with the coalition efforts that precede Federation founding. Its strategic location and Andorian influence make it a recurring diplomatic touchpoint.",
        "KeyEras": [
          {
            "Era": "Coalition and pre-Federation diplomacy",
            "Summary": "Andoria is central to early alliances and disputes that shape interstellar governance."
          },
          {
            "Era": "Federation era",
            "Summary": "Andoria remains a key member world with strong Starfleet and diplomatic ties."
          }
        ],
        "MajorEvents": [
          {
            "When": "22nd century",
            "Event": "Andorian political and security events contribute to the formation of early interstellar coalitions."
          },
          {
            "When": "2161",
            "Event": "Andoria is associated with the founding era of the United Federation of Planets."
          }
        ]
      },
      "Government": {
        "Polity": "Andorian planetary governance within Federation framework (Federation era); earlier independent institutions in pre-Federation period.",
        "Capital": "Laikan (per licensed reference works); on-screen depictions emphasize Andoria as a major polity rather than naming a capital repeatedly.",
        "Institutions": [
          "Andorian governmental councils (various eras)",
          "Security and defense institutions",
          "Diplomatic missions and Federation-era administration"
        ],
        "LawsAffectingVisitors": [
          "Environmental safety controls in protected habitats",
          "Permits may apply for travel to restricted facilities"
        ],
        "Notes": "Andoria’s political structure shifts across eras; on-screen focus is often on diplomacy and security rather than civic detail."
      },
      "Economy": {
        "Overview": "Mixed economy shaped by extreme-environment infrastructure, defense, and interstellar diplomacy; specialized cold-environment engineering is implied by settlement patterns.",
        "PrimaryIndustries": [
          "Habitat and infrastructure engineering",
          "Defense and security services",
          "Scientific research (cryosphere and atmospheric studies)"
        ],
        "TradeNotes": "Interstellar engagement is frequently tied to diplomacy and strategic cooperation.",
        "LocalCommerceNotes": "Visitor services are concentrated in protected hubs due to climate constraints."
      },
      "Culture": {
        "Overview": "Proud, tradition-rich society with strong emphasis on honor, duty, and community; cultural practices vary between Andorian groups and eras.",
        "SocialCustoms": "Visitors should be attentive to formality and interpersonal boundaries; local protocols may be stricter in military or governmental settings.",
        "ReligiousLife": "Spiritual practices exist but are not consistently foregrounded in on-screen depictions of Andoria.",
        "Festivals": "Seasonal and civic observances are likely shaped by extreme climate cycles and community cohesion.",
        "ArtsAndMedia": "Cultural expression is present but not heavily detailed on-screen; ceremonial and diplomatic traditions are emphasized.",
        "LanguageNotes": "Andorian languages and dialects are used locally; Federation Standard is common in interstellar contexts."
      },
      "Environment": {
        "Overview": "Cryosphere-dominant world with extensive ice cover and cold-adapted ecosystems; human/Andorian infrastructure concentrates in protected regions.",
        "Seasons": "Long winter-like periods dominate; polar phenomena are common.",
        "NaturalHazards": [
          "Ice storms",
          "Surface travel risk over glaciers and sea ice"
        ],
        "NightSky": "Clear polar air can offer excellent visibility during calm periods; auroral activity may be visible at high latitudes."
      },
      "DataQuality": {
        "Certainty": "High",
        "Notes": ""
      },
      "Appearances": {
        "Overview": "Appears most prominently in early Federation-era narratives and in stories involving Andorian politics and diplomacy.",
        "BySeriesOrFilm": [
          {
            "Era": "ENT era",
            "Highlights": [
              "Andorian–Vulcan tensions, coalition politics, and Andorian security affairs"
            ]
          },
          {
            "Era": "Later eras",
            "Highlights": [
              "References to Andoria as a founding world and Federation member"
            ]
          }
        ]
      },
      "CitiesAndSites": [
        {
          "Name": "Laikan",
          "Type": "Capital city (reference works)",
          "Description": "A capital city name associated with Andoria in licensed reference material; major civic functions are implied."
        },
        {
          "Name": "Underground habitat complexes",
          "Type": "Settlement type",
          "Description": "Protected cities and facilities adapted to extreme cold, often described as built below the ice or within insulated structures."
        }
      ]
    },
    {
      "PlanetID": "planet-bajor",
      "Name": "Bajor",
      "AlternateNames": [
        "Bajora"
      ],
      "TypeTags": [
        "Homeworld"
      ],
      "Media": {
        "HeroImageURL": "https://raw.githubusercontent.com/BigBird7827/Pla-Trek/main/Images/Bajor.png",
        "Gallery": []
      },
      "Location": {
        "Quadrant": "Alpha Quadrant",
        "QuadrantNotes": "Bajor is explicitly placed in the Bajor sector of the Alpha Quadrant in reference summaries.",
        "StarSystem": "Bajoran system",
        "Sector": "Bajor sector",
        "Region": "Near Cardassian space / Federation-Cardassian frontier region",
        "Notes": "Bajor’s system includes the Denorios Belt, where the stable Bajoran wormhole’s Alpha Quadrant terminus is located; the Cardassian system is nearby by interstellar standards."
      },
      "QuickFacts": {
        "Class": "Class M",
        "PrimaryInhabitants": [
          "Bajorans"
        ],
        "PrimaryLanguageNotes": [
          "Bajoran is common in domestic settings; Federation Standard is widely used in government, trade, and offworld-facing contexts."
        ],
        "LocalTimekeeping": {
          "DayLengthHours": null,
          "TimeFormat": "Local standards; visitors often coordinate with Deep Space 9 schedules and shipboard chronometers."
        },
        "Moons": [
          "Derna",
          "Jeraddo"
        ]
      },
      "TravelSummary": "Bajor is the Bajoran homeworld in the Alpha Quadrant, known for its natural beauty and deep spiritual traditions. In the late 24th century it becomes strategically vital due to the nearby Bajoran wormhole and undergoes rapid political recovery after Cardassian occupation.",
      "Appearance": "A lush Class-M world with blue oceans, green landmasses, and active cloud systems. From orbit, the planet often appears temperate and fertile, with pronounced coastal and river features.",
      "Geography": "Diverse landscapes including river valleys, forests, mountain ranges, and coastal plains. Several regions and landmarks are repeatedly referenced, including major valleys, passes, canyons, and spiritual sites.",
      "Inhabitants": "Primarily Bajorans. The planet hosts Federation and other off-world visitors, especially during the era of Deep Space 9 and regional diplomacy.",
      "Weather": {
        "ClimateType": "Temperate-to-varied (fertile Class-M)",
        "Seasonality": "Seasonal cycles across multiple climatic zones; weather varies by province, elevation, and latitude.",
        "TypicalConditions": "Mild-to-warm conditions in many populated regions, with rain systems supporting agriculture; mountain zones can be colder and windier.",
        "Hazards": [
          "Seasonal storms and flooding in river valleys",
          "Mountain weather and sudden fog in passes",
          "Localized hazards near cave systems and rugged canyons"
        ],
        "TravelGear": [
          "Light layers for warm valleys and cool ridges",
          "Rain shell or compact poncho during wet seasons",
          "Comfort footwear for pilgrimage routes and stone stairs",
          "A respectful outfit for monastery visits (as advised locally)"
        ]
      },
      "Tourism": "Bajor offers both natural and cultural destinations: scenic valleys, historic cities, and numerous religious shrines and pilgrimage sites. Respectful behavior at spiritual locations is essential.",
      "Logistics": "Travel infrastructure expands significantly during the DS9 era. Visitors should monitor political advisories during periods of regional tension and follow local guidance around sensitive religious or security sites.",
      "CanonAppearances": {
        "FirstSeen": {
          "Series": "DS9",
          "EpisodeOrFilm": "Emissary",
          "YearInUniverse": null
        },
        "Key": [
          {
            "SeriesOrFilm": "DS9: Emissary",
            "Notes": ""
          },
          {
            "SeriesOrFilm": "DS9: What You Leave Behind (Fire Caves)",
            "Notes": ""
          }
        ]
      },
      "Tags": [
        "Alpha Quadrant",
        "ArchaeologyHeavy",
        "Bajoran Homeworld",
        "Class M",
        "PermitSensitiveSites",
        "PilgrimageFriendly",
        "PostOccupationContext",
        "RespectfulTourism",
        "Wormhole Region"
      ],
      "CitiesAndSites": [
        {
          "Name": "Bajor (city)",
          "Type": "City",
          "Description": "A major population center referenced as an important urban hub on the planet."
        },
        {
          "Name": "Kendra Valley",
          "Type": "Valley / region",
          "Description": "A well-known geographic region frequently referenced in DS9-era Bajoran contexts."
        },
        {
          "Name": "Fire Caves",
          "Type": "Cave system / spiritual site",
          "Description": "A significant subterranean site tied to Bajoran spiritual mythology and major historical events."
        },
        {
          "Name": "Denorios Belt (system landmark)",
          "Type": "Plasma field / system region",
          "Description": "A charged plasma field in the Bajoran system associated with the stable wormhole’s Alpha Quadrant terminus."
        }
      ],
      "PlaceRefs": {
        "Cities": [],
        "Regions": [],
        "Landmarks": [],
        "Settlements": [],
        "Moons": [],
        "OrbitalFacilities": []
      },
      "FeatureRefs": [],
      "OrganizationRefs": [],
      "History": {
        "Overview": "Bajor’s recent history is defined by the Cardassian occupation and the planet’s subsequent recovery, political restructuring, and renewed cultural self-determination. The discovery of the stable wormhole in the Denorios Belt transforms Bajor into a focal point for regional powers and interstellar diplomacy.",
        "KeyEras": [
          {
            "Era": "Cardassian occupation era",
            "Summary": "Foreign rule, resistance movements, and significant cultural trauma."
          },
          {
            "Era": "Post-occupation recovery",
            "Summary": "Rebuilding institutions, navigating internal politics, and managing heightened strategic attention."
          },
          {
            "Era": "Wormhole strategic era",
            "Summary": "Deep Space 9 and the wormhole make Bajor central to Alpha Quadrant events."
          }
        ],
        "MajorEvents": [
          {
            "When": "Mid-to-late 24th century",
            "Event": "End of Cardassian occupation and establishment of a new Bajoran government."
          },
          {
            "When": "2369",
            "Event": "Discovery of the stable Bajoran wormhole in the Denorios Belt and establishment of DS9 as a strategic station."
          },
          {
            "When": "Dominion War era",
            "Event": "Bajor’s status and security become deeply intertwined with broader wartime strategy."
          }
        ]
      },
      "Government": {
        "Polity": "Bajoran government (post-occupation provisional structures evolving toward stable institutions); interacts closely with Federation authorities during DS9 era.",
        "Capital": "Bajor (city) is commonly treated as a principal urban and governmental center in references; specific ‘capital’ naming varies by context.",
        "Institutions": [
          "Bajoran political leadership bodies (provisional and later structures)",
          "Religious institutions and Vedek Assembly (spiritual authority)",
          "Security and resistance legacy organizations"
        ],
        "LawsAffectingVisitors": [
          "Respect for religious sites and ceremonies",
          "Security restrictions during periods of unrest or wartime readiness"
        ],
        "Notes": "Bajor’s political and religious institutions are tightly linked in many depictions, and public life is shaped by both governance and faith."
      },
      "Economy": {
        "Overview": "Recovering and rebuilding economy with strong agricultural, cultural, and service components; interstellar trade increases significantly due to the wormhole and DS9.",
        "PrimaryIndustries": [
          "Agriculture",
          "Local manufacturing and rebuilding",
          "Tourism and cultural pilgrimage services",
          "Interstellar commerce tied to DS9 and regional trade"
        ],
        "TradeNotes": "Bajor’s strategic position increases trade flow; political stability strongly affects commercial activity.",
        "LocalCommerceNotes": "Visitors often encounter both traditional local markets and newer off-world-oriented services near major transit hubs."
      },
      "Culture": {
        "Overview": "Deeply spiritual culture with strong traditions, festivals, and a prominent religious hierarchy; communal identity is strongly shaped by recent history and resistance.",
        "SocialCustoms": "Visitors should observe shrine etiquette, seek permission before participating in ceremonies, and be sensitive to occupation-era history.",
        "ReligiousLife": "Bajoran faith is central, with pilgrimages, temples, and clerical leadership (Vedeks and Kai) influencing social and political life.",
        "Festivals": "Numerous holy days and community celebrations; some observances are tied to the Prophets and major historical milestones.",
        "ArtsAndMedia": "Bajoran art, music, and craft traditions are frequently referenced as culturally significant and historically rich.",
        "LanguageNotes": "Bajoran language is common locally; Federation Standard is widely used in interstellar-facing areas."
      },
      "Environment": {
        "Overview": "Fertile Class-M environment supporting diverse ecosystems; many regions are considered scenic and culturally important.",
        "Seasons": "Regional seasons vary; river valleys and coastal zones support agriculture through regular precipitation cycles.",
        "NaturalHazards": [
          "Storms and flooding",
          "Cave and canyon hazards",
          "Occasional seismic activity"
        ],
        "NightSky": "Skies can be clear outside storm periods; orbital activity is elevated during DS9 era due to station traffic."
      },
      "DataQuality": {
        "Certainty": "High",
        "Notes": ""
      },
      "Appearances": {
        "Overview": "Extensively featured in DS9 as a political, cultural, and spiritual focal point, with recurring references in related eras.",
        "BySeriesOrFilm": [
          {
            "Era": "DS9 era",
            "Highlights": [
              "Post-occupation recovery, religion, politics, and wormhole-era strategic events"
            ]
          },
          {
            "Era": "TNG/VOY era",
            "Highlights": [
              "References to Bajor’s status and regional power dynamics"
            ]
          }
        ]
      }
    },
    {
      "PlanetID": "planet-cardassia-prime",
      "Name": "Cardassia Prime",
      "AlternateNames": [
        "Cardassia"
      ],
      "TypeTags": [
        "Homeworld",
        "CapitalWorld"
      ],
      "Media": {
        "HeroImageURL": "https://raw.githubusercontent.com/BigBird7827/Pla-Trek/main/Images/Cardassia%20Prime.jpg",
        "Gallery": []
      },
      "Location": {
        "Quadrant": "Alpha Quadrant",
        "QuadrantNotes": "Cardassia Prime is placed in Cardassian space in the Alpha Quadrant; sector naming is not consistently provided in primary canon.",
        "StarSystem": "Cardassian system",
        "Sector": "Cardassian space (Cardassia system)",
        "Region": "Cardassian Union core territory",
        "Nearby": [
          "~5 light years from Bajor (system distance reference)"
        ],
        "Notes": "The Cardassian system is located inside Cardassian space in the Alpha Quadrant and is relatively close to the Bajoran system by interstellar standards."
      },
      "QuickFacts": {
        "Class": "Class M",
        "PrimaryInhabitants": [
          "Cardassians"
        ],
        "PrimaryLanguageNotes": [
          "Cardassian is dominant; Federation Standard is used in diplomatic and offworld-facing contexts."
        ],
        "LocalTimekeeping": {
          "DayLengthHours": null,
          "TimeFormat": "Local standards; visiting schedules are often coordinated through official itineraries and security checkpoints."
        }
      },
      "TravelSummary": "Cardassia Prime is the Cardassian homeworld and capital world of the Cardassian Union. It is a major political and military center, with large cities and strong security institutions; visitor access is shaped by state control and changing regimes.",
      "Appearance": "A warm-toned world with broad arid regions, dusty basins, and rocky highlands. Urban areas can appear dense and heavily monitored, especially during periods of authoritarian rule.",
      "Geography": "Class-M terrain with extensive dry zones and rugged landforms. Major cities and administrative complexes dominate inhabited regions, and large-scale infrastructure is common.",
      "Inhabitants": "Primarily Cardassians. Off-world presence is most often diplomatic, military, or intelligence-related rather than recreational.",
      "Weather": {
        "ClimateType": "Warm arid / semi-arid (not consistently specified on-screen)",
        "Seasonality": "Seasonal cycles are implied; heat and dry conditions are frequently suggested in visual tone.",
        "TypicalConditions": "Dusty, warm conditions in many regions; local variability around coasts and urban basins.",
        "Hazards": [
          "Heat and dust exposure in arid zones",
          "Political instability and security crackdowns during regime shifts",
          "Restricted travel during wartime conditions"
        ],
        "TravelGear": [
          "Light, breathable clothing plus a sun-shielding outer layer",
          "Sealed eyewear for dust",
          "Hydration kit",
          "Weather-sealed pouch for comm devices"
        ]
      },
      "Tourism": "Cardassia Prime is not commonly portrayed as a leisure destination. Visits are typically official: diplomacy, negotiation, or authorized travel under Cardassian law.",
      "Logistics": "Expect strict entry controls, surveillance, and limited access outside designated areas. Visitor movement can be subject to permits, escorts, and rapidly changing security rules.",
      "CanonAppearances": {
        "FirstSeen": {
          "Series": "DS9",
          "EpisodeOrFilm": "What You Leave Behind",
          "YearInUniverse": null
        },
        "Key": [
          {
            "SeriesOrFilm": "DS9: What You Leave Behind",
            "Notes": ""
          }
        ]
      },
      "Tags": [
        "Alpha Quadrant",
        "AridConditions",
        "Capital World",
        "Cardassian Homeworld",
        "Class M",
        "HighSecurity",
        "MonumentalArchitecture",
        "PermitSensitiveTravel",
        "PostWarContext"
      ],
      "CitiesAndSites": [
        {
          "Name": "Lakarian City",
          "Type": "Major city",
          "Description": "A prominent city on Cardassia Prime referenced for civic life and as a site of major wartime events."
        },
        {
          "Name": "Central Command complexes",
          "Type": "Military/government institutions",
          "Description": "Facilities associated with Cardassian military authority and high-level governance during many eras."
        },
        {
          "Name": "Detapa Council government districts",
          "Type": "Civil government",
          "Description": "Civic districts tied to Cardassian civilian governance, which sometimes competes with military authority."
        }
      ],
      "PlaceRefs": {
        "Cities": [],
        "Regions": [],
        "Landmarks": [],
        "Settlements": [],
        "Moons": [],
        "OrbitalFacilities": []
      },
      "FeatureRefs": [],
      "OrganizationRefs": [],
      "History": {
        "Overview": "Cardassia Prime anchors Cardassian political power and the institutions of the Cardassian Union. Its modern era includes militarization, occupation policies in neighboring regions, and the catastrophic devastation of the Dominion War, during which major cities suffer severe damage.",
        "KeyEras": [
          {
            "Era": "Militarization and expansion era",
            "Summary": "Central Command and security institutions dominate policy, shaping Cardassia’s external posture."
          },
          {
            "Era": "Dominion War devastation era",
            "Summary": "Alliance shifts and wartime occupation lead to major destruction across Cardassian territory and cities."
          }
        ],
        "MajorEvents": [
          {
            "When": "24th century",
            "Event": "Cardassian occupation policies and frontier conflicts shape regional politics."
          },
          {
            "When": "2370s",
            "Event": "Dominion War culminates in major destruction on Cardassia Prime and political collapse of the Dominion puppet regime."
          }
        ]
      },
      "Government": {
        "Polity": "Cardassian Union (structure varies by era between civilian Detapa Council and military Central Command; intelligence influence via the Obsidian Order).",
        "Capital": "Cardassia Prime",
        "Institutions": [
          "Detapa Council (civilian government)",
          "Central Command (military authority)",
          "Obsidian Order (intelligence service)"
        ],
        "LawsAffectingVisitors": [
          "Strict internal security and surveillance in many eras",
          "Permits/escorts for off-world visitors",
          "Rapidly changing regulations during crises"
        ],
        "Notes": "Power balance between civilian and military authorities can shift; visitor experience varies sharply by political period."
      },
      "Economy": {
        "Overview": "State-influenced economy oriented around administration, security, and heavy industry, with significant resources directed toward military capacity in many eras.",
        "PrimaryIndustries": [
          "Government administration",
          "Military and security services",
          "Heavy industry and manufacturing",
          "Infrastructure and logistics"
        ],
        "TradeNotes": "External trade depends on diplomatic status; wartime conditions can sharply restrict commerce.",
        "LocalCommerceNotes": "Public life and commerce can be tightly controlled; visitors should expect regulated markets and monitored transactions."
      },
      "Culture": {
        "Overview": "Hierarchical society emphasizing order, duty, and state legitimacy; public culture is shaped by institutions and strong social expectations.",
        "SocialCustoms": "Formality and respect for authority are important. Visitors should avoid public criticism of institutions and comply with local security directives.",
        "ReligiousLife": "Religious life is not consistently foregrounded in on-screen depictions, though cultural identity and tradition are strongly emphasized.",
        "Festivals": "Civic ceremonies and state occasions are prominent; cultural events may be used to signal political legitimacy.",
        "ArtsAndMedia": "Cardassian literature, art, and music are referenced as rich and historic, with significant losses during late-war devastation.",
        "LanguageNotes": "Cardassian language is used locally; Federation Standard is common in diplomatic settings but not assumed in all regions."
      },
      "Environment": {
        "Overview": "Warm-toned environment with extensive arid zones; urban and industrial concentrations are significant in key regions.",
        "Seasons": "Implied seasonal variability; dry seasons likely dominate in many regions.",
        "NaturalHazards": [
          "Dust storms",
          "Urban pollution in industrial zones",
          "Post-war infrastructure damage in the late 24th century"
        ],
        "NightSky": "Urban light pollution can be significant around major cities; clearer skies likely away from industrial centers."
      },
      "DataQuality": {
        "Certainty": "High",
        "Notes": ""
      },
      "Appearances": {
        "Overview": "Featured heavily in DS9-era political and wartime narratives as the center of Cardassian power and later devastation.",
        "BySeriesOrFilm": [
          {
            "Era": "TNG era",
            "Highlights": [
              "Cardassian power and frontier conflicts; Cardassia referenced as an imperial center"
            ]
          },
          {
            "Era": "DS9 era",
            "Highlights": [
              "Occupation legacy, internal politics, and Dominion War climax impacting Cardassia Prime"
            ]
          }
        ]
      }
    }
  ],
  "Places": [],
  "Features": [],
  "Organizations": []
}
