{
  "PlanetID": "planet-earth",
  "Name": "Earth",
  "AlternateNames": [
    "Sol III",
    "Terra"
  ],
  "Tags": [
    "Homeworld",
    "Federation core world",
    "Starfleet Headquarters",
    "Federation governance hub"
  ],
  "TypeTags": [
    "Homeworld",
    "FederationCapital",
    "StarfleetHQ"
  ],
  "Meta": {
    "CanonicalName": "Earth",
    "Classification": "Inhabited Class M terrestrial planet (Sol III/Terra) in the Sol system; one natural satellite (Luna)",
    "Affiliation": "United Federation of Planets (founding world; Federation founded on Earth in 2161); Earth’s unified planetary authority is known as United Earth (22nd century onward)",
    "NativeSpecies": [
      "Human"
    ]
  },
  "Media": {
    "HeroImageURL": "https://raw.githubusercontent.com/BigBird7827/Pla-Trek/main/Images/Earth.png"
  },
  "TravelSummary": "Earth—also known as Sol III or Terra—is Humanity’s homeworld, located in the Sol system within Sector 001. Across Starfleet history it functions as a cultural homeworld and an administrative center, strongly associated with Starfleet Headquarters and Starfleet Academy in the San Francisco Bay / Presidio area, and with the Federation President’s office in Paris.\n\nEarth’s on-screen modern history includes major turning points: the Bell Riots in San Francisco’s Sanctuary District A in September 2024; the end of World War III in 2053 and the ensuing “post-atomic horror”; the Phoenix warp flight and First Contact with Vulcans on April 5, 2063 near Bozeman, Montana; the unification of the planet under United Earth in the 22nd century; and the founding of the United Federation of Planets on Earth (San Francisco) in 2161.\n\nIn the 23rd–24th centuries, Earth is repeatedly treated as strategically pivotal and is directly impacted by major crises, including the Whale Probe incident (2286), the Battle of Sector 001 during a Borg attempt to assimilate Earth (2373), and a Breen raid that struck Starfleet Headquarters and San Francisco in late 2375.",
  "Location": {
    "Quadrant": "Alpha Quadrant",
    "Sector": "Sector 001 (Sol sector / Terran sector)",
    "StarSystem": "Sol system (Terran system)",
    "Region": "Federation core",
    "NearbyLandmarks": [
      "Luna",
      "Earth orbit",
      "San Francisco Bay / Presidio (Starfleet campus area)"
    ]
  },
  "Appearance": "A blue-and-white globe with extensive oceans and dynamic cloud systems. Starfleet-era depictions often emphasize Earth’s limb with orbital traffic or installations, and the Golden Gate / San Francisco waterfront frequently serves as an iconic ground-level establishing view.",
  "Geography": "A water-rich, multi-continent Class M world with broad regional diversity (oceans, mountain ranges, deserts, forests, polar regions, and extensive urban development). Canon depictions frequently establish the San Francisco Bay / Golden Gate region as a major Starfleet landmark area, while other stories highlight sites such as Paris, Bozeman (Montana), and New Orleans.",
  "CitiesAndSites": [
    {
      "Name": "San Francisco Bay / Presidio (Starfleet campus area)",
      "Type": "Administrative / Academy",
      "Description": "Associated with Starfleet Headquarters and Starfleet Academy; repeatedly used as a visual and narrative anchor for Starfleet and Federation operations."
    },
    {
      "Name": "Paris, France",
      "Type": "Government / Diplomatic",
      "Description": "Associated with the office of the Federation President in some eras; referenced as a key Federation executive location on Earth."
    },
    {
      "Name": "Bozeman, Montana",
      "Type": "Historic site",
      "Description": "Associated with Zefram Cochrane’s Phoenix and the first open Human–Vulcan contact on April 5, 2063."
    },
    {
      "Name": "Sanctuary District A (San Francisco)",
      "Type": "Historic district",
      "Description": "Walled district central to the Bell Riots of September 2024."
    },
    {
      "Name": "New Orleans, Louisiana",
      "Type": "Cultural / Residential",
      "Description": "Joseph Sisko’s restaurant and the Sisko family’s home base; an Earthside setting during the Dominion War period."
    },
    {
      "Name": "Luna",
      "Type": "Natural satellite",
      "Description": "Earth’s moon; frequently referenced in navigation and often visible in orbital/planetary establishing shots."
    }
  ],
  "Inhabitants": "Humans are Earth’s native sentient species and the planet’s primary population across eras. As a Federation hub world, Earth also hosts frequent visitation and residency by many Federation member species; on-screen sources do not provide a consistent demographic breakdown.",
  "Tourism": "Earth is a premier destination for Federation-era history, culture, and iconic civic landmarks. Frequently highlighted canon points of interest include Starfleet’s San Francisco campus area, Paris as a Federation political site, and Bozeman’s First Contact legacy. The planet’s natural diversity supports a wide range of travel experiences.",
  "Logistics": "Approaches commonly route through Earth orbit and major transport infrastructure (spaceport/orbital facilities vary by era). Expect restricted access around Starfleet and Federation installations, and heightened security protocols during periods of crisis affecting the Sol sector.",
  "Weather": {
    "ClimateType": "Highly variable (multi-biome)",
    "Seasonality": "Varies strongly by region; temperate zones show pronounced seasonal cycles while tropical belts follow wet/dry patterns",
    "TypicalConditions": "Conditions range from marine-coastal fog and mild weather to continental storms and arid heat depending on location and season",
    "Hazards": [
      "Severe storms (region-dependent)",
      "Heatwaves/cold snaps (seasonal)",
      "Earthquakes/tsunami risk (localized)",
      "Wildfire risk (region-dependent)"
    ]
  },
  "History": {
    "Overview": "On-screen history places Earth’s major modern turning points across the 21st–24th centuries: the Bell Riots in September 2024; World War III ending in 2053 with a prolonged ‘post-atomic horror’ aftermath; First Contact with Vulcans on April 5, 2063; the rise of United Earth as a unified planetary authority in the 22nd century; and the founding of the United Federation of Planets on Earth in 2161. Earth remains strategically central and is repeatedly threatened by major external crises.",
    "KeyEras": [
      {
        "Era": "21st century (pre-warp)",
        "Summary": "Sanctuary Districts culminate in the Bell Riots (September 2024); later, World War III ends in 2053 and is followed by global turmoil remembered as the post-atomic horror."
      },
      {
        "Era": "First Contact and early interstellar era",
        "Summary": "Phoenix warp flight and first open Human–Vulcan contact occur on April 5, 2063 near Bozeman, Montana, accelerating Earth’s recovery and interstellar integration."
      },
      {
        "Era": "United Earth / NX era",
        "Summary": "Earth is unified under United Earth in the 22nd century; early Starfleet expands exploration and defense, including responses to major security threats."
      },
      {
        "Era": "Federation era",
        "Summary": "The Federation is founded on Earth (San Francisco) in 2161; Earth becomes a durable political, cultural, and Starfleet administrative hub."
      },
      {
        "Era": "Late 23rd–24th century crises",
        "Summary": "Earth is directly impacted by galaxy-scale events including the Whale Probe incident (2286), the Borg attack culminating in the Battle of Sector 001 (2373), and the Breen raid (2375)."
      }
    ],
    "MajorEvents": [
      {
        "When": "September 2024",
        "Event": "Bell Riots begin in San Francisco’s Sanctuary District A; treated as a pivotal social flashpoint."
      },
      {
        "When": "2053",
        "Event": "World War III ends; the ‘post-atomic horror’ describes the global turmoil that follows."
      },
      {
        "When": "April 5, 2063",
        "Event": "Phoenix achieves warp flight; first open Human–Vulcan contact occurs near Bozeman, Montana (First Contact Day)."
      },
      {
        "When": "22nd century",
        "Event": "Earth is unified under United Earth as a single planetary authority."
      },
      {
        "When": "2161",
        "Event": "United Federation of Planets founded on Earth (San Francisco)."
      },
      {
        "When": "2153",
        "Event": "Xindi probe attack strikes Earth, catalyzing an extended security and exploration response (Enterprise era)."
      },
      {
        "When": "2286",
        "Event": "Whale Probe crisis: a massive probe disrupts power and threatens Earth’s environment while seeking humpback whales."
      },
      {
        "When": "2373",
        "Event": "Battle of Sector 001: a Borg cube attempts to assimilate Earth; Starfleet destroys the cube with heavy losses."
      },
      {
        "When": "Late 2375",
        "Event": "Breen raid attacks Starfleet Headquarters and San Francisco, including damage to the Golden Gate region."
      }
    ]
  },
  "Government": {
    "Polity": "United Earth (unified planetary authority by the 22nd century); Earth is a founding member world of the United Federation of Planets",
    "Capital": "Not consistently stated on-screen (Earth is shown through multiple civic centers; Federation executive offices are associated with Paris and Starfleet’s principal campus with the San Francisco Bay / Presidio area)",
    "Institutions": [
      "United Earth (planetary authority; structure not consistently detailed on-screen)",
      "Office of the President of the United Federation of Planets (Paris, Earth)",
      "Federation Council (referenced as a central governing body)",
      "Starfleet Headquarters / Starfleet Command (San Francisco Bay / Presidio area)",
      "Starfleet Academy (headquarters in the Presidio; training facilities across the Golden Gate in Marin County)"
    ],
    "LawsAffectingVisitors": [
      "Standard transport, traffic-control, and customs procedures through orbital/planetary facilities (era-dependent)",
      "Restricted-access zones around Federation and Starfleet installations",
      "During security crises, emergency measures and heightened screening may be imposed; on-screen sources rarely enumerate specific legal texts"
    ],
    "Notes": "On-screen governance depictions on Earth focus mainly on Federation- and Starfleet-level institutions operating on-world; Earth’s planetary governmental mechanics are referenced far less directly than its role as a Federation hub."
  },
  "Economy": {
    "Overview": "In the Federation era, Earth is portrayed primarily as a civic, research, and administrative hub within a high-technology, low-scarcity society. On-screen stories rarely provide a single comprehensive description of Earth’s economic mechanisms.",
    "PrimaryIndustries": [
      "Education and research",
      "Public administration (Federation and Starfleet institutions)",
      "Cultural production and heritage preservation",
      "Orbital operations and logistics (in Starfleet contexts)"
    ],
    "TradeNotes": "Interstellar trade flows are implied through Earth’s status as a core world and major travel hub, but specific export/import profiles are not consistently stated on-screen.",
    "LocalCommerceNotes": "Local businesses and services appear across eras (especially in time-travel narratives), but details vary and are not systematically enumerated."
  },
  "Culture": {
    "Overview": "Earth culture is portrayed as pluralistic and strongly shaped by Federation-era ideals emphasizing education, exploration, and public service alongside local traditions.",
    "SocialCustoms": "Norms vary widely by region; metropolitan centers associated with Starfleet and Federation governance are often depicted as cosmopolitan and cross-cultural.",
    "ReligiousLife": "A wide variety of belief systems exist historically; on-screen sources do not present a single dominant faith and typically treat belief as personal and diverse.",
    "Festivals": "First Contact Day (April 5) commemorates the Phoenix warp flight and first open Human–Vulcan contact.",
    "ArtsAndMedia": "Earth remains a major cultural center with extensive artistic and educational traditions; specific institutions vary by story focus.",
    "LanguageNotes": "Many Earth languages are spoken; Standard is widely used in Federation contexts and multilingualism is common."
  },
  "Environment": {
    "Overview": "Habitable Class M biosphere with diverse ecosystems. Earth’s orbit is frequently depicted as a high-traffic region and a strategic theater during crises; Luna is a prominent nearby body in both navigation and imagery.",
    "Seasons": "Varies by latitude and region, ranging from four-season temperate cycles to tropical wet/dry patterns and polar extremes.",
    "NaturalHazards": [
      "Severe storms (region-dependent)",
      "Seismic/volcanic activity (localized)",
      "Wildfires (region-dependent)"
    ],
    "NightSky": "Luna is a dominant natural feature; in later eras, orbital traffic and installations are common near major population centers."
  },
  "Appearances": {
    "Overview": "Earth is a recurring setting across Star Trek, serving as Humanity’s homeworld and a central hub for Federation and Starfleet governance, as well as a frequent destination for time-travel stories and major crises.",
    "BySeriesOrFilm": [
      {
        "Era": "ENT",
        "Highlights": [
          "United Earth and early Starfleet operations; Earthside political/security stories in the pre-Federation period; the Xindi probe attack crisis and its aftermath."
        ]
      },
      {
        "Era": "TOS-era films",
        "Highlights": [
          "Federation/Starfleet institutions in San Francisco; the Whale Probe crisis impacting Earth in 2286."
        ]
      },
      {
        "Era": "TNG/DS9/VOY",
        "Highlights": [
          "Federation political center; internal-security crises; 2024 San Francisco time-travel depiction and Sanctuary District/Bell Riots arc; major strategic threats in the Sol sector."
        ]
      },
      {
        "Era": "PIC",
        "Highlights": [
          "Starfleet Headquarters/Federation policy context and Earthside personal/historical locations (era-dependent)."
        ]
      }
    ]
  },
  "CanonAppearances": {
    "Episodes": [
      "DS9: \"Past Tense, Part I\" / \"Past Tense, Part II\" (2024 San Francisco; Sanctuary Districts; Bell Riots)",
      "DS9: \"Homefront\" / \"Paradise Lost\" (Earth security crisis; Federation President’s office in Paris referenced)",
      "ENT: \"The Expanse\" (Xindi probe attack aftermath and response)",
      "DS9: \"The Changing Face of Evil\" (Breen attack on Starfleet Headquarters in San Francisco)"
    ],
    "Films": [
      "Star Trek: First Contact (Bozeman/First Contact; Borg attack and Battle of Sector 001 framing)",
      "Star Trek IV: The Voyage Home (Whale Probe crisis; Earth threatened in 2286)",
      "Star Trek VI: The Undiscovered Country (Federation President’s office associated with Paris)"
    ],
    "Notes": "Earth is referenced and/or visited across many additional episodes and films; this list highlights anchor appearances that establish key historical and governmental details used above."
  },
  "DataQuality": {
    "Confidence": "High",
    "Coverage": "High",
    "KnownGaps": [
      "Earth’s local planetary governmental structure and any single official planetary capital are not consistently defined on-screen",
      "Population figures and detailed economic mechanisms vary by era and are not uniformly stated"
    ],
    "VerificationNotes": "Key identifiers (Sol III/Terra; Sol system; Sector 001; Luna), institutional anchors (Starfleet HQ/Academy in the Presidio/San Francisco region; Federation President office in Paris), and major dated events (Bell Riots September 2024; World War III end 2053; First Contact April 5, 2063; Federation founding 2161; Whale Probe 2286; Battle of Sector 001 2373; Breen attack late 2375) are supported by on-screen references summarized in canon reference compilations."
  }
}
